{
	"thecuriouschickpea": [
		null,
		null,
		null,
		null,
		null,
		null,
		null,
		null,
		null,
		null,
		null,
		null,
		null,
		null,
		{
			"title": "Tamarind Red Lentil Soup",
			"ingredients": [
				"2 tsp coconut oil or vegetable oil, divided",
				"1 yellow onion, small dice",
				"4 cloves garlic, minced",
				"1-6 chilis, minced (to taste)",
				"1-inch piece ginger, minced (~1 1/2 tbsp)",
				"2 tsp ground cumin",
				"1 tsp ground coriander",
				"1 1/2 tsp salt, or to taste",
				"2 cups (400 g) dry red lentils, rinsed clean",
				"6 cups water",
				"1-3 tbsp tamarind concentrate",
				"1 15 oz can crushed or diced tomatoes (1 1/2 cups diced fresh tomatoes)",
				"1 15 oz can coconut milk",
				"2-3 tbsp fresh squeezed lemon juice",
				"cilantro, to garnish (optional)",
				"minced chilies, to garnish (optional)",
				"vegan butter, to serve (optional)"
			],
			"time": "55 minutes",
			"serving": "6-8 servings",
			"recipe": [
				"1. Heat 1 teaspoon of oil in a large heavy bottomed stock pot over medium heat. Add onion, and sauté it for 5 minutes, stirring occasionally, until soft and translucent.",
				"2. Add the additional teaspoon of oil and the minced garlic, chili, and ginger, and cook for 1 minute, stirring.",
				"3. Stir in the cumin, coriander, and salt, then add the rinsed lentils. Mix the lentils in and let cook for about 1 minute, stirring constantly. Then add the 6 cups of water and 1 tablespoon of tamarind concentrate.",
				"4. Bring to a boil over high heat, then turn the heat to low and simmer, covered, for 15 minutes, or until lentils are soft.",
				"5. Add the tomatoes and coconut milk, and bring to a simmer. Cook for an additional 15 minutes to allow flavors to meld and tomatoes to break down. As it cooks taste and add 1-2 more tablespoons of tamarind concentrate if needed.",
				"6. Turn off the heat and add the lemon juice, taste, and adjust any final seasonings to taste.",
				"7. Serve warm with a dollop of vegan butter (optional), minced cilantro, and minced chilies to taste."
			],
			"nutrition": {
				"calories": "419kcal",
				"carbs": "51g",
				"protein": "18g",
				"total fat": "18g"
			},
			"comments": [],
			"image": "https://www.thecuriouschickpea.com/wp-content/uploads/2017/04/tamarind-red-lentil-soup-pinterest-683x1024.jpg"
		},
		null,
		null,
		{
			"title": "Vegan Berbere Mac and Cheese",
			"ingredients": [
				"1 lb elbow macaroni*",
				"1 tbsp oil",
				"1 cup whole raw cashews",
				"1 small potato, peeled and diced into small pieces (1 cup)",
				"1-2 carrots, peeled and diced (1/2 cup)",
				"4 cloves garlic, roughly chopped",
				"3 cups water",
				"2 tbsp berbere (see note)",
				"1 - 1 1/2 tsp salt, to taste",
				"1/2 tsp turmeric (for color, optional)",
				"8 oz vegan cheddar style cheese",
				"1 cup injera crisp crumbs*"
			],
			"time": "45 minutes",
			"serving": "8 servings",
			"recipe": [
				"1. Preheat the oven to 375 ºF.",
				"2. Cook the pasta according to package directions, undercooking by 1-2 minutes. Drain and set aside.",
				"3. Heat the tablespoon of oil in a large pot over medium heat. Add the cashews, potato, carrots, and garlic and sauté until the cashews are golden in spots, about 2 minutes.",
				"4. Stir in the berbere, salt, and turmeric and let toast for 30 seconds. Add the water and bring to a boil. Turn the heat down to low, cover the pot, and let simmer until the potatoes and carrots are very soft, about 10 minutes but may take longer if the vegetables are cut larger.",
				"5. When soft, transfer the mixture to a blender and blend until smooth. Pour back into the pot and add the vegan cheese. Heat over low until the cheese has melted. Taste and adjust seasoning if needed.",
				"6. Combine the cheese sauce and the cooked pasta and transfer to an oven safe dish such as a casserole dish or cast iron skillet (I used a 9-inch cast iron skillet).",
				"7. Pulverize injera crisps (or see note below for substitution) in a food processor to make crumbs. Cover the top of the mac and cheese with the crumbs.",
				"8. Bake for about 15 minutes or until the mac and cheese is hot and bubbly and top is crispy. Enjoy!"
			],
			"nutrition": {
				"calories": "299kcal",
				"carbs": "36g",
				"protein": "10g",
				"total fat": "14g"
			},
			"comments": [
				"This is the best tasting vegan mac and cheese recipe I have ever tried! For the crumb topping I used breadcrumbs and added family favourite vegan cheese https://violifefoods.com/. My kids loved it so much, I will definitely be making this again!",
				"This was really good. My kids and husband loved it.",
				"I just tried this recipe last night for dinner and it turned out to be incredibly  delicious!!! Thank you!\nLoved the injera crumbs on top. I dried some leftover injera in the oven (I was going to order Tsiona&#8217;s injera crisps &#8211; they sound amazing, but they cost $90 to ship to Canada!!)",
				"Thank you so much for introducing me to the injera crisps by Tsiona Foods! They immediately became a favorite snack in my house! I no longer live in a place where I can buy fresh injera at the grocery store and these somewhat fill that craving too!"
			],
			"image": "https://www.thecuriouschickpea.com/wp-content/uploads/2021/03/vegan-berbere-mac-and-cheese-pinterest-683x1024.jpg"
		},
		{
			"title": "Kale Salad with Roasted Jalapeño Dressing",
			"ingredients": [
				{
					"Smoky Chickpeas": [
						"1 tbsp oil",
						"1 29 oz can (3 cups cooked) chickpeas, drained and rinsed",
						"1/4 cup low sodium tamari",
						"2 tbsp maple syrup",
						"1 tsp liquid smoke",
						"salt to taste"
					]
				},
				{
					"Dressing": [
						"2 jalapeños",
						"2 scallions, sliced",
						"1/2 cup tahini",
						"1/2 cup warm water",
						"2 tbsp lemon juice",
						"1 tsp salt"
					]
				},
				{
					"Everything else": [
						"1 large bunch flat leafed kale",
						"1 tsp olive oil",
						"1 red bell pepper, diced",
						"1 avocado",
						"pepitas, nuts, or other seeds for garnish (optional)"
					]
				}
			],
			"time": "30 minutes",
			"serving": "serves 4",
			"recipe": [
				"1. Roast the jalapeños: Turn your oven on broil and place a rack on the highest position. Roast the jalapeñoso on a baking tray under the broiler until the skins are blackened (~7-10 minutes). Turn every 2-3 minutes to roast evenly. Put roasted peppers in a bowl and cover to allow the steam to loosen the skin. Set aside while you prepare the chickpeas. ",
				"2. Heat a large skillet over medium heat. Add the oil and the chickpeas. Sauté for 7-10 minutes, stirring occasionally, or until the chickpeas turn golden.",
				"3. In a small bowl, mix together the soy sauce, maple syrup, and liquid smoke. Pour the mixture over the chickpeas and cook for an additional 1-3 minutes, stirring, until it has thickened and coats the chickpeas. Taste and add salt if desired. Remove from heat and set aside until ready to assemble the salad.",
				"4. Peel the burnt skin off the jalapeños, remove seeds, and roughly chop. Add the roasted jalapeños and the rest of the dressing ingredients in a small food processor or blender. Process until relatively smooth. Taste and adjust any seasoning to taste. If necessary, add more water to thin or tahini to thicken.",
				"5. Wash the kale and remove the stems. Easily do this by pinching the bottom of each stalk between two fingers then pull up, separating the leaves from the stem. Stack the de-stemmed kale leaves and roll them tightly, then slice into ~1/4 inch thick slices before chopping once or twice in the opposite direction to make bite sized pieces.",
				"6. Add chopped kale to a larage mixing bowl and drizzle with olive oil and a pinch of salt. Massage the kale with clean hands for a minute or two, until the kale has shrunk in volume and become tender.",
				"7. Dress the kale to taste, mix in the chickpeas, red bell pepper, and avocado. Top with pepitas or other nuts/seeds if using. Enjoy!"
			],
			"nutrition": {
				"calories": "561kcal",
				"carbs": "58g",
				"protein": "20g",
				"total fat": "31g"
			},
			"comments": [],
			"image": "https://www.thecuriouschickpea.com/wp-content/uploads/2017/04/kale-salad-jalapeno-dressing-pinterest-1-683x1024.jpg"
		},
		null,
		null,
		null,
		{
			"title": "Vegan Taco Pinwheels",
			"ingredients": [
				"1 package vegan puff pastry (about 1 pound, 2 sheets)",
				"2 tsp oil",
				"1 yellow onion, diced",
				"4 cloves garlic, minced",
				"15oz can black beans, drained and rinsed (scant 2 cups cooked beans)",
				"10-12oz vegan chorizo",
				"2 tsp chili powder",
				"1 tsp dried oregano",
				"1/2 tsp ground cumin",
				"1/2 tsp cayenne (more or less to taste)",
				"salt to taste",
				"8oz shredded vegan cheese",
				"3-4 scallions, thinly sliced"
			],
			"time": "1 hour 2 minutes",
			"serving": "24 pinwheels",
			"recipe": [
				"1. Take the puff pastry out of the freezer to defrost about 30-40 minutes before you need it. Preheat the oven to 400 ºF and line two baking trays with parchment paper or silicon mats.",
				"2. Warm the 2 teaspoons of oil in a large skillet over medium heat and add the onion and a pinch of salt. Sauté for 5-6 minutes, or until the onion is soft and translucent. Add the garlic and cook another 30-60 seconds.",
				"3. Add the black beans, vegan chorizo (chopped up if it isn't already in a ground texture), chili powder, oregano, cumin, and cayenne. Use less cayenne to keep it mild or use more to make it spicy.",
				"4. Sauté for about 5 minutes or until the mixture is heated through and the chorizo is lightly browned. Add salt to taste, how much depends on the saltiness of the vegan chorizo, I used about 1/2 teaspoon salt. Remove from  heat and let the mixture cool to about room temperature.",
				"5. Roll out a sheet of defrosted puff pastry to about a 10 by 12 inch rectangle. It doesn't need to be exact. Layer on about half the vegan cheese and half the bean and chorizo mixture. Top with half the sliced scallions.",
				"6. Starting from the short end, gently roll the pastry up to make a log. Press the log with your hands to seal the seam and stick layers a bit. Repeat with the second sheet of puff pastry and the remaining filling.",
				"7. Wrap the logs in plastic wrap or place in a sealed container and put it in the fridge for 20 minutes for the puff pastry to chill. You can leave it at this point for up to 1-2 days, if you want to prepare it in advance.",
				"8. After chilling, uncover the roll and trim the edges to make a flat cut on either side. Slice each log into about 12 slices, it's ok if you end up with fewer however.",
				"9. Lay the slices on the baking trays, leaving a couple inches of space between them as they will expand in the oven. Bake for 18-20 minutes at 400 ºF or until the pastry is golden brown and the cheese is melted.",
				"10. Enjoy warm or at room temperature with your favorite taco toppers (e.g. guacamole, vegan sour cream, salsa, hot sauce)."
			],
			"nutrition": {
				"calories": "178kcal",
				"carbs": "16g",
				"protein": "7g",
				"total fat": "10g"
			},
			"comments": [
				"What is the sauce you are dipping these into? Do you have a recipe for it?\nThanks"
			],
			"image": "https://www.thecuriouschickpea.com/wp-content/uploads/2021/02/vegan-taco-pinwheels-pinterest-683x1024.jpg"
		},
		null,
		null,
		{
			"title": "Peanut Tofu Spring Rolls",
			"ingredients": [
				{
					"Peanut Tofu": [
						"1 14oz block extra firm or super firm tofu",
						"1/2-3/4 cup smooth peanut butter",
						"1/2 cup hot water",
						"1-2 cloves garlic, crushed",
						"3 tbsp soy sauce",
						"3 tbsp hoisin",
						"2 tbsp fresh lime juice",
						"1 tbsp rice vinegar",
						"1-2 tbsp sriracha or other chili sauce",
						"salt, to taste",
						"2 tsp oil",
						"1/4 cup minced shallot"
					]
				},
				{
					"Everything Else": [
						"8 rice paper wraps (have extra to spare)",
						"fresh basil leaves",
						"fresh cilantro leaves",
						"fresh mint leaves",
						"90g dry rice vermicelli, prepared to package directions",
						"cucumber, peeled and julienned",
						"carrot, peeled and julienned",
						"red cabbage, thinly sliced"
					]
				}
			],
			"time": "30 minutes",
			"serving": "8 wraps",
			"recipe": [
				"1. If using extra firm tofu, slice the tofu into 6 slices widthwise and wrap in a lint free tea towel. Place something heavy on top and let drain for 10-20 minutes. Cut the sliced tofu into cubes. If using super firm tofu skip the pressing step.",
				"2. Mix together 1/2 cup peanut butter with hot water until it's smooth. Add the garlic, soy sauce, hoisin, lime juice, rice vinegar, and sriracha. Taste and add salt or adjus seasonings as needed. If the sauce is too thin add more peanut butter, if it's too thick add more water.",
				"3. Heat a large skillet over medium and add the oil, the cubed tofu, and a pinch of salt. Pan fry until the tofu is a light golden color on 3-4 sides, about 5 minutes. Wait to flip each side until it has browned for easy release from the pan.",
				"4. Add the minced shallot and let cook another 2-3 minutes alongside the tofu, until softened. Then add about half the prepared peanut sauce. Feel free o add more for a saucier tofu. Stir in the peanut sauce then turn off the heat.",
				"5. Run both sides of the rice paper wrap under hot water then place on a dampened cutting board. Arrange the basil, cilantro, and mint in the center of the wrap then top with the carrot, cucumber, and cabbage. Add some rice vermicelli and peanut tofu.",
				"6. Fold opposite ends of the softened rice paper in to partially cover the filling. Then fold the bottom into the center so that it meets the edges and seals and roll to wrap the spring roll. Repeat with the remaining wraps and filling.",
				"7. Leave the wraps whole or cut in half and enjoy fresh with extra peanut sauce for dipping!"
			],
			"nutrition": {
				"calories": "240kcal",
				"carbs": "24g",
				"protein": "11g",
				"total fat": "12g"
			},
			"comments": [
				"Hi, Can you please let me know where can I find the recipe for the peanut sauce?\nThanks in advance 🙂"
			],
			"image": "https://www.thecuriouschickpea.com/wp-content/uploads/2021/01/peanut-tofu-spring-rolls-pinterest-683x1024.jpg"
		},
		null,
		{
			"title": "Crispy Baked Buffalo Tofu Wings",
			"ingredients": [
				{
					"Bread Crumb Mixture": [
						"1 cup panko style bread crumbs",
						"2 tbsp olive oil",
						"1/2 tsp paprika",
						"1/2 tsp salt",
						"freshly ground black pepper",
						"1 tbsp fresh minced parsley"
					]
				},
				{
					"Buffalo Sauce": [
						"6 tbsp (90g) red cayenne pepper hot sauce, ideally Franks RedHot",
						"3 tbsp (35g) vegan butter",
						"1/8 tsp granulated garlic",
						"1/8 tsp salt"
					]
				},
				{
					"To serve": [
						"Vegan bleu cheese or ranch style dressing"
					]
				}
			],
			"time": "50 minutes",
			"serving": "18 tofu wings",
			"recipe": [
				"1. Preheat the oven to 425 ºF and lightly grease a large rimmed baking sheet.",
				"2. If using extra-firm tofu press out the extra water: Slice your tofu into 6 width-wise slabs and wrap in a lint-free towel or paper towel. Place some weights over the wrapped tofu, like a heavy cast iron skillet or books atop a baking sheet. Let drain for about 20-30 minutes before continuing.",
				"3. Cut your tofu into 18 'wings' or ~1/2\" sticks. Cut the block of tofu into 6 slices width-wise if you haven't already for pressing, then slice each of those slabs into 3 slices lengthwise.",
				"4. Put the cornstarch (or arrowroot or tapioca starch) in one bowl, the plant milk in a second bowl, and mix together the bread crumb mixture in a third bowl. Pour some of the bread crumb mixture onto a plate.",
				"5. Dip each tofu 'wing' into the starch, followed by the milk, then roll in the breadcrumbs on the plate. Place the wing onto the prepared baking sheet and repeat with the remaining 'wings.' Use one hand for the starch and bread crumbs and your other for the milk to keep breading from clumping on your fingers. Add more of the breadcrumb mixture to the plate as needed.",
				"6. Bake the prepared tofu at 425 ºF for 25 minutes, flip, then bake an additional 10-15 minutes until the tofu wings are nice and crispy.",
				"7. While they're baking, make the buffalo sauce. Melt the vegan butter and stir in the hot sauce, granulated garlic, and salt.",
				"8. Put the tofu wings in a large mixing bowl and toss with the buffalo sauce to coat. Serve immediately.",
				"9. Leftover buffalo tofu wings can be re-crisped in the oven."
			],
			"nutrition": {
				"calories": "329kcal",
				"carbs": "36g",
				"protein": "13g",
				"total fat": "17g"
			},
			"comments": [
				"This is the crispiest tofu recipe I have found so far since becoming vegan over 3 years ago.    My husband works late so instead of tossing the tofu completely in Buffalo sauce and having it get soggy, I just drizzled some over the top of the Buddha bowl I made for dinner.  He can add more later if he wants.   Really great recipe!",
				"Draining tofu should be in the prep time. As should enough time to bread the tofu. Dinner will be an hour late,not that it’s your problem, but this was not easy or quick.",
				"Made these last night for dinner and they are amazing!!!! Took the left overs for lunch today and almost as good. Thank you so much.",
				"I made these tofu wings last night, following the recipe as written, and my boyfriend loved them! I do not like buffalo sauce so I tossed mine in BBQ sauce and put them on a bun &#8211; it was an awesome sandwich. Thanks for sharing!",
				"I have been looking forward to making these for weeks. Today, I finally got around to it, and they were absolutely DELICIOUS!!",
				"would this still work using a medium firm tofu if i just press it beforehand for a lot longer?",
				"This is one of my favorite salads! I keep it in our regular rotation and love including it when I have anyone over who “isn’t in to tofu”. They are always pleasantly surprised. Thank you!",
				"Wow these were incredible! Since starting my journey in Januray (now March), I&#8217;ve been craving wings so bad and now I have them muhahahaha! I would say after the initial 25 minute bake &#8211; follow-up with a 5 minute bake instead of the full 10 to avoid it being overly crispy. Otherwise 10/10 recipe!!!!!",
				"I must have done something slightly wrong. The taste was great and the breaded tofu was super crispy&#8230;until I threw them in the mixing bowl and tossed them in the sauce. They became very soggy. Still tasted great and will be good on salad, but not exactly what I was ho[ing for.",
				"These were SO good!!",
				"These are SO GOOD!! I&#8217;m a new vegetarian and was really missing buffalo wings- these are a great replacement!",
				"I&#8217;ve made these a few times now and it&#8217;s one of my favorite recipes! I&#8217;m not vegan, but I love that the tofu makes them feel a bit healthier while still keeping the Buffalo taste.",
				"Delicious! Even my daughter, who doesn’t like tofu, liked it. I highly recommend trying it!",
				"Just made these&#8230; They are SOOOOOOO good!  Thank you for sharing such a great recipe.",
				"These are the BEST vegetarian wings I have ever had! Franks is my favorite hot sauce and I like to dip with creamy parm dip i buy at a local chain restaurant.  I don&#8217;t miss chicken at all.  Thanks for this recipe!  I look forward to trying it with mac &amp; cheese.",
				"I just made these and they were delicious! I did marinate the tofu in some sriracha, cumin, garlic powder &amp; chili powder for a few hours first but otherwise followed the recipe (except I used regular butter) and it turned out amazing!",
				"We absolutely love this recipe! I’ve made it several times. Tonight we made them as recipe suggested and did avocado ones as well. \nThank you for sharing!\nThe Murphy’s",
				"You can exit out of it by clicking the X button.",
				"Hey,\nThanks for a great recipe, I hope it will go down as a treat. Out of curiosity which plant milk have you tried and which do you think gives you the most consistent texture?",
				"Can I use garlic powder instead of granulated garlic?",
				"Hi! I was wondering if I could use flour instead of cornstarch? Thanks ! 🙂",
				"I just made these last night and they are AMAZING! Seriously I ate so many!",
				"I made these for me and my husband the other night. Wow! What a winning recipe! I will he making these again for sure (maybe often;). Thank you for that recipe!",
				"This was delicious. Only thing I’ll change next time is to serve the sauce on the side. I enjoyed eating them straight from the oven!",
				"This recipe is just the best. You can change up the seasonings and hot sauces and it&#8217;s still fantastic.  Can&#8217;t stop sharing it with my friends.",
				"I have never posted a review on a recipe before but this was great!! Will for sure make again. Thank you!",
				"These were a huge hit! We will definitely be using this recipe again. Lots of flavor + good texture. Other buffalo tofu recipes we’ve tried have been really dull inside but this was not lacking at all.  Thanks for sharing!",
				"I didn&#8217;t have any breadcrumbs so I used oats and put them in a food processor. Weren&#8217;t crispy but I still loved it!!!!",
				"Made these tonight and they were lovely! Used regular bread crumbs, maybe not *as* crispy but still delicious! Made them in my toaster over and broiled them to crisp them up more. Dipped them in a quick home made tzatziki. I&#8217;ll definitely be making them again!\nThanks Eva, can&#8217;t wait to check out more of your recipes (:",
				"I have made these over four times. They are amazing. I’m newly vegan. This recipe has  saved me. Thanks",
				"Great recipe!  Followed almost exactly but just forgot the oil!  No matter they were still crispy good.  Thank you!",
				"Just tried these vegan tofu bites. They are absolutely delicious. Ever since giving up meat buffalo chicken was one of the things that I really missed… These definitely do it for me. I made these for my husband’s birthday along with some vegan mac &amp; cheese for a southern style birthday dinner. Definitely super excited for these. They will definitely be becoming part of our regular meal lineup yet. Thank you so much for this recipe",
				"I was so impressed with this recipe! It tasted so good and the texture was great. The only issue I had was I felt like they tasted too buttery, next time is probably use little to no vegan butter and just stick with dipping them in the hot sauce. I will definitely be making these again though and was still so pleased with how they turned out 🙂",
				"I actually have the same question.  I would like to try these with tempeh, I feel like this would give it more texture.  Any feedback from someone who has tried the recipe with tempeh would be appreciated.",
				"Made exactly as directed &#8211; it was absolutely delicious!  We are definitely making this again.",
				"Definitely a late reply, but we&#8217;ve used convection bake on our air fryer to dramatically cut the cooking time on these &#8211; something like 8 minutes with no flip required.",
				"Do you think this same recipe could be used for cauliflower?or  tempeh? One of our favorite places does tempeh wings and they&#8217;re so nice and crispy (obviously fried!) but we&#8217;d love to try a healthier version.",
				"This was amazing! I made a batch and then made more later in the week it was just so good. We ate it as a salad with blue cheese- which I have never liked before. It was very good with this. I just used the franks buffalo sauce as the sauce for the tofu and it was delicious and easy. I think the base recipe of the tofu sticks would be great with other sauces too- a lemon-y sauce to make a vegan lemon chicken.",
				"I don’t know what I did wrong!! I was so excited to eat these and they ended up just tasting like cornstarch. I used regular breadcrumbs instead of panko, but don’t think that should make too much of a difference. ???",
				"These exceeded my expectations. Buffalo wings are my number 1 craving, and these were fantastic. I served them in wraps with lettuce, tomato, cucumber, and avocado. A creamy dressing would pair beautifully. As a vegan buffalo wing recipe 10/10 would recommend. Can&#8217;t wait to try the recipe with other sauces, too. Thank you!",
				"I am so impressed with this recipe! I made it using Frank&#8217;s new Buffalo Wings sauce. I forgot the 2 Tbsp. olive oil in the panko mixture but the tofu still turned out crispy and delicious. I did have to flip the wings about 15 minutes in to avoid browning them too much, but that could be a result of the lack of oil. They turned out very spicy and fantastic with light ranch dressing.\nThank you so much!",
				"These were soooo gooood &#8211; thank you!",
				"Just made this recipe and absolutely *loved* it. My husband isn&#8217;t keen on tofu, but I think I&#8217;ve got him hooked on this recipe. We absolutely adored the base tofu recipe without the sauce. The sauce nearly killed my hubby&#8217;s sensitive taste buds, so I had to tame it a bit. I will definitely be making this again though.",
				"I&#8217;ve been eyeing this recipe for a while now and am dying to make a salad w/ it, as pictured! Just curious what other veggies would go well w/ it? And if kale can be used instead of romaine?\nThanks so much!",
				"I made these tofu wings last night for dinner with some sweet potato chips a salad, and OMG they were so delicious. I used encona hot pepper sauce instead because thats what we had in the cupboard. I will definitely be making the again, everyone loved them!",
				"Thanks for sharing! Do they keep long?",
				"This looks so good! What a great protein meal prep to keep handy in the fridge!",
				"Thoughts on trying these in the air fryer?",
				"Stumbled on your site and this recipe today. I made the buffalo tofu wings tonight and loved them! Easy recipe with very good results! Thank you!",
				"Great taste better than I could imagine",
				"Can Sriracha be used instead of Frank&#8217;s Red Hot for a different flavor?",
				"We like this recipe so much that we are making the tofu into small cubes to have on skewers with sweet yellow peppers and cherry peppers for my daughter&#8217;s wedding reception.  We&#8217;ll have Follow Your Heart Bleu Cheese and JUST Ranch for the sauce options.",
				"We are a newly vegetarian couple and my boyfriends son is still a meat-eater. He had no idea this wasn’t chicken or that the dressing (we used Daiya) was vegan!  We used regular butter instead of vegan butter bc it’s what we had. But we LOVED this recipe!",
				"Omg these are soo damn good.!",
				"I was a bit disappointed with all the positive reviews.  It was decent but I feel the actual tofu needed some kind of  marinade for it to make me want to make it again.",
				"Can I use regular bread crumbs instead of the panko? Thanks.",
				"This turned out amazing! I didn’t have “follow your heart” ranch or blue cheese, but I do have vegannaise, mrs dash onion &amp; herb, and unsweetened soy milk on hand. That makes a great ranch dressing in a pinch. 😉",
				"I was in search of a baked tofu french fry recipe when I found this! Looks so good &#8211; I&#8217;m definitely going to try it! But how do you think this would be without the buffalo sauce, just as a good basic crunchy fry recipe?",
				"Just made these! So so good!!!",
				"What should I do to reheat it?",
				"Made these buffalo tofu wings for the family last night &#8211; they were soooo crispy and delicious. Everyone loved them dipped in Follow Your Heart Bleu Cheese style dressing.  Let&#8217;s just say there were no leftovers!  Yum Yum, Eva!",
				"Is it possible to skip on adding oil? ?",
				"Girrrrrllll! This recipe is incredible!  I’m not a picky eater but rarely does a dish make me want to dance on the table. I didn’t, but I wanted to. We had the wings on greens, topped sweet peppers, celery and cherry tomatoes. I thought I would never again get to eat buffalo style food but this has brought new hope. Now I have something to eat on “game day” besides guacamole and chips. My roomies (who aren’t vegan) loved it too and want me to make it again soon. Thank you so much! .",
				"These were AMAZING I&#8217;ve been looking for a recipe like this for years! They were perfect!!",
				"Amazing recipe! I made the 2x this week. Thanks for sharing and Happy New Year!",
				"Wow! These are amazing. I love them. Thanks for the recipe!",
				"I just finished this recipe. Amazingly good. I seriously had my doubts but.  WOW! So good. Thank you!\n     Matt J.   Denver, CO.",
				"I can&#8217;t read the directions because an ad is covering them up.  I tried reporting the ad to google but another one popped up immediately"
			],
			"image": "https://www.thecuriouschickpea.com/wp-content/uploads/2018/07/buffalo-tofu-wings-pinterest-683x1024.jpg"
		},
		{
			"title": "Vegan Creamy Garlic Pasta with Shaved Brussels Sprouts",
			"ingredients": [
				{
					"Garlic Sauce": [
						"1 cup raw cashews",
						"3-5 cloves garlic, chopped",
						"1/4 cup nutritional yeast or grated vegan parmesan",
						"1/2 tsp salt",
						"3 cups water",
						"2 tbsp vegan butter",
						"3 tbsp all purpose flour"
					]
				},
				{
					"Everything Else": [
						"1 lb spaghetti or other pasta shape",
						"1 cup reserved pasta water",
						"1 lb Brussels sprouts",
						"1 tbsp oil",
						"1/4 tsp salt",
						"freshly ground black pepper, to taste"
					]
				}
			],
			"time": "35 minutes",
			"serving": "8 servings",
			"recipe": [
				"1. Cook pasta in salted water according to package directions, drain and reserve 1 cup of pasta cooking water.",
				"2. In a blender combine the cashews, garlic, nutritional yeast (or vegan cheese), salt, and water. Blend until smooth and creamy, pausing to scrape down the sides as needed. See note below if not using a powerful blender.",
				"3. Melt the vegan buter In a medium pot over medium-low and add the flour. Let the mixture cook until the flour is golden and a couple of shades darker. Slowly pour in the garlic-cashew mixture while whisking to prevent clumps. Turn up the heat to medium and bring the sauce to a simmer and let it simmer until thickened.",
				"4. Pour the sauce into the pasta and stir to coat. Add some of the reserved pasta water if necessary. Add salt and pepper to taste.",
				"5. Trim off the ends of the sprouts and remove any damaged leaves. Cut the sprouts in half, then thinly slice.",
				"6. Heat the oil in a large skillet over medium heat and add the shaved Brussels sprouts with a 1/4 tsp of salt. Cook until the sprouts have wilted and shrunk in size, and are golden and crispy in areas, about 6-7 minutes.",
				"7. Place the spaghettti in a serving dish or into individual bowls. Top with the cooked sprouts and serve! "
			],
			"nutrition": {
				"calories": "297kcal",
				"carbs": "36g",
				"protein": "10g",
				"total fat": "14g"
			},
			"comments": [],
			"image": "https://www.thecuriouschickpea.com/wp-content/uploads/2021/01/shaved-brussels-sprouts-creamy-garlic-pasta-8-683x1024.jpg"
		},
		null,
		{
			"title": "Vegan Reuben Sandwich",
			"ingredients": [
				{
					"Corned Tempeh": [
						"8oz tempeh",
						"1/2 cup vegetable broth",
						"1 tbsp soy sauce",
						"1 tbsp red wine vinegar (or apple cider vinegar)",
						"1 tsp vegan Worcestershire sauce",
						"1 clove garlic, minced",
						"1 tsp dry ground mustard seed",
						"1 tsp smoked paprika",
						"1/2 tbsp ground coriander",
						"1/4 tsp ground allspice",
						"1/2 tsp salt",
						"1/2 tsp crushed red pepper",
						"1 tbsp oil"
					]
				},
				{
					"Everything Else": [
						"Sliced rye bread",
						"Sauerkraut",
						"Thousand island dressing",
						"Vegan Cheese Slices (optional)",
						"Vegan butter"
					]
				}
			],
			"time": "55 minutes",
			"serving": "4 sandwiches",
			"recipe": [
				"1. Cut the tempeh into thirds lengthwise. Then cut each piece into three thin slices. Place in a shallow dish or a ziplock bag.",
				"2. In a large measuring cup mix together the rest of the corned tempeh ingredients except for the oil. Pour the marinade over the tempeh and let marinate for 30 minutes. Stir occasionally (or toss if in ziplock bag) to evenly marinate the tempeh. You can do this step in advance and refrigerate the tempeh while marinating for up to 1 day.",
				"3. Heat a large skillet over medium and add a little oil to coat the pan. Remove the tempeh from the marinade, letting excess marinade drip off the tempeh before transferring it to the hot pan. You may have to cook the tempeh in batches so the tempeh can cook in a single layer.",
				"4. Cook the tempeh for 2-4 minutes on each side or until golden. If cooking in two batches, remove the first batch from the skillet and fry the second batch. When all of the tempeh is browned add the first batches back in and pour the remaining marinade over the tempeh. Let the marinade come to a boil and soak into the tempeh, glazing the outside. Flip the tempeh a few times to evenly coat everything.",
				"5. Clean the skillet out from the tempeh then heat back over medium-low heat.",
				"6. Butter the outside of the slices of bread and place buttered side down on the hot skillet.",
				"7. Place sliced vegan cheese on one slice of bread (if using). Then spread some thousand island dressing on the second slice. Pile warm corned tempeh over the cheese as it melts (use 1-3 slices of tempeh per sandwich depending on size of bread and your appetite). Top the tempeh with sauerkraut, and when the bread is toasted top it with the thousand island dressed slice. Serve immediately!"
			],
			"nutrition": {
				"calories": "488kcal",
				"carbs": "40g",
				"protein": "20g",
				"total fat": "29g"
			},
			"comments": [
				"We made these tonight, and they were delicious!! We mixed in some jackfruit with the tempeh because we did not buy enough tempeh, and it worked well. Very tasty, thank you for the recipe!",
				"Sounds delicious&#8230; However, Worcestershire sauce is NOT vegan!  It contains anchovies.\nNot sure if a true vegan option is available."
			],
			"image": "https://www.thecuriouschickpea.com/wp-content/uploads/2021/01/vegan-tempeh-reuben-3-683x1024.jpg"
		},
		null,
		null,
		null,
		null,
		{
			"title": "Homemade Giardiniera",
			"ingredients": [
				{
					"Dressing": [
						"4 cloves garlic, minced",
						"3/4 cup (125g) chopped marinated green olives",
						"1 tbsp dried oregano",
						"1 tsp red pepper flakes",
						"1/2 tsp celery seeds",
						"freshly ground black pepper to taste",
						"1 cup apple cider vinegar, white wine vinegar, or white vinegar (more as needed)",
						"1 cup extra virgin olive oil"
					]
				}
			],
			"time": "3 days 20 minutes",
			"serving": "10 cups",
			"recipe": [
				"1. In a large mixing bowl combine the diced cauliflower, onion, bell peppers, carrot, celery, jalapeño, and 1/2 cup of coarse kosher salt. Add enough cold water to cover the vegetables, then put a lid over the container and refrigerate for 12-24 hours.",
				"2. After soaking, drain and rinse the vegetables and set aside in the large mixing bowl.",
				"3. In a medium mixing bowl mix together all the ingredients for the dressing.",
				"4. Pour the dressing over the vegetables, toss, and cover the bowl or transfer to clean glass jars. If the vegetables aren't fully submerged, top off with one cup of water then if more liquid is needed top with additional vinegar until the vegetables are covered. Use distilled water, filtered water, or boiled and cooled water for longer storage.",
				"5. Refrigerate for at least 48 hours before enjoying. The vegetables will get more flavorful the longer it marinates. Homemade giardiniera will last for at least several weeks in the fridge."
			],
			"nutrition": {
				"calories": "63kcal",
				"carbs": "2g",
				"protein": "0g",
				"total fat": "6g"
			},
			"comments": [],
			"image": "https://www.thecuriouschickpea.com/wp-content/uploads/2020/12/hot-giardiniera-10-683x1024.jpg"
		},
		{
			"title": "Homemade Roti",
			"ingredients": [
				"2 - 2 1/2 (250-300g) atta flour",
				"1 tsp (6g) salt",
				"2 tbsp (26g) oil",
				"1 cup (235g) room temperature water"
			],
			"time": "1 hour 35 minutes",
			"serving": "8 roti",
			"recipe": [
				"1. Whisk 2 cups (250g) atta flour and salt together in a large mixing bowl. Add the oil and stir it in until the flour looks sandy. Add the water and mix to make a shaggy dough.",
				"2. Knead the dough for 10 minutes (you can use a stand mixer). Add more atta as needed to make a soft but not sticky dough.",
				"3. Drizzle some oil into a bowl and roll the dough ball to coat. Cover and set aside to rest for at least 30 minutes but ideally more than one hour. For 1-2 days you can keep the dough in a sealed container in the fridge. Let come to room temperature before shaping.",
				"4. Divide the dough into 8 pieces and roll each piece into a ball. Shaping one piece at a time (leave the rest covered), flatten it with your palm to make a disk, then roll it out into a thin circle, about 7-8 inches. Roll out a few pieces of dough before cooking.",
				"5. Heat up a dry tawa or skillet over medium-high heat. Brush off any flour from the surface of the roti dough then place it on the skillet. Let cook on the first side until the top of the dough just starts to look dry, then flip the dough.",
				"6. Brush the top side with a thin layer of oil. Let the second side cook until it has light brown spots, then flip the dough again. Brush the second side with oil.",
				"7. Continue cooking the roti until both sides have browned and even turned black in spots, flipping once or twice as needed. At this time you can help the center puff up by pressing the dough with a cloth or paper towel, or the spatula.",
				"8. Place the cooked roti in a tortilla warmer or ziplock bag lined with a paper towel or wrap them in a cloth towel. Let steam and soften for 5 minutes (or just while the remaining roti cook) before serving."
			],
			"nutrition": {
				"calories": "167kcal",
				"carbs": "29g",
				"protein": "4g",
				"total fat": "4g"
			},
			"comments": [
				"Truly appreciate the way you made this roti recipe so perfectly. Everything is so nicely described that really helped. It is a staple food in India. Tandoori roti is another verson which is crispier than this roti and as popular as it. &lt;a ref=&quot;https://www.hassanchef.com/2020/12/tandoori-roti-recipe.html&quot;tandoori roti recipe is another good choice for your audience to try and make at home.",
				"The rotis were so soft and tasty as I used Aashirvaad Select Atta."
			],
			"image": "https://www.thecuriouschickpea.com/wp-content/uploads/2020/11/homemade-roti-12-683x1024.jpg"
		},
		null,
		{
			"title": "Homemade Tamarind Chutney",
			"ingredients": [
				"250g raw tamarind pulp (with seeds)",
				"3 cups water, more as needed",
				"1 cup sugar, more to taste",
				"1 tsp chili powder",
				"1 tsp ground cumin",
				"1 tsp ground coriander",
				"1/2 tsp ginger powder",
				"1 tsp salt (or substitute kala namak)",
				"1 tsp black pepper"
			],
			"time": "35 minutes",
			"serving": "2 1/4 cups",
			"recipe": [
				"1. Add tamarind pulp to a pot and cover with 3 cups of water. Bring to a simmer and let simmer covered for about 20 minutes or until the tamarind is very soft and has broken down. If it gets too thick at any point, add more water.",
				"2. Add the sugar, spices, salt, and pepper and stir in. Cook over medium-low heat for about 3 minutes for the spices to release their flavor.",
				"3. Set up a wire strainer over a large bowl. Transfer the tamarind pulp to the strainer and push the juice through using a large spoon (wooden or metal). You'll be left with a thick and fibrous pulp in the strainer which you can discard.",
				"4. Taste the chutney concentrate in the bowl and adjust spices, salt, and sugar to taste. Some tamarind is more tart and requires more sugar.",
				"5. Store in clean glass jars for up to 2 months in the fridge. You can freeze the chutney for longer storage.",
				"6. Thin out as desired when you serve it."
			],
			"nutrition": {
				"calories": "39kcal",
				"carbs": "10g",
				"protein": "0g",
				"total fat": "0g"
			},
			"comments": [
				"Notes, &#8220;If using tamarind concentrate, then use about 2 cups of concentrate and add sugar to taste.&#8221; 2 cups? Of concentrate?"
			],
			"image": "https://www.thecuriouschickpea.com/wp-content/uploads/2020/11/tamarind-chutney-8-683x1024.jpg"
		},
		{
			"title": "Kale Pakoras",
			"ingredients": [
				"4 cups finely chopped kale (stems removed), 3-4 leaves",
				"2 tsp garam masala",
				"2 tsp coriander powder",
				"2 tsp ground cumin",
				"2 tsp turmeric",
				"2 tsp chili powder (Indian chili powder, cayenne, or chili powder blend)",
				"1 tsp garlic powder",
				"1 tsp amchoor powder (substitute 1 tbsp lemon juice or omit)",
				"1 1/2 tsp salt",
				"2 cups besan (chickpea flour)",
				"1 1/2 - 2 cups water",
				"1/2 red onion, finely chopped",
				"2+ green chilies, minced (more or less to taste)",
				"Oil to fry"
			],
			"time": "30 minutes",
			"serving": "24 pakoras",
			"recipe": [
				"1. Add the kale to a large mixing bowl and massage with your hands until the kale has shrunk in size and turned a bit tender.",
				"2. Add all of the spices and salt to the kale and stir to evenly coat. Add the besan and mix in, then add the water (start with 1 1/2 cups) and stir to make a thick batter, add more water as needed. Stir in the onion and chilies.",
				"3. Heat 2-inches of oil in a large pot to deep fry or about 1/2-inch of oil in a pan to shallow fry. Heat until the oil is 350-365 ºF or until the oil boils around the handle of a wooden spoon (or chopstick/skewer).",
				"4. Shape about 2 tablespoon portions of batter into patties, and fry in batches so not to overcrowd the pan. Fry for 2-4 minutes or until a dark golden color. Flip halfway through, especially if shallow frying. Remove from oil with a slotted spoon and let drain on a paper towel lined plate.",
				"5. Serve hot with chutney and/or ketchup for dipping and enjoy!"
			],
			"nutrition": {
				"calories": "45kcal",
				"carbs": "2g",
				"protein": "1g",
				"total fat": "4g"
			},
			"comments": [
				"Thank you for all of the wonderful recipes! I would like to make this, but I do not eat kale. Would baby spinach be okay to use as a substitute?"
			],
			"image": "https://www.thecuriouschickpea.com/wp-content/uploads/2020/11/kale-pakoras-3-683x1024.jpg"
		},
		{
			"title": "Creamy Vegan Mushroom Gravy",
			"ingredients": [
				"2 tbsp vegan butter (substitute extra virgin olive oil)",
				"1 small yellow onion, diced (1 cup)",
				"8 oz cremini mushrooms, sliced",
				"2 cloves garlic, minced",
				"2 tbsp flour",
				"2 tbsp nutritional yeast",
				"1/2 tsp dried thyme",
				"1/2 tsp dried sage",
				"white pepper, to taste",
				"salt, to taste",
				"2 cups vegetable broth"
			],
			"time": "35 minutes",
			"serving": "2 cups",
			"recipe": [
				"1. In a medium pot melt the vegan butter over medium heat (or warm olive oil). Add the onions with a pinch of salt and cook until they are soft and a pale golden, about 8-10 minutes. If the onion starts to brown, turn the heat down.",
				"2. Add the mushrooms, garlic, and a pinch of salt and cook until the mushrooms have released their water and have lightly browned, about 8-10 minutes.",
				"3. Add the flour, nutritional yeast, thyme, sage, and some white pepper and stir to coat the onion and mushroom mixture. Let toast for 1 minute.",
				"4. Slowly pour in the broth while stirring, then bring to a simmer and let simmer until somewhat thickened, about 5 minutes.",
				"5. Transfer the gravy to the blender and blend until smooth. Season with salt and pepper to taste. Enjoy immediately or store in a sealed container in the fridge for up to a week (freeze for longer storage)."
			],
			"nutrition": {
				"calories": "56kcal",
				"carbs": "5g",
				"protein": "2g",
				"total fat": "3g"
			},
			"comments": [
				"Wow, this recipe is ABSOLUTELY FANTASTIC!\nI made this and couldn&#8217;t believe how amazing it tasted!! My man was also absolutely stunned!\nI would give 50 stars, not five if possible!! THANK YOU SO MUCH",
				"Yum! Mushroom gravy is always so good, I&#8217;ll have to try out this recipe 🙂\nJenna ♥"
			],
			"image": "https://www.thecuriouschickpea.com/wp-content/uploads/2020/11/creamy-vegan-mushroom-gravy-1-683x1024.jpg"
		},
		{
			"title": "Vegan Tandoori Sheet Pan Dinner",
			"ingredients": [
				{
					"To serve:": [
						"More yogurt or raita",
						"Thinly sliced red onion (soaked in ice water)",
						"Minced cilantro",
						"Wedges of lime or lemon",
						"Basmati rice and/or Indian flatbread"
					]
				}
			],
			"time": "55 minutes",
			"serving": "8 servings",
			"recipe": [
				"1. Preheat the oven to 450 ºF.",
				"2. If using extra firm tofu, cut into 6 slices width wise and arrange in a single layer on a lint free towel. Wrap the towel around the tofu and place something heavy on top and let drain for 20-30 minutes. Then cut into cubes. If using super firm, just cut into cubes, no need to press.",
				"3. In a mixing bowl whisk together the yogurt, lime or lemon juice, oil, garlic, ginger, methi, garam masala, coriander, chili powder, turmeric, and salt to make the tandoori sauce.",
				"4. In a large mixing bowl gently toss the tofu, cauliflower, and potato in the tandoori yogurt sauce.  Spread over 1-2 large baking trays (don't overcrowd) and bake until the potatoes are fully tender, about 30-40 minutes, stirring halfway through. ",
				"5. Serve immediately, with yogurt, red onion, cilantro, and wedges of lime/lemon, and a side of rice or bread. Enjoy!"
			],
			"nutrition": {
				"calories": "211kcal",
				"carbs": "26g",
				"protein": "14g",
				"total fat": "8g"
			},
			"comments": [
				"Making this tonight!",
				"This was amazing, made it for 4 people with side of brown basmati rice and vegan raita.  Will most definitely make it again, huge hit all around!",
				"This recipe is right up my alley. Can I use fenugreek powder in place of the leaves? If so, how much would you recommend?",
				"This was delicious! Thanks for the recipe.",
				"Yum that looks amazing! I love a good sheet pan dinner, I made one the other night with tofu, sweet potato, and onion. So tasty!\n Jenna ♥"
			],
			"image": "https://www.thecuriouschickpea.com/wp-content/uploads/2020/10/vegan-tandoori-sheet-pan-dinner-11-683x1024.jpg"
		},
		null,
		null,
		null,
		null,
		{
			"title": "Curried Tofu Salad",
			"ingredients": [
				"1 block extra firm or super firm tofu",
				"3/4 cup vegan mayonnaise",
				"1 tsp dijon or yellow mustard",
				"1 tsp lime zest (from 1 lime)",
				"1 tbsp fresh lime juice",
				"1 1/2 tsp curry powder",
				"1 tsp onion powder",
				"1/2 tsp granulated garlic",
				"1/4 tsp turmeric (optional, for color)",
				"1/2 - 1 tsp salt (see note), or to taste",
				"black pepper to taste",
				"1/4 cup chopped roasted cashews",
				"2 tbsp minced chives"
			],
			"time": "15 minutes",
			"serving": "3 cups",
			"recipe": [
				"1. Crumble tofu and add to a mixing bowl. Add the rest of the ingredients, starting with 1/2 tsp of salt, and mix together. See note if using kala namak.",
				"2. Adjust salt and pepper to taste, and any other seasonings as needed. The yellow color from the turmeric will develop after a couple hours."
			],
			"nutrition": {
				"calories": "155kcal",
				"carbs": "5g",
				"protein": "6g",
				"total fat": "13g"
			},
			"comments": [
				"This was delicious take in egg salad and the cashews added a great flavor and texture. Was filling but not too heavy. Definitely something I will try to serve others"
			],
			"image": "https://www.thecuriouschickpea.com/wp-content/uploads/2020/10/curried-tofu-salad-7-683x1024.jpg"
		},
		{
			"title": "Red Curry Lentil Soup",
			"ingredients": [
				{
					"Chickpea croutons": [
						"28oz can chickpeas (3 cups cooked), drained and rinsed",
						"2 tbsp red curry paste",
						"1 tbsp oil",
						"1 tbsp soy sauce",
						"1/2 tsp salt"
					]
				},
				{
					"Curry Cauliflower Soup": [
						"1 tbsp oil",
						"1 large red onion, diced",
						"6 cloves garlic, minced",
						"1 tbsp crushed red chili, or to taste (substitute fresh Thai or green chiles to taste)",
						"1/4 cup red curry paste",
						"2 cups (340g) red lentils, rinsed well",
						"1 large cauliflower, cut into large florets",
						"4 cups vegetable broth",
						"2 tbsp tamari (can substitute soy sauce if not gluten free)",
						"15 oz can coconut milk",
						"1 tsp salt, or to taste",
						"1/4 cup fresh squeezed lime juice, more to taste",
						"chives, for garnish (optional)"
					]
				}
			],
			"time": "40 minutes",
			"serving": "8 servings",
			"recipe": [
				"1. Preheat the oven to 400 ºF. In a large mixing bowl add the chickpeas, curry paste, oil, soy sauce, and salt. Toss to coat. Spread in an even layer on a parchment lined baking tray and bake for 30 minutes, stirring every 10 minutes.",
				"2. Heat a large heavy bottomed pot over medium heat. Add the oil and onion, and cook for 5-7 minutes, stirring occasionally, until the onion is soft and lightly golden. Add the garlic, chili, and curry paste and fry for 1 minute, stirring almost constantly.",
				"3. Add the red lentils and cauliflower and stir to coat in the curry paste. Add the vegetable broth and soy sauce and bring to a boil over high heat. Once boiling, turn the heat to low and maintain a simmer, partially covered, for around 15 minutes, or until the cauliflower and lentils are soft. Turn off the heat.",
				"4. Using an immersion blender or a regular blender, blend until fairly smooth. Return to the pot if using a regular blender. Add the coconut milk, salt, and lime juice and turn the heat on low until warm. Taste and adjust salt and lime juice as needed. Turn off heat.",
				"5. Ladle soup into bowls and top with the chickpea croutons. Optionally you can garnish with minced chives and/or minced chilies. A drizzle of chili oil or chive oil (see note) would be nice as well."
			],
			"nutrition": {
				"calories": "467kcal",
				"carbs": "57g",
				"protein": "21g",
				"total fat": "18g"
			},
			"comments": [
				"Two tablespoons of tamari are listed in the ingredient list for the soup, but this ingredient doesn&#8217;t appear anywhere in the instructions when making the soup. Is its inclusion missing?"
			],
			"image": "https://www.thecuriouschickpea.com/wp-content/uploads/2017/08/red-curry-lentil-soup-8-683x1024.jpg"
		},
		null,
		{
			"title": "Vegan Gochujang Tempeh Wings",
			"ingredients": [
				{
					"Gochujang Mayo": [
						"1/2 cup mayonnaise",
						"2-4 tbsp gochujang"
					]
				}
			],
			"time": "40 minutes",
			"serving": "16 wings",
			"recipe": [
				"1. In a mixing bowl stir together the garlic, ginger, gochujang, soy sauce, mirin, toasted sesame oil, coconut sugar, and broth (or water).",
				"2. Tear up tempeh into around 16 chunks (each 8oz block of tempeh into 8 pieces) and place them into the marinade, stirring to coat. Let marinate for 10-30 minutes, flipping occasionally, or place in the fridge to marinate up to overnight.",
				"3. When ready to make the wings, either preheat your oven to 425 ºF if baking, or slowly heat about 1\" of oil in a heavy bottomed pot or skillet over medium-low heat to deep fry.",
				"4. Make your dipping stations: add cornstarch to one bowl and bread crumbs to a second bowl. Dip each tempeh wing by removing it from the marinade, tossing it in cornstarch then tapping off excess starch, coating the tempeh in marinade once more, then dipping it in the bread crumbs to coat. Repeat with the remaining pieces.",
				"5. To bake: Place the prepared tempeh wings on a parchment or silicon mat lined baking tray and spray or drizzle with oil. Bake for 10 minutes, then flip and bake an additional 6-10 minutes until golden and cripsy on each side.To fry: test that the oil is hot, it should be 350 ºF if checking with a thermometer, or you can test with a small piece of tempeh: the oil should bubble/boil vigorously around it and the piece of tempeh should float to the surface fairly quickly after being dropped in. When the oil is heated, fry in batches, 1-2 minutes on each side, until the wings are a rich golden brown. Remove from oil and place on a paper towel lined plate.",
				"6. Optional: add the fresh lime juice to the remaining marinade and drizzle over tempeh wings once they have cooked. This will make them less crispy but extra flavorful.",
				"7. Serve the tempeh wings hot, garnished with green onions and wedges of lime and with gochujang mayo for dipping.",
				"8. In a small bowl mix together the mayonnaise and 2 tbsp of the gochujang. Taste and add more gochujang if desired. This can be made in advance."
			],
			"nutrition": {
				"calories": "404kcal",
				"carbs": "37g",
				"protein": "15g",
				"total fat": "23g"
			},
			"comments": [
				"I made these today for dinner and it was delicious!",
				"These look amazing!!!! They seem like just the thing to satisfy my non-veg husband&#8217;s wing cravings. 🙂"
			],
			"image": "https://www.thecuriouschickpea.com/wp-content/uploads/2017/09/vegan-gochujang-wings-3-683x1024.jpg"
		},
		{
			"title": "Vegan Bacon Mac and Cheese",
			"ingredients": [
				"1 lb elbow macaroni pasta",
				"2 tbsp oil, divided",
				"1 yellow onion, diced (~1.5 cups)",
				"1 large yukon gold potato, peeled and cut into 1/2\" dice (~1 cup)",
				"1 large carrot, peeled and cut into medium dice (~1/2 cup)",
				"2 garlic cloves, smashed and peeled",
				"1 cup raw cashews",
				"1/2 tsp salt, more to taste",
				"1 tsp smoked paprika",
				"1/2 tsp turmeric",
				"1/2 tsp white pepper",
				"1 tbsp red miso",
				"3 cups water or vegetable broth",
				"6 tbsp nutritional yeast",
				"12 slices vegan bacon, chopped",
				"minced chives, for garnish"
			],
			"time": "50 minutes",
			"serving": "6-8 servings",
			"recipe": [
				"1. Cook the macaroni according to package directions, draining 1 minute before it's fully cooked. Drain and set aside.",
				"2. Heat 1 tablespoon of oil in a large pot over medium heat. Add the onion and cook for 5-6 minutes to soften.",
				"3. Add the potato, carrots, garlic, cashews and salt and sauté 2-3 minutes, until the cashews and garlic are golden in spots.",
				"4. Stir in the smoked paprika, turmeric, and white pepper, then add the miso and broth (or water). Bring to a boil over high heat, then reduce heat and simmer until potatoes and carrots are tender, around 10-15 minutes.",
				"5. Transfer the mixture to a blender. Add the nutritional yeast and blend until smooth, pausing to scrape down the sides and vent the steam as needed.",
				"6. Heat a large skillet over medium and add the remaining tablespoon of oil. Add the vegan bacon and fry for 2-3 to crisp up. Add the pasta and sauce to the skillet and stir to combine. Fry the pasta for 5 or more minutes, turning just once or twice to crisp up spots. Cook until the pasta and sauce are the desired amount of browned and crispy. Garnish with minced chives and enjoy!"
			],
			"nutrition": {
				"calories": "338kcal",
				"carbs": "39g",
				"protein": "20g",
				"total fat": "12g"
			},
			"comments": [
				"Thank you for this recipe! It tastes so similar to Upton’s bacon mac ! I would suggest using 2 packages of Upton’s bacon though. And I would suggest mixing the mac noodles and sauce in a separate pan, reserve some of the sauce. Cook the bacon til pretty crisp, then remove from the pan. In a nice cast iron pan, heat up a bit of oil, then add a few servings of mac and cheese, a thin layer. Let it toast, turn once, and then add plenty of the bacon right at the end so it’s still crispy. At Upton’s, their mac is more dry, so I that’s why I’ll reserve some of the sauce next time. A bit more dry to get that crisp on it. Maybe some toasted breadcrumbs to finish it? It was absolutely delish. So happy that you were able to capture the strong cheesy flavor in that sauce! Can’t wait to re-crisp the leftovers tomorrow, maybe I’ll grab some more bacon and add that too! Thanks again, very enjoyable, and saved me a trip to the city!"
			],
			"image": "https://www.thecuriouschickpea.com/wp-content/uploads/2017/08/vegan-bacon-mac-and-cheese-1-683x1024.jpg"
		},
		{
			"title": "Vegan Rajas Con Crema",
			"ingredients": [
				"1 1/2 tsp oil",
				"1/2 lb poblano peppers (4-10, depending on size)",
				"3/4 cups raw cashews, soaked for 2 hours in cold water and drained*",
				"1 1/2 cups vegetable broth",
				"1 yellow onion, thinly sliced in half moons",
				"2 cloves garlic, minced",
				"1/2 tsp salt, more to taste",
				"1/2 tsp crushed red pepper flakes, more to taste",
				"1 tsp Mexican oregano (substitute Mediterranean oregano)",
				"1 cup corn (fresh, frozen, or canned)"
			],
			"time": "35 minutes",
			"serving": "8 servings",
			"recipe": [
				"1. Wash poblanos and rub with a little oil, about 1/2 teaspoon. Broil about 4-inches underneath top burner until the peppers are blackened, about 10 minutes but times may vary, flipping a couple of times to char evenly.",
				"2. Place the roasted peppers in a large heat safe bowl and cover to let steam so skins loosen. Set aside until cool enough to handle, then peel the peppers and remove the stem and seeds. Slice the peppers into strips.",
				"3. Prepare the cashew cream. Combine the cashews and vegetable broth in a blender and blend until smooth, pausing to scrape down as necessary. Set aside.",
				"4. Heat a teaspoon of oil in a large skillet over medium and add the onions with a pinch of salt. Sauté about 5 minutes, or until the onions are softened and lightly browned.",
				"5. Add the garlic and sauté about 30-60 seconds before adding the sliced poblanos, salt, red pepper, and oregano. Let cook for 1-2 minutes.",
				"6. Turn the heat down slightly to medium-low and pour in the cashew cream and stir in the corn. Let cook until the cashew cream thickens, about 2-4 minutes. Taste and adjust seasonings."
			],
			"nutrition": {
				"calories": "108kcal",
				"carbs": "11g",
				"protein": "3g",
				"total fat": "7g"
			},
			"comments": [],
			"image": "https://www.thecuriouschickpea.com/wp-content/uploads/2020/09/vegan-rajas-con-crema-9.jpg"
		},
		{
			"title": "Vegan Twice Baked Potatoes with Collard Greens",
			"ingredients": [
				"1 cup raw cashews",
				"3 cups water",
				"8 small russet potatoes (3-4 inches long)",
				"2 tbsp olive oil, divided",
				"2 5oz bags Nature's Greens Organic Collard Greens",
				"1 cup finely diced shallots (~6 cloves)",
				"3-4 cloves garlic, minced",
				"1 tsp paprika",
				"1 tsp salt, or to taste",
				"1/2 tsp black pepper, or to taste",
				"1/2 cup water or vegetable broth, more if needed",
				"1 cup shredded vegan cheddar cheese",
				"minced chives, for garnish"
			],
			"time": "1 hour 40 minutes",
			"serving": "16",
			"recipe": [
				"1. If using a high powered blender combine the cashews and water and blend until smooth. Otherwise, soak your cashews by pouring boiling hot water to cover and let rest for 20-30 minutes to soften. Drain and use fresh water to blend. Set aside until ready to use.",
				"2. Preheat the oven to 400 ºF.",
				"3. Wash the potatoes and prick with a fork 3 times. Drizzle about 1 tablespoon olive oil over the potatoes and sprinkle with salt and pepper. Rub to coat the potatoes and bake for about 1 hour, or until very tender.",
				"4. Remove from the oven and let cool for 15 minutes or until cool enough to handle. Cut in half and scoop out the insides (reserving for the filling), leaving about 1/4-inch of potato behind on the skins.",
				"5. Turn up the oven to 450 ºF.",
				"6. While the potatoes bake, heat a large skillet over medium and add 1 tablespoon of olive oil. Add the shallots and a pinch of salt and cook until softened, about 3 minutes.",
				"7. Add the garlic and let cook for about 60 seconds until fragrant, then add the collard greens, adding in batches and letting wilt to fit. Add a pinch of salt and cook the greens until they are bright green, turning tender, and most of their liquid has cooked off, about 5 minutes.",
				"8. Add the paprika, 1 teaspoon of salt, and 1/2 teaspoon of pepper (or salt and pepper to taste) and the cashew milk. Bring to a simmer and turn the heat down to low. Let simmer until the greens have reached your desired tenderness and the cashew milk has thickened, about 25-30 minutes. If needed, add more water or some vegetable broth, 1/2 cup at a time to thin the cream until the greens are tender.",
				"9. Finely chop the creamed greens using an immersion blender or food processor.",
				"10. Transfer the greens to a mixing bowl and add the reserved insides of the baked potatoes. Use a potato masher or fork to mash until smooth. Taste and adjust salt or pepper if needed. Add the vegan cheddar and mix in.",
				"11. Fill the hollowed out potato skins with the mixture and bake at 450 ºF for 15-20 minutes or until golden and crispy in places. Garnish with chives and enjoy warm!"
			],
			"nutrition": {
				"calories": "353kcal",
				"carbs": "52g",
				"protein": "11g",
				"total fat": "13g"
			},
			"comments": [
				"Yum &#8211; looks delicious! 🙂\nJenna ♥"
			],
			"image": "https://www.thecuriouschickpea.com/wp-content/uploads/2020/09/twice-baked-potatoes-with-collard-greens-10-683x1024.jpg"
		},
		{
			"title": "Vegan Mexican Chocolate Brownies",
			"ingredients": [
				"1 1/2 cups (200g) all purpose flour",
				"1/2 cup (42g) dutch-processed cocoa powder",
				"3/4 tsp baking powder",
				"3/4 tsp salt",
				"1 tsp cinnamon",
				"1/4 tsp cayenne",
				"1/2 cup (118mL) non-dairy milk",
				"1/3 cup (80g) plain unsweetened non-dairy yogurt",
				"1 1/2 cups (300g) sugar",
				"1/4 cup (52g) oil or vegan butter",
				"3oz (87g) 65-75% dark chocolate",
				"2 tsp vanilla extract"
			],
			"time": "40 minutes",
			"serving": "8-inch pan",
			"recipe": [
				"1. Preheat the oven to 350 ºF with a rack placed in the center. Spray an 8 or 9-inch square baking dish with oil and line with parchment paper, leaving two sides with overhang.",
				"2. In a large mixing bowl sift together the flour, dutch-processed cocoa powder, baking powder, salt, cinnamon, and cayenne. Set aside.",
				"3. In a small pot combine the milk, yogurt, oil or vegan butter, and sugar. Heat over low heat, stirring regularly, until the sugar has dissolved (mixture will reach ~120 ºF). Turn off the heat and add the chopped chocolate and vanilla extract. Stir until the chocolate has melted and the mixture is smooth.",
				"4. Pour the wet ingredients into the dry and mix with a wooden spoon until just combined and no dry spots are left.",
				"5. Spread the batter into the prepared baking dish and smooth the top with the back of the spoon.",
				"6. Bake the brownies for 28-32 minutes in an 8-inch pan, or until a tester comes out with some moist crumbs but no wet batter. If using a 9-inch pan brownies will bake in 25-30 minutes",
				"7. Let the brownies cool completely on a wire rack before removing from pan. They are delicious warm, but will be easier to cut if you allow them to cool fully and refrigerate for a few hours. Brownies can be warmed in the microwave in about 15-30 seconds."
			],
			"nutrition": {
				"calories": "347kcal",
				"carbs": "60g",
				"protein": "4g",
				"total fat": "10g"
			},
			"comments": [
				"hi i was wondering if you sift 200g of flour or measure 200g of flour then sift??",
				"Love the mexican brownies.  Best brownies ever&#8230;far better than boxed.  To take to next level of flavor add some blackberries and nuts like walnuts."
			],
			"image": "https://www.thecuriouschickpea.com/wp-content/uploads/2020/09/Mexican-chocolate-brownies-6.jpg"
		},
		{
			"title": "Caramelized Onion White Bean Dip",
			"ingredients": [
				"1 1/2 lbs sweet onion, thinly sliced quarter moons (if large) or half moons (if small)",
				"3 tbsp extra virgin olive oil, divided",
				"28oz can (3 cups cooked) cannellini beans or other white beans, drained and rinsed",
				"1/4 cup fresh squeezed lemon juice",
				"1 tsp onion powder",
				"1/2 tsp garlic powder",
				"1/2 tsp salt, more to taste",
				"2-4 tbsp cold water or aquafaba (liquid from can of beans)",
				"1 tbsp chopped fresh rosemary",
				"1 tbsp chopped fresh sage (substitute 1 tsp dried)"
			],
			"time": "40 minutes",
			"serving": "4 cups",
			"recipe": [
				"1. Warm a large skillet over medium-low. Add 1 tablespoon of oil and the onions along with a pinch of salt. Cook slowly stirring occasionally until the onions are dark golden and caramelized. The process will take 30-35 minutes.",
				"2. In a food processor combine the beans, 2 tablespoons of olive oil, lemon juice, onion powder, garlic powder, and salt. Process until smooth, adding cold water, aquafaba, or more olive oil to thin if needed. Let it process for several minute, pausing to scrape down a few times. Taste and adjust salt and lemon juice if needed.",
				"3. Add in the rosemary, sage, and caramelized onions, setting aside some to garnish if desired, and pulse to chop up and combine.",
				"4. Enjoy immediately or refrigerate to allow flavors to meld. It will keep for about a week."
			],
			"nutrition": {
				"calories": "94kcal",
				"carbs": "14g",
				"protein": "4g",
				"total fat": "3g"
			},
			"comments": [
				"Made this over the weekend and it’s delicious!! My family had it on pita chips and enjoyed the creamy taste and how eating a lot actually made you still feel good! I had to add a bit more salt, I think because I was using an herbed type. As I’m writing this, I’m eating leftovers on some basmati rice with falafel. I’m going to add it to some everything but the bagel seasoned rice cakes that I have, too. Really recommend!!",
				"@Jade, a yummy steak would be awesome with this! And some fresh salad…mmmm 😁",
				"Hello, this looks lovely. What would you serve this with?",
				"Do you drain the beans if using canned?"
			],
			"image": "https://www.thecuriouschickpea.com/wp-content/uploads/2020/08/caramelized-onion-white-bean-dip-4.jpg"
		},
		{
			"title": "Homemade Flatbread",
			"ingredients": [
				"2 1/2 cups (325g) all purpose flour",
				"1 tsp baking powder",
				"3/4 tsp salt",
				"3 tbsp (42g) vegan butter*",
				"3/4 cups (176mL) water, room temperature"
			],
			"time": "55 minutes",
			"serving": "8 six-inch flatbread",
			"recipe": [
				"1. In a large mixing bowl or bowl of a stand mixer combine the flour, baking powder and salt and whisk to combine.",
				"2. Add the vegan butter or oil and rub it into the flour with your fingers until the dry mixture is crumbly.",
				"3. Add water and mix with wooden spoon until shaggy.",
				"4. Knead the dough by hand for 5 minutes on a lightly floured countertop, or use a stand mixer with the dough hook attachment on low for 3-4 minutes, until the dough is smooth and supple. If kneading with a stand mixer, knead the dough few times by hand when done to check if any adjustments of flour or water are necessary.",
				"5. Drizzle some oil in the mixing bowl and roll the dough ball in the oil to coat. Cover the bowl with a damp towel, lid, or plastic wrap and set aside for 30 minutes to rest at room temperature. Or you can place the dough in a sealed container in the fridge for up to 1 day.",
				"6. Divide the dough into 8 pieces of dough, about 2.5oz each. You can make larger or smaller flatbreads by making dividing the dough into more or fewer dough balls as needed (see post for details).",
				"7. Keep the dough covered, and removing one at a time, dip it in flour to coat, then  place on a wooden board or clean counter. Press flat with your hand into a disk, then roll out with a rolling pin to about 6 inches in diameter.",
				"8. Preheat a skillet over medium heat (do not add oil!) and cook the flatbreads for about 1 minute per side. Adjust heat as needed so they don't cook too quickly or slowly.",
				"9. Place cooked flatbread in an airtight container such as a tortilla warmer or a ziplock bag along with a paper towel or tea towel and seal to let the flatbreads steam. Let steam while cooking the remaining flatbreads, or at least 3 minutes. This step makes the bread extra soft."
			],
			"nutrition": {
				"calories": "181kcal",
				"carbs": "30g",
				"protein": "4g",
				"total fat": "5g"
			},
			"comments": [
				"Could you use gluten free flour?",
				"I&#8217;m not clear on how to steam the cooked pieces. After putting them in a bag or casserole, what do I do to steam them. Much thanks."
			],
			"image": "https://www.thecuriouschickpea.com/wp-content/uploads/2020/08/flatbread-3.jpg"
		},
		{
			"title": "Vegan German Chocolate Cupcakes",
			"ingredients": [
				{
					"Chocolate Cupcakes": [
						"1 1/4 cup (148g) all purpose flour",
						"1/2 cup (100g) granulated sugar",
						"1/3 cup (30g) dutch-processed cocoa powder",
						"1 tsp (4g) baking powder",
						"1/2 tsp (2g) baking soda",
						"1/2 tsp (2g) sea salt",
						"1 cup (235mL) plant milk",
						"1/4 cup (48g) neutral flavored oil",
						"2 tbsp (36g) maple syrup",
						"1 tsp (5mL) apple cider vinegar",
						"1 1/2 tsp (5mL) vanilla extract",
						"1/2 tsp (2.5mL) chocolate extract, optional"
					]
				},
				{
					"Coconut Pecan Frosting": [
						"3/4 cup (175mL) canned full-fat coconut milk",
						"2 tbsp (17g) cornstarch",
						"1/3 cup (75g) vegan butter",
						"1/2 cup (80g) brown sugar",
						"1/4 cup (48g) white sugar",
						"1 tsp (5mL) vanilla extract",
						"1 cup (112g) chopped pecans",
						"1 cup (72g) shredded unsweetened coconut"
					]
				},
				{
					"Chocolate Drizzle": [
						"2 oz (57g) dark chocolate",
						"1/4 cup (60mL) canned coconut milk",
						"pinch of salt"
					]
				}
			],
			"time": "40 minutes",
			"serving": "12 cupcakes",
			"recipe": [
				"1. Preheat the oven to 350 ºF with a rack positioned in the center and line a muffin tin with 12 cupcake liners.",
				"2. In a large mixing bowl add the flour, sugar, cocoa powder, baking powder, baking soda, and sea salt. Use a whisk to combine and fluff the dry ingredients.",
				"3. In a second mixing bowl add the plant milk, oil, maple syrup, apple cider vinegar, vanilla extract, and chocolate extract (if using). Whisk to combine.",
				"4. Add the wet ingredients to the dry and using a whisk combine until smooth and lump free. Divide the batter into the cupcake liners, filling each one about 3/4 of the way full. Tap the pan on the counter once full 2-3 times to release some air bubbles.",
				"5. Place the muffin tin in the center of the oven and bake for 18-20 minutes. When done, a tester will come out clean or with a couple of crumbs.",
				"6. Remove from oven and let cool for 5 minutes, then remove cupcakes from tin and let cool fully on a wire rack. Once cooled to room temperature you can frost them or refrigerate the cupcakes in sealed container until ready to frost.",
				"7. Measure out coconut milk, then pour a couple tablespoons into a small bowl. Add the cornstarch and whisk together to make a slurry. In a small pot add the coconut milk, cornstarch slurry, vegan butter, brown sugar, and granulated sugar together.",
				"8. Bring to a simmer over medium-low heat. Cook on a low simmer for 5-10 minutes until it’s thick and syrupy, whisking frequently. When done, a spatula should be able to run through the caramel and reveal the pot underneath momentarily before filling back in.",
				"9. Turn off heat and mix in the vanilla, pecans, and coconut. Let cool to room temp before frosting.",
				"10. Chop the chocolate and place in a heat proof bowl. Warm the coconut milk until just before a simmer, then pour over the chocolate. Whisk together until smooth, then add a pinch of salt (optional).",
				"11. Place in the fridge for 10-15 minutes or until its cooled and thickened enough to drizzle over the cupcakes.",
				"12. Frost chilled or room temperature cupcakes with the coconut pecan frosting. It's easiest to do this when the frosting is at room temperature or slightly warmer as it thickens when cold.",
				"13. Add the chocolate drizzle and serve! Cupcakes can be stored at room temperature for a day or two, or place in sealed container in fridge for a week. Enjoy cupcakes at room temperature."
			],
			"nutrition": {
				"calories": "287kcal",
				"carbs": "33g",
				"protein": "4g",
				"total fat": "16g"
			},
			"comments": [
				"Hello! Do you use unsalted or salted pecans? And roasted or raw pecans? Thanks I want to try this recipe this weekend."
			],
			"image": "https://www.thecuriouschickpea.com/wp-content/uploads/2020/08/german-chocolate-cupcakes-11.jpg"
		},
		{
			"title": "Afghan Aushak",
			"ingredients": [
				{
					"Aushak": [
						"2 tsp oil",
						"3 medium leeks",
						"1 bunch scallions, thinly sliced",
						"1 cloves garlic, minced",
						"3/4 tsp salt",
						"1 tsp black pepper",
						"1/4 cup cilantro, tender stems and leaves chopped (optional)",
						"1 12oz package wonton wrappers (~48)"
					]
				},
				{
					"Tomato Sauce": [
						"2 tsp oil",
						"1 yellow onion, finely diced",
						"2-4 garlic cloves, minced",
						"14oz vegan ground meat (substitute 2 cups cooked chana dal)",
						"1 1/2 tsp paprika",
						"1 tsp ground coriander",
						"1/4 tsp ground cardamom",
						"1/2 tsp salt",
						"1 tsp pepper",
						"15 oz can crushed tomatoes",
						"1/4-1/2 cup water to thin, as needed"
					]
				},
				{
					"Yogurt Sauce": [
						"1 cup plain unsweetened vegan yogurt",
						"1 clove garlic, minced",
						"1/4-1/2 tsp salt",
						"1/2 tsp dried mint"
					]
				}
			],
			"time": "1 hour 15 minutes",
			"serving": "8 servings",
			"recipe": [
				"1. Trim the ends and dark green leaves off the leeks and slice the white and light green stems in half lengthwise. Thoroughly wash the leeks, getting between the layers to clean out the dirt. Then, thinly slice the washed leeks into half moons.",
				"2. Heat a large skillet over medium, and add the oil, leeks, scallions, garlic, salt, and pepper. Sauté until the leeks are tender, about 6-10 minutes. Turn off the heat and stir in the cilantro if using. Remove from skillet and set aside.",
				"3. In a large pot or the same skillet, heat the two teaspoons of oil over medium heat. Add the onion and a pinch of salt and sauté until the onion is translucent, ~4-5 minutes.",
				"4. Add the garlic and stir in, then add the vegan mince (or cooked chana dal). Sauté about 2 minutes until lightly browned (skip if using chana dal). Stir in the paprika, coriander, cardamom, salt, and pepper.",
				"5. Add the canned tomatoes and cook about 5 minutes to meld flavors. Add water if needed to thin or deglaze pan. Taste and adjust seasonings if needed. Cover to keep warm and set aside.",
				"6. Mix together all ingredients starting with 1/4 teaspoon of salt. Taste and adjust salt as needed. Keep refrigerated until ready to use.",
				"7. Set out a few dumpling wrappers at a time, and add a small amount of filling to the middle of the wrappers (about 2 tsp). Keep extra dumpling wrappers covered with a damp towel so they do not dry out.",
				"8. Taking one filled wrapper at a time (either in your palm or on the counter, whichever is easier for you), dab two edges of the wrapper with water, then fold in half and seal, squeezing out air as you do so. Set aside and repeat until all dumplings are formed.",
				"9. Bring a large pot of salted water to a boil. Cook the dumplings in batches, 4-5 minutes each batch (how many depends on size of pot and how much water is boiling). Remove dumplings with a slotted spoon and serve immediately.",
				"10. Spread some of the yogurt sauce on a plate. Top with cooked dumplings, then spoon the tomato sauce overtop. Crumble extra dried mint on top for garnish. Serve with additional yogurt sauce on the side or drizzled on top.",
				"11. You can freeze the dumplings to cook in the future. Lie them flat on a baking tray and place in freezer for 2 hours or until frozen solid. Then transfer them to a freezer safe bag or storage container and freeze for up to several months.",
				"12. To cook from frozen: add 1-2 minutes to the cooking time. The dumplings will float, then let them cook an additional minute before removing."
			],
			"nutrition": {
				"calories": "270kcal",
				"carbs": "40g",
				"protein": "20g",
				"total fat": "4g"
			},
			"comments": [
				"I ate it last night very delicious it&#8217;s my favorite food 😋",
				"Can&#8217;t wait to make this for Thanksgiving next week. It will be a surprise for my four boys from Afghanistan",
				"anxious to try this!  I lived in Washington DC 40 years ago and one of our favorite places to eat was the Afghan restaurant in Georgetown.  I always ordered the aushak.  Thanks for bringing back a  happy memory."
			],
			"image": "https://www.thecuriouschickpea.com/wp-content/uploads/2020/08/afghan-aushak-7.jpg"
		},
		{
			"title": "Vegan Peach Pancakes",
			"ingredients": [
				"1 1/3 cups (205g) all purpose flour",
				"2 tbsp (26g) sugar",
				"2 tbsp (21g) cornstarch",
				"1 tbsp (11g) baking powder",
				"1/2 tsp (3g) salt",
				"1/2 tsp ground cinnamon (optional)",
				"1 1/3 cups (308g) plant milk",
				"2 tbsp (32g) melted vegan butter or canola oil",
				"1 tsp (5g) vanilla extract",
				"2 peaches, cut into thin slices",
				"vegan butter or spray oil to cook",
				"maple syrup, to serve"
			],
			"time": "35 minutes",
			"serving": "5-6 pancakes",
			"recipe": [
				"1. Mix the flour, sugar, cornstarch, baking powder, salt, and cinnamon (if using) together in a mixing bowl. Pour in the plant milk, melted vegan butter (or oil), and vanilla extract and mix until combined. Some lumps are ok, don't over mix! Let the batter rest for 10 minutes for the gluten to relax.",
				"2. Heat a griddle or fry pan over medium low heat. When warm, melt a thin layer of vegan butter over the pan or griddle, or spray with a thin layer of oil.",
				"3. Pour a generous 1/3 cup of batter for each pancake into the pan and arrange peach slices on top of pancake batter.",
				"4. Let cook until the batter has risen a bit, looks drier (partially cooked) around the edges and the bottom side is golden. Slide a thin spatula under the pancake and flip. Cook the second side until it is golden and the batter in the middle cooks through. It should take 2-3 minutes for them to cook on each side. If they cook too quickly, the inside will not cook all the way through, so lower the heat.",
				"5. Repeat with remaining pancakes, lightly buttering or oiling the pan or griddle between pancakes.",
				"6. Serve warm with maple syrup and some vegan whipped cream (optional)."
			],
			"nutrition": {
				"calories": "250kcal",
				"carbs": "31g",
				"protein": "5g",
				"total fat": "12g"
			},
			"comments": [
				"I would have expected you to use chickpea flour and ghee in the peach pancakes!\nI am also trying to find the recipe for curried roasted vegetables  &#8211;  I liked the look of the roasted cauliflower."
			],
			"image": "https://www.thecuriouschickpea.com/wp-content/uploads/2020/07/peach-pancakes-1.jpg"
		},
		{
			"title": "Tomato Sweet Corn Salad",
			"ingredients": [
				"1/2 red onion, thinly sliced into half moons",
				"3 large heirloom tomatoes, cut into 1/2-inch slices",
				"1-2 ears of corn, kernels cut off the cob",
				"1/4 cup basil, chopped",
				"1-2 tbsp extra virgin olive oil",
				"1-2 tbsp red wine vinegar",
				"salt and pepper to taste",
				"vegan feta for garnish (optional)"
			],
			"time": "40 minutes",
			"serving": "6 servings",
			"recipe": [
				"1. Place cut red onion in a bowl of ice water and let sit for 10 or more minutes before draining.",
				"2. Combine the tomatoes, corn, basil, and red onion in a mixing bowl. Drizzle on extra virgin olive oil and red wine vinegar, and sprinkle over salt (I use about 1/2 teaspoon) and black pepper to taste. Add more olive oil or vinegar if needed.",
				"3. Let sit for about 30 minutes at room temperature before serving. Top with vegan feta and enjoy with a side of bread!"
			],
			"nutrition": {
				"calories": "86kcal",
				"carbs": "10g",
				"protein": "2g",
				"total fat": "5g"
			},
			"comments": [
				"This was GORGEOUS.!! Easy to make and easy to please!! The tip of soaking the onions in ice water really worked wonders! Thank you!!"
			],
			"image": "https://www.thecuriouschickpea.com/wp-content/uploads/2020/07/tomato-corn-salad-5.jpg"
		},
		{
			"title": "Chickpea and Spinach Curry",
			"ingredients": [
				"1 tbsp oil",
				"1 large yellow onion, diced",
				"4 cloves garlic, minced",
				"2 tsp minced ginger",
				"1-2 green chiles (e.g. serrano or jalapeño), diced, remove seeds for less heat",
				"2 tsp curry powder",
				"1 tsp ground coriander powder",
				"1/8 tsp cayenne pepper, more to taste",
				"1 tsp salt, or to taste",
				"2 tomatoes, diced",
				"29 oz can chickpeas (3 cups cooked), drained and rinsed",
				"5 oz baby spinach",
				"1 cup Pacific Foods Cashew Unsweetened Original Plant Based Beverage",
				"1 cup Pacific Foods Vegetable Broth",
				"2-4 tbsp fresh lemon juice (from 1/2-1 lemon), to taste"
			],
			"time": "38 minutes",
			"serving": "6 servings",
			"recipe": [
				"1. Heat the oil in a large pot over medium heat. Add the onion and a pinch of salt and sauté until soft and translucent, about 5 minutes.",
				"2. Add the garlic, ginger, and green chilies and cook in for 1 minute, then addd the curry powder, ground coriander, cayenne pepper, and 1 teaspoon of salt. Let cook for 30 seconds.",
				"3. Add the diced tomatoes, chickpeas, cashew beverage, and vegetable broth and bring to a low boil. Turn the heat to low and simmer uncovered for about 10 minutes, or until the tomatoes are softened and breaking down.",
				"4. Add the spinach in batches, letting it wilt to fit before adding more. Once all spinach is added let simmer for 5-10 minutes or until spinach is very tender and flavors have melded.",
				"5. Turn off heat and add in lemon juice. Taste and adjust salt or lemon juice as desired. Serve garnished with minced chili peppers, cilantro, lemon wedges on the side for extra citrus, and basmati rice."
			],
			"nutrition": {
				"calories": "199kcal",
				"carbs": "31g",
				"protein": "9g",
				"total fat": "5g"
			},
			"comments": [
				"Or canned*",
				"Can I substitute can or baby tomatoes for the whole ones? If so how many or what ounces?",
				"I made this and it is so easy and delicious!  Thanks for sharing."
			],
			"image": "https://www.thecuriouschickpea.com/wp-content/uploads/2020/07/chickpea-and-spinach-curry-7.jpg"
		},
		{
			"title": "Vegan Peach Cupcakes",
			"ingredients": [
				{
					"Peach Cupcakes": [
						"3/4 cup (180g) soy milk or almond milk",
						"2 tsp (10g) apple cider vinegar",
						"1 1/2 cup (200g) all purpose flour",
						"3/4 cup (140g) granulated sugar",
						"1 1/2 tsp baking powder",
						"1/2 tsp baking soda",
						"1/2 tsp salt",
						"1/8 tsp ground nutmeg",
						"2 tbsp canola oil (or other neutral flavored oil)",
						"2 tsp vanilla extract",
						"1/2 cup (96g) finely diced peaches"
					]
				},
				{
					"Peach Buttercream": [
						"1/2 cup (113g) vegan butter, in a stick form, softened",
						"1/2 cup (96g) vegetable shortening",
						"4 cups (380g) sifted powdered sugar",
						"1/4 cup (55g) peach purée"
					]
				}
			],
			"time": "47 minutes",
			"serving": "12 cupcakes",
			"recipe": [
				"1. Preheat the oven to 350ºF with a rack placed in the center. Line a muffin tin with cupcake liners and set aside.",
				"2. Measure out the plant milk, then add the apple cider vinegar (no need to stir) and let sit for 5-10 minutes to make a vegan buttermilk.",
				"3. In a mixing bowl whisk together the flour, sugar, baking powder, baking soda, salt, and nutmeg until combined and fluffy. To measure your flour by volume: whisk it in the container, then scoop and level.",
				"4. Pour in the vegan buttermilk, then add the oil and vanilla extract and whisk together until smooth. Fold in the diced peaches.",
				"5. Fill the cupcake liners about 2/3 to 3/4 of the way full and place in the preheated oven. Bake at 350 ºF for 20-22 minutes, or until a tester comes out clean (a couple of moist crumbs are ok). Let cool for 5 minutes in the pan, then remove and cool completely on a cooling rack. Chill cooled cupcakes in a sealed container in the fridge until you are ready to frost.",
				"6. Add the vegan butter and vegetable shortening to the bowl of a stand mixer or a large mixing bowl. Using handheld beaters or your stand mixer with a balloon attachment beat them together until fluffy.",
				"7. Add the powdered sugar in half cup increments, beating it to incorporate each time before adding more. Scrape down the sides as needed. Once all of the powdered sugar has been mixed in, add the peach purée. Turn the mixer to high and whisk together until light and fluffy, about 5 minutes.",
				"8. Pipe or spread frosting onto cupcakes to decorate. Top with a slice of fresh peach, or some diced peaches."
			],
			"nutrition": {
				"calories": "291kcal",
				"carbs": "55g",
				"protein": "2g",
				"total fat": "7g"
			},
			"comments": [
				"Would this work with mango instead?"
			],
			"image": "https://www.thecuriouschickpea.com/wp-content/uploads/2020/07/vegan-peach-cupcakes-4.jpg"
		},
		{
			"title": "Black Bean Burrito Bowls",
			"ingredients": [
				{
					"Ancho Roasted Potatoes": [
						"1 1/2 lbs potato",
						"1 tbsp oil",
						"1 1/2 tsp ancho chili powder",
						"1/2 tsp salt"
					]
				},
				{
					"Zucchini": [
						"2-4 zucchini, cut into half moons",
						"2 tsp oil",
						"salt and pepper to taste"
					]
				},
				{
					"Everything Else": [
						"Seasoned Black Beans (recipe below)",
						"6 cups cooked rice",
						"avocado, cut into cubes",
						"cilantro, for garnish",
						"minced jalapeño, for garnish (optional)",
						"hot sauce or salsa, to serve",
						"lime wedges, to serve"
					]
				}
			],
			"time": "35 minutes",
			"serving": "8 servings",
			"recipe": [
				"1. Cut potatoes in 1/2-inch dice (peeling optional). Toss the cut potatoes in the tablespoon of oil, ancho chili powder, and 1/2 teaspoon of salt. Bake at 425 ºF for 25 minutes, stirring halfway through, or until potatoes are tender and golden.",
				"2. Heat up a large skillet over medium heat. Add 2 teaspoons of oil then the zucchini and a sprinkle of salt. Pan fry until golden, about 5 minutes. Season with salt and pepper to taste.",
				"3. Assemble your bowls: add cooked rice to the bottom, then top with black beans, roasted potato, zucchini, and avocado. Sprinkle on minced cilantro and jalapeño for garnish, then drizzle with hot sauce or spoon on salsa. Squeeze lime juice on to taste."
			],
			"nutrition": {
				"calories": "596kcal",
				"carbs": "97g",
				"protein": "21g",
				"total fat": "16g"
			},
			"comments": [],
			"image": "https://www.thecuriouschickpea.com/wp-content/uploads/2020/07/black-bean-burrito-bowls-5.jpg"
		},
		{
			"title": "Seasoned Black Beans",
			"ingredients": [
				{
					"Black Beans": [
						"1 lb (2 1/2 cups) dried black beans",
						"5 cups water",
						"1 tsp salt"
					]
				},
				{
					"Seasoning": [
						"4 tbsp oil, divided",
						"1 red onion, chopped",
						"2 jalapeños (more or less to taste, remove seeds for less heat), chopped",
						"4 cloves garlic, minced",
						"1 tsp whole cumin seed",
						"1/2 tsp red pepper (more or less to taste)",
						"1 tbsp dried Mexican (substitute Mediterranean) Oregano",
						"1 bunch cilantro, leaves and tender part of stems, coarsely chopped",
						"1/4 cup fresh lime juice (~2 limes)",
						"1/2 tsp salt, more to taste",
						"1/2 tsp garlic powder"
					]
				}
			],
			"time": "1 hour 25 minutes",
			"serving": "6 cups",
			"recipe": [
				"1. Sort any debris from dried beans, then rinse them thoroughly. Place beans in pressure cooker and add the 5 cups of water and teaspoon of salt. Bring to high pressure and cook for 25 minutes, then let naturally release for 20 minutes before releasing any final pressure.",
				"2. Heat a skillet over medium heat and add 1 tablespoon of oil, the onion, and a pinch of salt. Sauté until the onion is softened and golden in spots, about 5 minutes.",
				"3. Add the jalapeño and garlic and sauté 1-2 minutes, until they are a shade darker.",
				"4. Push the vegetables over to one side of the pan, then add a tablespoon of oil in the empty space. Add the whole cumin, oregano, and crushed red pepper to the oil and let sizzle for 30 seconds, then add the salt and garlic powder and stir the spices into the onion mixture and turn off heat.",
				"5. Transfer the onion mixture to a blender and add the cilantro, lime juice, and final 2 tablespoons of oil. Blend until fairly smooth.",
				"6. Add the blended seasoning to the beans and bring to a low simmer, if using an Instant Pot cook on the sauté mode on less or normal to achieve this, if using a pot keep it on medium-low or low heat. Let simmer for 10-15 minutes, stirring regularly, or until the beans reach the desired consistency. If you want a more refried bean texture you can mash the beans partially or use an immersion blender.",
				"7. Taste and add salt as needed. Beans will thicken as they cool. Keep stored in the fridge for 1 week, or freeze for longer storage."
			],
			"nutrition": {
				"calories": "180kcal",
				"carbs": "26g",
				"protein": "9g",
				"total fat": "5g"
			},
			"comments": [
				"I made this recipe with canned beans and a half of a chili pepper rather than a jalapeno (they&#8217;re difficult to find where I live).  I used a potato masher rather than an immersion blender to mash them up a bit &#8230; leaving some pieces inside.  Oh my goodness!  These are so very good!  I&#8217;ll be eating them for 2 or 3 dinners this week.  Can&#8217;t wait to try them in a fresh, corn tortilla.  Thank you for a wonderful recipe!",
				"I make mine this way and it is the best! I add bay leaves and acv in the IP with the beans as it cooks:) better than chipotle black beans, as my family says?",
				"Have you tried another green like parsley?"
			],
			"image": "https://www.thecuriouschickpea.com/wp-content/uploads/2020/07/seasoned-black-beans-14.jpg"
		},
		{
			"title": "Vegan Sun Dried Tomato Cream Pasta",
			"ingredients": [
				"8oz pasta",
				"2 tbsp vegan butter",
				"1 cup finely diced yellow onion (1 small onion)",
				"2-4 cloves garlic, minced",
				"1/4 tsp crushed red pepper, more to taste",
				"2 tbsp flour (all purpose or gluten free)",
				"1/2 tsp paprika",
				"1/2 tsp dried oregano",
				"1/3 cup oil packed sun-dried tomatoes, chopped",
				"2 cups Pacific Foods Organic Unsweetened Hemp Plant-Based Beverage",
				"2 tbsp nutritional yeast or vegan parmesan",
				"2 tbsp fresh basil, to serve",
				"salt and pepper to taste"
			],
			"time": "20 minutes",
			"serving": "4 servings",
			"recipe": [
				"1. Cook pasta according to package directions, cooking 1 minute shy of perfectly done.",
				"2. Melt the vegan butter in a large pan over medium heat and add the onion. Cook for 4-5 minutes or until the onion has softened.",
				"3. Add the garlic and crushed red pepper and cook for 30-60 seconds until a shade darker.",
				"4. Stir in the flour, paprika, oregano, and 1/2 teaspoon of salt (or to taste) and let cook until the flour smells slightly toasted, about 1 minute.",
				"5. Stream in the Unsweetened Hemp Beverage while stirring, then mix in the sun dried tomatoes and nutritional yeast (or vegan parmesan).",
				"6. Bring the sauce to a simmer, then turn the heat down to low and let simmer until thickened, about 3 minutes.",
				"7. Add the pasta and let cook for the final minute. Salt and pepper to taste. Top with basil and add vegan parmesan to serve (optional)."
			],
			"nutrition": {
				"calories": "262kcal",
				"carbs": "32g",
				"protein": "10g",
				"total fat": "12g"
			},
			"comments": [
				"This was delicious! I used chickpea pasta and soy milk. I will definitely make it again."
			],
			"image": "https://www.thecuriouschickpea.com/wp-content/uploads/2020/06/sun-dried-tomato-cream-pasta-3.jpg"
		},
		{
			"title": "Vegan Pesto Cream Gnocchi",
			"ingredients": [
				"1 cup raw cashews",
				"1 cup water",
				"1/2 to 3/4 cup pesto",
				"1 to 1 1/4 lbs cooked gnocchi",
				"salt + pepper, to taste"
			],
			"time": "20 minutes",
			"serving": "4 servings",
			"recipe": [
				"1. If not using a high powered blender, soak your cashews in boiling hot water for 30 minutes, then drain and use in recipe.",
				"2. Add the cashews and 1 cup of water to a blender and blend until smooth, pausing to scrape down as needed.",
				"3. Add the cashew cream to a pan over medium low heat and swirl in 1/2 cup of pesto. Add the cooked gnocchi and let cook until everything is heated through. Thin with water as needed. Add more pesto if desired, and salt and pepper to taste."
			],
			"nutrition": {
				"calories": "616kcal",
				"carbs": "47g",
				"protein": "16g",
				"total fat": "38g"
			},
			"comments": [
				"Wow! I have made many of your recipes and this is one of my favorites! For vegans and non &#8211; it’s easy, delicious and perfect on a cold winter day! Thank you for making it so easy for me to transition to a vegan lifestyle!",
				"Great recipe thanks for share.This recipe is so easy I almost loathe to call it a recipe, but hey, we all need more easy dishes in our repertoire.David Brown famous for delicious smoker recipes, expert cooking methods, cooking tips, and tricks as well as for his cooking recipes."
			],
			"image": "https://www.thecuriouschickpea.com/wp-content/uploads/2020/06/pesto-cream-gnocchi-7.jpg"
		},
		null,
		{
			"title": "Vegan Shakshuka",
			"ingredients": [
				"1 tsp extra virgin olive oil",
				"1 yellow onion, diced",
				"3-4 cloves garlic, minced",
				"1 red bell pepper, diced",
				"1/2 tsp ground coriander",
				"1/2 tsp ground cumin",
				"1/2 tsp paprika",
				"pinch of ground nutmeg",
				"1 tomato, chopped (~1 cup chopped)",
				"2 cups Pacific Foods Organic Creamy Tomato Basil Soup",
				"salt and pepper to taste",
				"cilantro or parsley for garnish",
				"vegan ricotta (recipe below, or store bought)"
			],
			"time": "27 minutes",
			"serving": "4 servings",
			"recipe": [
				"1. Heat a skillet over medium and add the olive oil and onion. Sauté until the onions are translucent and lightly browned, about 6 minutes.",
				"2. Add the bell pepper and garlic to the onion and cook for 4-5 minutes to soften. Stir in the ground coriander, cumin, paprika, and nutmeg and stir in.",
				"3. Add the chopped tomato and creamy tomato soup and let come to a simmer. Simmer until reduced and thickened slightly and the tomato has broken down, about 5-10 minutes. Add salt and pepper to taste (I used 1/2 tsp salt).",
				"4. Dollop on the vegan ricotta and garnish with herbs. Serve with toast or pita on the side!"
			],
			"nutrition": {
				"calories": "51kcal",
				"carbs": "1g",
				"protein": "2g",
				"total fat": "4g"
			},
			"comments": [
				"Hi\nAs to the origin of shakshouka شكشوكه it is north african countries of Libya and Tunisia. The word shakshouka is Tunisian arabic for &#8220;mixture&#8221;. It traditionaly served in a cast iron skillet or a tajine as in morocco. It is the quintessential meal of Arabic cuisine. Thank you",
				"These look absolutely delicious!"
			],
			"image": "https://www.thecuriouschickpea.com/wp-content/uploads/2020/06/vegan-shakshuka-6.jpg"
		},
		{
			"title": "Vegan Buffalo Pizza",
			"ingredients": [
				{
					"Buffalo Soy Curls": [
						"2 cups (100g) soy curls",
						"boiling hot water",
						"6 tbsp (90g) Franks RedHot hot sauce, or a similar hot sauce",
						"3 tbsp (35g) vegan butter, melted",
						"1/8 tsp granulated garlic",
						"1/8 tsp salt",
						"2 tsp canola oil"
					]
				},
				{
					"For the Pizza": [
						"3 10oz balls of pizza dough, homemade or store bought",
						"Vegan Ranch Dressing (recipe below, or use store bought)",
						"Extra virgin olive oil",
						"2-3 cloves garlic, minced or pressed",
						"7oz vegan mozzarella",
						"2-3 scallions, sliced with the white and green parts divided",
						"Additional hot sauce"
					]
				}
			],
			"time": "45 minutes",
			"serving": "3 12\" pizzas",
			"recipe": [
				"1. Place the soy curls in a heat safe bowl, then pour in enough hot water to cover. Let sit at least 15 minutes, or until cool enough to touch, then drain them, squeezing out extra water by hand.",
				"2. In a small mixing bowl whisk together the melted vegan butter, the hot sauce, granulated garlic, and salt to make the buffalo sauce. Set aside.",
				"3. Heat a large skillet over medium heat. Add the two teaspoons of oil and drained soy curls. Sauté until the soy curls are lightly browned, about 5-7 minutes. Pour in the buffalo sauce and cook an additional 2-3 minutes until the sauce is absorbed. Remove from the heat and set aside until ready to make the pizza.",
				"4. One hour before you're ready to bake, preheat your oven to 550 ºF, or as hot as it will go. Place a rack 1/3 way down from the top of the oven, and place a baking steel or baking stone on that rack if using. You want the oven to saturate with heat for 1 hour before baking pizza for best results.",
				"5. When the oven is nice and hot, prepare your pizzas. Stretch the dough into a 12-inch round and place in a lightly oiled large cast iron skillet. Drizzle a little olive oil over the dough and spread it with your fingers to coat the dough. Top with the minced garlic, then add the vegan mozzarella followed by about 1/3 of the soy curls. Lastly add the sliced white and light green parts of the scallions. Place the entire cast iron skillet on rack, and bake for 8-15 minutes, or until the crust has darkened and turned dark brown or black in spots.",
				"6. Alternatively you can bake the dough straight on a pizza stone or baking steel, just place the dough on a prepared pizza peel, then top the pizza and slide into the oven on the stone or steel and bake for 7-10 minutes.",
				"7. When the pizza is cooked, remove from oven and drizzle some of the chilled ranch over top and extra hot sauce if desired. Then finish with some of the green parts of the scallions. Slice and enjoy while hot!"
			],
			"nutrition": {
				"calories": "714kcal",
				"carbs": "78g",
				"protein": "33g",
				"total fat": "31g"
			},
			"comments": [
				"This pizza was amazing!!! I used store bought crust &amp; made ranch out of vegan mayo.  I give this pizza a 12 out of 10!!"
			],
			"image": "https://www.thecuriouschickpea.com/wp-content/uploads/2017/12/vegan-buffalo-pizza-11.jpg"
		},
		{
			"title": "Cashew Ranch Dressing",
			"ingredients": [
				"1 cup (125g) raw cashews",
				"3/4 cups (175g) water",
				"1 tbsp (15g) apple cider vinegar",
				"3/4 tsp onion powder",
				"1/2 tsp granulated garlic",
				"1/2 tsp dried dill",
				"1/2 tsp salt",
				"1/8 tsp white pepper",
				"2 tbsp minced fresh chives"
			],
			"time": "40 minutes",
			"serving": "1 cup",
			"recipe": [
				"1. If not using a high speed blender, soak your cashews in boiling hot water for 30 minutes or in cold water for 2 hours. Drain, then use the cashews. If using a high speed blender you can skip soaking!",
				"2. Add the cashews, water, and apple cider vinegar to a blender and and blend until smooth and creamy. Pause to scrape down as needed.",
				"3. Add the onion powder, granulated garlic, dried dill, and salt, and white pepper and blend the spices in.",
				"4. Stir in the chives with a spoon (do not blend). Transfer the dressing to a sealed container and chill for at least 1 hour before using. It will thicken as it chills. Enjoy within 1-2 weeks."
			],
			"nutrition": {
				"calories": "101kcal",
				"carbs": "6g",
				"protein": "3g",
				"total fat": "8g"
			},
			"comments": [
				"I’ve made this twice now, my boyfriend and I can’t get over how delicious it is! We will likely never buy a bottled vegan ranch again!",
				"Oh my goodness, we made your Vegan Malai Kofta last night! WOW, it was absolutely delicious! Your site is an inspiration and we can&#8217;t wait to try more of your recipes. Thank you SO much!!!"
			],
			"image": "https://www.thecuriouschickpea.com/wp-content/uploads/2020/05/cashew-ranch-5.jpg"
		},
		{
			"title": "Easy Vegan Ricotta",
			"ingredients": [
				"1 14-16oz package firm or extra firm tofu",
				"1/2 cup raw cashews",
				"2 cloves garlic, peeled and coarsely chopped",
				"1/4 cup extra virgin olive oil",
				"1/4 cup lemon juice",
				"1 tsp salt"
			],
			"time": "10 minutes",
			"serving": "2 1/2 cups",
			"recipe": [
				"1. Combine all ingredients in a food processor or blender and process until fairly smooth, some grainy texture is ok. Pause to scrape down as needed.",
				"2. Transfer to a sealed container and store in the fridge until ready to use. It lasts about 7-10 days. It can be frozen, but the texture may change slightly."
			],
			"nutrition": {
				"calories": "51kcal",
				"carbs": "1g",
				"protein": "2g",
				"total fat": "4g"
			},
			"comments": [
				"I made this over the weekend and wanted to cry. It was so good! I haven&#8217;t had ricotta in so long and to be able to make this so quickly and have it taste and function like real ricotta was a dream come true. I ended up making ravioli and using it for the stuffing and it was delicious. Thank you so much!"
			],
			"image": "https://www.thecuriouschickpea.com/wp-content/uploads/2020/06/vegan-ricotta-5.jpg"
		},
		{
			"title": "Mustard Green Pesto Potato Salad",
			"ingredients": [
				{
					"Mustard Green Pesto": [
						"1/4 cup walnuts",
						"2 cloves garlic",
						"1 cup Nature's Greens Bagged Mustard Greens",
						"1/2 cup basil, washed and dried",
						"15oz can white beans (1 1/2 cups cooked), liquid reserved",
						"2 tbsp nutritional yeast, substitute vegan parmesan",
						"2 tbsp extra virgin olive oil",
						"2 tbsp red wine vinegar",
						"1 tsp salt, or to taste",
						"black pepper to taste",
						"1/4-1/2 cup aquafaba (liquid reserved from white beans), substitute water or more olive oil"
					]
				}
			],
			"time": "1 hour",
			"serving": "~6 cups",
			"recipe": [
				"1. Wash and scrub the potatoes clean, then cut into 1/2 - 3/4 inch cubes (peeling optional). Set up a pot with a steamer insert, fill with a couple inches of water and bring to a boil. Add the potatoes to the steamer basket and steam until tender, about 10-15 minutes. Remove from heat and let cool to room temperature.",
				"2. Add the walnuts and garlic to a blender or food processor. Pulse to chop up. Add the remaining pesto ingredients with 1/4 cup of the liquid from the beans. Blend or process until smooth. Add more liquid if needed.",
				"3. Combine the potatoes, mustard green pesto, and shallots in a mixing bowl. Chill until ready to eat, at least 30 minutes."
			],
			"nutrition": {
				"calories": "139kcal",
				"carbs": "22g",
				"protein": "5g",
				"total fat": "4g"
			},
			"comments": [
				"Hi Eva! Was wondering if I could use canned pureed mustard greens (season ka saag) for making the pesto &amp; if so would it involve any changes in procedure &amp; or proportion of that &amp; other ingredients? Thanks in advance."
			],
			"image": "https://www.thecuriouschickpea.com/wp-content/uploads/2020/05/pesto-potato-salad-5.jpg"
		},
		{
			"title": "Vegan Chickpea Meatballs",
			"ingredients": [
				"2 cups (305g) cooked brown rice or other grain, cold or room temperature",
				"1 cup (100g) pecans",
				"4 cloves garlic, peeled",
				"30oz can (560g) cooked chickpeas, drained and rinsed (substitute 3 cups cooked chickpeas)",
				"1/2 cup (28g) nutritional yeast",
				"2 tbsp (30g) tomato paste",
				"2 tbsp (24g) olive oil",
				"2 tsp dried basil",
				"1 tsp dried oregano",
				"1 1/2 - 2 tsp salt, to taste",
				"freshly ground black pepper",
				"1/4 cup bread crumbs (can substitute gluten free), if needed"
			],
			"time": "45 minutes",
			"serving": "~3 dozen meatballs",
			"recipe": [
				"1. Preheat the oven to 375 ºF. Prepare a baking tray by lightly oiling.",
				"2. In a food processor combine the cooked brown rice, pecans, and garlic and pulse until finely ground.",
				"3. Drain and rinse the chickpeas, and reserve about 1/2 cup. Add the rest of the chickpeas to the food processor along with the nutritional yeast, tomato paste, olive oil, dried basil, oregano, salt, and black pepper. Process until ground into a thick mixture that holds together and keeps its shape when pressed into a meatball. Work in batches if needed.",
				"4. Add the breadcrumbs if the mixture is soft and needs help holding together along with the rest of the chickpeas and pulse until they are coarsely chopped. Alternatively, if the mixture is too thick for your food processor, transfer the mixture to a mixing bowl and add the final 1/2 cup of chickpeas (slightly mashed) along with the bread crumbs and mix in by hand.",
				"5. Shape the mixture into balls using about 2 tbsp per ball. A cookie scoop makes quick work of this! Press the mixture together as you roll to help the balls hold together. Place shaped vegan meatballs on the tray and spray or drizzle with oil.",
				"6. Bake for 25-30 minutes at 375 ºF, flipping halfway through for even baking. Let cool slightly before using, or make in advance and freeze or refrigerate until ready to eat."
			],
			"nutrition": {
				"calories": "323kcal",
				"carbs": "37g",
				"protein": "12g",
				"total fat": "16g"
			},
			"comments": [
				"These meat(less)balls are just fantastic! I&#8217;ve made them more than a few times now and they never disappoint. I wouldn&#8217;t say that the texture is similar to a regular meatball since they are a bit more crumbly and mushy, but the flavor is INCREDIBLE. My partner and I don&#8217;t miss meatballs at all when we eat these. So glad to have found this recipe- it&#8217;s become a favorite in our home!",
				"Do you have any suggestions on what could be used instead of pecans, for a nut free version?",
				"Oh how embarrassing &#8211; it does say that in the recipe, I just missed it! Thanks for clarifying though. Looking forward to trying this. I love your masoor dal tadka recipe and I&#8217;m trying to expand my vegan/vegetarian repertoire.",
				"I&#8217;m excited to try this. Can you clarify on the chickpeas &#8211; should they be cooked dried chickpeas, or canned? I am guessing the former since you refer to using the reserved cooking liquid. I do have a couple cans on hand that I need to use up, so I am curious if you have tried this out with canned, and if so, do you have any recommendations or modifications? \nThanks!"
			],
			"image": "https://www.thecuriouschickpea.com/wp-content/uploads/2020/05/vegan-chickpea-meatballs-5.jpg"
		},
		{
			"title": "Restaurant Style Chana Masala",
			"ingredients": [
				"2 tbsp coconut oil or vegetable oil",
				"1 1/2 yellow onions, finely diced (2 cups)",
				"4 cloves garlic, minced",
				"1 tsp minced ginger (~1/2\" piece)",
				"4 whole dried red chiles, more or less to taste",
				"2 green cardamon pods",
				"2 whole cloves",
				"1 cinnamon stick",
				"1 bay leaf",
				"1 tsp amchoor* (dried mango powder)",
				"1 tsp ground coriander",
				"1/2 tsp ground cayenne or hot chili powder",
				"1/2 tsp garam masala",
				"1/4 tsp turmeric",
				"freshly ground black pepper",
				"1 to 1 1/2 tsp salt to taste",
				"3 cups (28oz can) cooked chickpeas, drained and rinsed",
				"26oz can strained, crushed, or puréed tomatoes",
				"1 1/2 tsp kasoori methi, optional",
				"minced cilantro, for garnish",
				"minced yellow onion, for garnish"
			],
			"time": "55 minutes",
			"serving": "6-8 servings",
			"recipe": [
				"1. Heat a large, heavy bottomed pot over medium-low heat and add the oil. Add the onion and a pinch of salt and cook for about 10 minutes until translucent and softened.",
				"2. Add the garlic, ginger, and the whole spices: dried red chiles, cardamom pods, cloves, cinnamon stick, and bay leaf. Cook for 1-2 minutes stirring constantly so the garlic doesn't burn.",
				"3. Add the ground spices: amchoor (if using), ground coriander, cayenne, garam masala, turmeric, black pepper, and 1 tsp of salt. Stir in and let cook for 30 seconds.",
				"4. Add the chickpeas and tomatoes. Partially cover, bring to a simmer, and let simmer for 25-30 minutes stirring occasionally.",
				"5. Turn off the heat, sprinkle in the kasoori methi, crumbling between your fingers. Taste and adjust the salt and pepper. Remove the whole cinnamon stick, bay leaf, and cardamom pods & cloves if you can see them.",
				"6. Serve with a dab of vegan butter to melt on top if desired. Garnish with cilantro and minced yellow onion. Enjoy with basmati rice and/or some garlic naan, and vegan unsweetened yogurt."
			],
			"nutrition": {
				"calories": "287kcal",
				"carbs": "42g",
				"protein": "9g",
				"total fat": "10g"
			},
			"comments": [
				"I have made a fair bit of Chana Masala in the past 10 years but this one is our favorite. It is SO excellent. So easy to make. Hard to believe but its even better the second day.",
				"This was my first homemade Indian dish. After I found all the ingredients &#8211; I live near a big Indian neighborhood &#8211; I was surprised at how simple the recipe was to prepare. I don&#8217;t have anything to compare it with, since I&#8217;ve never tried it anywhere, but this was delicious! Looking at other recipes, and from what I&#8217;ve probably seen on Indian restaurant buffets, Chana Masala looks soupy. I&#8217;m glad this one wasn&#8217;t, but I had to stir it frequently to keep it from sticking. I used dried garbanzos, soaked overnight and cooked, added a couple extra red chili peppers, and served it with brown basmati rice. I will be making this often, since I now have a lifetime supply of Indian spices. Thank you for sharing this recipe!",
				"My family’s Christmas Eve tradition is to gather with our Jewish friends for Indian food. So this year, I made Eva’s chana masala, biryani, raita, and mango lassi for a feast at home. These are, by far, absolutely the most delicious Indian recipes I’ve ever made &#8211; and I’ve made recipes from many sources. I&#8217;ve finally found my go-to chana masala recipe now &#8211; no need for all the others I&#8217;ve tried over the years! Thank you, Eva &#8211; I will come back to your recipes again and again!",
				"definitely it is looking restaurant like chana masala. and I am sure it would taste like one. I always prefer to use tomato instead of amchur I hope this is ok. is it? thank you for sharing this blog.",
				"Great recipe. I used about 2 pounds of fresh tomatoes instead of canned, and 1 tbsp tamarind concentrate instead of mango powder. The sauce was slightly on the acidic side, so I added 1/2 tsp sugar to balance it out.",
				"Great recipe, must warn though that amchur is strong stuff indeed. I put in a heaped teaspoon and at first I thought “my goodness, tastes of cleaning powder”. Next time maybe half a teaspoon for me. Perhaps more garum masala, a teaspoon or even two. A little more methi maybe.\nIt’s all taste though of course and this is an awesome recipe, thanks again 🙂",
				"Wow&#8230; amazing description and details&#8230;",
				"If I want to make a smaller batch (for 2 people) should I reduce the amount of spices accordingly? I.e if making half the batch, should I use half the amount of spices? Thank you! So excited to make this!!",
				"I made this recipe, trying to stick to the recipe as close as I could, and it turned out fantastic. Thanks for sharing this one!",
				"Lacking pomi, I ran a can of diced tomatoes through a blender with 2 tbsp plain tomato paste with good results.  Next time I&#8217;ll leave out the cayenne and add a minced jalapeno.  Dutch oven on the stove top at moderate temperature, it came out great.  Thank you.",
				"Wow!  This was amazing.  I used 3 peppers and it was the perfect heat.  I served this dish with curried fried rice&#8230;. just delicious.  Thanks for the great recipe!!",
				"This is a delicious and flavorful recipe. But don’t add the full amount of spices unless you want a burning hot dish. I had to add more chickpeas, two more cans of diced tomatoes, and coconut milk to dilute it enough to eat. But it is a great recipe and very simple to prepare. Just adjust the seasons to the level of spiciness you prefer.",
				"A bit too much tomato for my taste, otherwise very nice",
				"I bought a garam masala spice mix. Im wondering how much i should use as it has all the spices blended together. Thanks",
				"Do you skin your chickpeas before adding them to the masala? Also would crushed red pepper flakes work as a sub for the dried red hot chilies? Thank you!",
				"I prefer to cook my chickpeas rather than use a can. Have you ever done that? Looking at the recipe it looks like I would only need to leave out the salt until the end. Thoughts?",
				"This dish is soooo great! We serve it with long grain brown rice and its just the perfect mix and so hearty. I have tried your lentil bolognese too and its so good! Love, love, love your recipes. I can&#8217;t wait to try more!! Thanks for making it easy and delicious to eat vegan : )",
				"WHAT can I sub for the carton of strained tomatoes? An equally size can of diced tomatoes or crushed ones?",
				"If I don&#8217;t have cardamom pods, can I substitute ground cardamom, and if so, how much?",
				"Husband has a mango allergy. How about substituting Anardana powder instead?",
				"Followed exactly. This is the best C.M. recipe I’ve ever made. It will be my new go-to. Thanks!!",
				"Oops, forgot to rate this tasty dish!",
				"Whoa, this recipe is SO delicious! I made it tonight and my whole family loved it!!!  The flavours were out of this world!  Thanks for another amazing recipe, Eva!!!"
			],
			"image": "https://www.thecuriouschickpea.com/wp-content/uploads/2018/08/chana-masala-2.jpg"
		},
		{
			"title": "Vegan Korean BBQ Burgers",
			"ingredients": [
				"8oz tempeh",
				"1/2 cup water",
				"1 tbsp low sodium tamari (substitute soy sauce)",
				"1 tbsp oil",
				"1 tbsp gochujang (substitute sriracha, or leave out)",
				"1 tsp doenjang (substitute miso)",
				"1 tsp rice wine vinegar",
				"2 cloves garlic, minced",
				"2 tsp minced fresh ginger",
				"1/2 cup bread crumbs",
				"4 burger buns",
				"vegan mayonnaise",
				"1/2 recipe Korean BBQ sauce (below)",
				"Kimchi slaw (below)"
			],
			"time": "33 minutes",
			"serving": "4 burgers",
			"recipe": [
				"1. Crumble the tempeh into chunks and add to a pot along with all of the ingredients except for breadcrumbs. Bring to a boil, then partially cover with a lid and turn the heat down to simmer. Let simmer for 10-15 minutes or until the water is mostly absorbed and boiled off. Stir a couple of times. If after 15 minutes water still remains, pour any excess off.",
				"2. Transfer the tempeh to a mixing bowl and let cool down enough to handle. To speed this up, place it in the freezer for about 5 minutes.",
				"3. Add the breadcrumbs to the mixing bowl and using your hands mash the mixture until it comes together. Add more breadcrumbs if it is very wet and won't hold together, and add liquid (water, a little tamari, or more oil) if it is too dry and crumbly.",
				"4. Divide the dough into 4 pieces and form them into patties.",
				"5. Heat a skillet over medium low heat, add oil and cook the burgers about 4 minutes on each side, or until golden brown.",
				"6. Glaze the top of the burgers with the Korean BBQ sauce.",
				"7. Enjoy on toasted buns, slathered with vegan mayo (see note for gochujang mayo option) and topped with kimchi slaw."
			],
			"nutrition": {
				"calories": "504kcal",
				"carbs": "57g",
				"protein": "22g",
				"total fat": "21g"
			},
			"comments": [
				"DELICIOUS. I didn&#8217;t have the ingredients for the kimchi slaw, but this was a scrumptious burger! Thank you! A+++++!",
				"Trying this for dinner.  Sounds Yummy.",
				"This recipe is genius! I never would&#8217;ve come up with all these components. I had to make a quick kimchi&#8230;but it will suffice in the slaw. I was skeptical that the tempeh would stick together, but it went together just like your photos. We are putting on the grill. The slaw is really worth it and I made the gochuchang mayo for the bun. All that&#8217;s left is the grill meister&#8217;s deft touch and we&#8217;ll be in Gochuchang heaven soon,\nthanks for a great recipe,\nSusan"
			],
			"image": "https://www.thecuriouschickpea.com/wp-content/uploads/2020/05/Vegan-Korean-BBQ-Burgers-11.jpg"
		},
		{
			"title": "Easy Homemade Vegan Gnocchi Recipe",
			"ingredients": [
				"1 lb 4 oz (535g) baked and peeled russet potatoes* (~4 1/2 cups riced, unpacked)",
				"1 tsp (5g) salt",
				"2 tbsp (20g) olive oil",
				"2 1/2 cups (284g) all purpose flour, more as needed"
			],
			"time": "40 minutes",
			"serving": "2 lbs cooked gnocchi",
			"recipe": [
				"1. Take the peeled, cooked and cooled potatoes and cut them into sections. Using one section at a time, press them through a potato ricer. Alternatively, mash them well so that no lumps remain.",
				"2. In a large bowl add the riced or mashed potato, salt, olive oil, and flour and using clean hands mix the ingredients together and then squeeze to gently knead it into a cohesive ball. If the mixture is sticky add flour until it no longer sticks to your hand. If you can't get the flour to fully absorb and mix into the potatoes add a little extra olive oil until it comes together. The key is to not have a wet and sticky dough so that it's easy to work with and form into little dumplings.",
				"3. Keeping the dough covered so it doesn't dry out, take a small section at a time to form into the gnocchi. Take a 1 tsp (~6g) piece of dough and squeeze it in your fist to make a compact and roughly shaped ball, then roll it between your palms to make it round.",
				"4. For the traditional gnocchi shape with the grooves on one side, place a fork sitting face down on the counter and take the ball and place it at the top of the backside of the tines of the fork. With your thumb on the piece of dough, slide the gnocchi down the tines of the fork until you reach the counter. The gnocchi will turn under your thumb until it has grooves going around about 3/4 of the dough and a small inset divot where your thumb was.",
				"5. Repeat with remaining pieces of dough. If the dough becomes sticky at any point, toss shaped gnocchi with flour so they don't stick together and knead a bit of extra flour into the remaining unshaped dough.",
				"6. To cook the gnocchi, bring a large pot of salted water to a boil. Add half the gnocchi to the pot and let it cook for about 4-5 minutes, or until the gnocchi float to the top and have cooked an additional minute at the top. Remove the cooked gnocchi with a slotted spoon and then cook the second batch of gnocchi.",
				"7. Use the cooked gnocchi in your favorite recipe, or store in the fridge for up to a week (you can freeze for longer)."
			],
			"nutrition": {
				"calories": "194kcal",
				"carbs": "34g",
				"protein": "5g",
				"total fat": "4g"
			},
			"comments": [
				"I made the gnocchi tonight and it was brilliant! Thank you for the recipe.",
				"Can you freeze the gnocchi before cooking?",
				"Always thought gnocchi above my skill level.  After reading this recipe and watching the video decided to give a try.  The step by step detailed instructions made it a breeze.  Came out perfect the very 1st attempt!   Baked Gnocchi with Arrabbiata and Vegan Mozzarella on the menu tonight.",
				"Hi! Do you think I can use instant mashed potatoes and it will work?",
				"I made I small batch of these delicious 😋 gnocchi for the #danielfast and they were great so I stayed up until about 3:00am making more for my family for dinner Tomorrow. Since there are six of us I was rolling and cutting dough for quite a while but it is worth it! I love this and I wish I could add pictures because they came out great!",
				"Okay. I love this recipe. I&#8217;m so happy to have found a vegan recipe for gnocchi! I followed the instructions (though didn&#8217;t weigh my potatoes :/ ) and got a pretty good result. However, the dough had a hard time staying together, even when I added a ton more olive oil. After perusing the comments a bit I see others had the same problem when using gluten-free flour, which I did. The remedy seems to be adding a couple flax &#8220;eggs&#8221; to bind the dough. I will definitely try that next time I make this, cuz I definitely want to try again!\nOh also, even though I struggled to get the gnocchi to stay in shape, they held together just fine when cooking. The end result was super sticky because of all the oil I used, so I laid them out to dry a bit on a sheet of parchment paper so that they didn&#8217;t all glob together.",
				"This was pretty good.  I&#8217;m not a huge fan of the flavor of olive oil with some foods.  This is one of them.  The next time I do this recipe (cuz I will) I&#8217;ll use grapeseed oil or something like that. I&#8217;m also thinking of plant based butter with this.  I paired this with a vegan mushroom sauce. I&#8217;ll def try it again!!",
				"Could I use oat flour instead?\nThank you",
				"I&#8217;ve had trouble making vegan gnocchi in the past, it has been very hard to roll out and hasn&#8217;t bound properly. I love this recipe! I peeled then boiled my potatoes because I find it easier that way, and I had excellent results 🙂",
				"Thank you for posting this recipe. It was super easy and informative. I made it yesterday and my gnocchi came out great. ?❤",
				"Please, what is contained in All Purpose Flour. My husband is allergic to wheat, and I have just bought my first bag of Gram Flour.\nTIA. Jjanette",
				"I did 1/2 sweet potato 1/2 regular potato. I forgot that I was low on AP flour so I had to use mostly whole wheat flour. I put in way more than 2.5 cups flour and it was STILL sticky. I ran out of whole wheat flour too, and it was still way too sticky to shape, so I had to throw it out unfortunately.",
				"it says above the recipe\n You can reheat cooked gnocchi either in the sauce it’s being served in, or by blanching briefly in boiling water. You can also toast it on the stove in a bit of olive oil\nHope this helps",
				"I made these gnocchi and they were absolutely delicious. I am so pleased with this recipe and the result. I tried to make gnocchi once before and it was a disaster, so am really chuffed with the result tonight. I also crisped them in olive oil and added them to sautéed garlic, spinach, red sweet pepper and chilli with some vegan rashers thrown in. Vegan Parmesan sprinkled on top. Oh so yummy ?",
				"I tried this and really worked!\nMy little one has gluten  allergy and I could never make fresh pasta.\nThis was so delicious and she loved it.\nThank you",
				"Just use gluten free flour",
				"Tried this recipe. Way too much flour in my opinion. I would recommend starting with 1cup.",
				"It is a great recipe! So easy ( a bit long, but hey, I&#8217;m not complaining) simple and fun to make! I really enjoyed making gnocchi for the first time. I roasted the potatoes on my microwave and they had the perfect texture ( although I killed the microwave in the process of cooking the last potato&#8230;) But seriously, it is really good thank you for the recipe. 🙂",
				"Hi. Do you think this would work with Yukon gold potatoes? Thanks.",
				"This recipe was perfect. I don&#8217;t have anything else to say, thanks for the help 🙂",
				"I made them yesterday and they were delicious! But I definitely disagree here. The ammount I got was for serving 4 people very well, or 5 or 6 people with a decent size plate without repeating. I served it with tomato sauce and veggies",
				"Planning to make gnocchi tomorrow. Can’t wait.. recipe looks easy enough and you have walked Us through the possible pitfalls.",
				"Hi there! I’m hoping to make this for dinner tonight, how many people does this recipe serve? Thanks!",
				"Can I freeze the gnocchi?",
				"Thank you so much Daniel. I JUST got your reply today, 2/3/2020 and that is the only reason you did not hear from me sooner. God Bless you for the info &lt;3",
				"Great recipe, thanks for sharing. I served this in a pesto soup and people loved it!",
				"I just made them with Pamela&#8217;s all-porpoise GF flour. The dough broke apart so I added a couple &#8220;vegan eggs&#8221; for a binder and that helped hold the dough together. To make a vegan egg just combine  2 tbsp flax seed and 6 tbsp warm water and let sit for 5 minutes. Dump that into the dough and it will help bind.",
				"How would you reheat these once cooked and cooled? Microwave or hot water?",
				"Need a gluten-free vegan version please&#8230;..love gnocchi and hated giving them up",
				"OMG I have just found this as I am moving towards a vegan lifestyle and they are amazing and |I love your passion for Gnocchi, it mirrors my own.  I will bookmark you, but I will make this recipe soon x",
				"I understand your obsession with gnocchi, they are just so delicious and soft. This looks very good!"
			],
			"image": "https://www.thecuriouschickpea.com/wp-content/uploads/2018/02/homemade-vegan-gnocchi-7.jpg"
		},
		{
			"title": "Vegan Tinga Tacos",
			"ingredients": [
				"2 1/2 cups (4 oz) dehydrated soy curls*",
				"1 tbsp oil, divided",
				"1 yellow onion, diced",
				"2 cloves garlic, smashed and peeled",
				"1 15 oz can fire roasted tomatoes with green chili",
				"1 cup diced tomatillos, fresh or canned",
				"2 tbsp chipotles in adobo, chopped",
				"2 tbsp adobo sauce from the can",
				"1 tsp dried oregano (ideally Mexican)",
				"2 sprigs fresh thyme, or 1/2 tsp dried thyme",
				"1/2 cup vegetable broth or water",
				"1 tsp salt, or to taste",
				"Black pepper to taste",
				"12 corn tortillas",
				"diced onion, for garnish",
				"cilantro, for garnish",
				"avocado crema, to serve"
			],
			"time": "50 minutes",
			"serving": "8-12 tacos",
			"recipe": [
				"1. Place soy curls in a heat proof bowl and cover with ~2 cups of boiling hot water. Let sit for at least 15 minutes, or until it's cooled enough to handle. Drain the soy curls then squeeze out water by hand.",
				"2. Preheat a large skillet over medium heat and add 2 tsp of oil and the onion. Sauté for 4-5 minutes until softened and lightly browned. Add the smashed cloves of garlic and cook an additional 1 minute.",
				"3. Add the chipotles and adobo, tomatillos, tomatoes, oregano, thyme, salt, black pepper and 1/2 cup of broth or water. Lower the heat and bring to a simmer. Cook for 7-10 minutes until the tomatoes and tomatillos have broken down. ",
				"4. Remove the sprigs of thyme and transfer the sauce to a blender. Blend until smooth, venting to allow steam to escape.",
				"5. Turn the heat back up to medium, and add the remaining teaspoon of oil to the pan. Fry the soy curls with a pinch of salt for 3-5 minutes until they are lightly browned.",
				"6. Turn the heat to low, and pour in the sauce. Be careful of splattering as the liquid hits the hot pan. Cook on low, simmering, for 12-15 minutes until the sauce is reduced and thickly coating the soy curls (or seitan). Taste and adjust seasoning if necessary.",
				"7. Serve in warmed corn tortillas. Garnish with cilantro and diced onion if using and drizzle over avocado crema."
			],
			"nutrition": {
				"calories": "176kcal",
				"carbs": "25g",
				"protein": "9g",
				"total fat": "6g"
			},
			"comments": [
				"Gluten-free is the new favourite.  I am actually excited to try this recipe because my previous taco experiment was a total failure. the look if the recipe actually inspiring me because we are a spicy food lover. Wish me a luck girl."
			],
			"image": "https://www.thecuriouschickpea.com/wp-content/uploads/2017/08/tinga-tacos-7.jpg"
		},
		{
			"title": "Vegan Avocado Crema",
			"ingredients": [
				"1 ripe avocado",
				"1/4 cup vegan sour cream",
				"1/4 tsp salt, or to taste",
				"Juice from 1 lime (2 tbsp)",
				"water to thin"
			],
			"time": "5 minutes",
			"serving": "1 cup",
			"recipe": [
				"1. Cut the avocado in half and remove the pit. Scoop out the flesh and place in a small food processor or blender.",
				"2. Add the vegan sour cream, salt, and lime juice and process until smooth. Add water to thin as needed. Taste and adjust seasonings."
			],
			"nutrition": {
				"calories": "56kcal",
				"carbs": "3g",
				"protein": "1g",
				"total fat": "5g"
			},
			"comments": [],
			"image": "https://www.thecuriouschickpea.com/wp-content/uploads/2020/05/vegan-avocado-crema-4.jpg"
		},
		{
			"title": "Kimchi Slaw",
			"ingredients": [
				"1 cup thinly sliced cabbage (green or red)",
				"1 cup chopped kimchi",
				"1/4 cup vegan mayonnaise",
				"1 tsp rice wine vinegar"
			],
			"time": "10 minutes",
			"serving": "2 cups",
			"recipe": [
				"1. Mix all ingredients together in a large bowl. Taste and adjust seasoning if needed. Store in sealed container in fridge until ready to eat."
			],
			"nutrition": {
				"calories": "82kcal",
				"carbs": "5g",
				"protein": "1g",
				"total fat": "7g"
			},
			"comments": [],
			"image": "https://www.thecuriouschickpea.com/wp-content/uploads/2020/04/kimchi-slaw-3.jpg"
		},
		{
			"title": "Korean BBQ Sauce",
			"ingredients": [
				"1/2 cup low sodium tamari or other soy sauce*",
				"1/4 cup brown sugar",
				"2-3 cloves garlic, minced",
				"1 tbsp minced fresh ginger",
				"1 tbsp gochujang (substitute another chili sauce or paste)",
				"1 tbsp rice wine vinegar",
				"1 tbsp toasted sesame oil",
				"2 tsp doenjang (Korean soybean paste, substitute miso)",
				"1 tbsp cornstarch",
				"1/4 cup water"
			],
			"time": "10 minutes",
			"serving": "1 cup",
			"recipe": [
				"1. Mix together all ingredients in a small pot except cornstarch and water.",
				"2. Bring to a simmer over low heat until the sugar dissolves.",
				"3. Mix together the cornstarch and water in a small bowl, then add it to the pot.",
				"4. Whisk sauce together and let simmer until thickened, 1-2 minutes. If needed, thin with additional water."
			],
			"nutrition": {
				"calories": "59kcal",
				"carbs": "10g",
				"protein": "2g",
				"total fat": "2g"
			},
			"comments": [],
			"image": "https://www.thecuriouschickpea.com/wp-content/uploads/2020/04/Korean-BBQ-Sauce-3.jpg"
		},
		{
			"title": "Buffalo Cauliflower Penne",
			"ingredients": [
				"1 lb penne pasta",
				"2 vegan sausages, cooked and torn into bite sized pieces (optional)",
				"1 tbsp oil",
				"1 head cauliflower, cut into 1\" slices",
				"1 cup cashews*",
				"1 1/2 cup water",
				"1/4 cup Louisiana-style hot sauce, e.g. Franks, extra to serve",
				"1 tsp smoked paprika",
				"1 tsp onion powder",
				"1/2 tsp granulated garlic",
				"1/2 tsp salt",
				"Freshly ground black pepper",
				"Chopped fresh oregano, for garnish (optional)"
			],
			"time": "30 minutes",
			"serving": "6-8 servings",
			"recipe": [
				"1. Bring a large pot of salted water to a boil and cook pasta according to package directions. Reserve 1 cup of pasta cooking water, then drain the pasta and return to the pot.",
				"2. Meanwhile, heat a large nonstick skillet over medium heat. Cook the vegan sausage until browned on a few sides, then remove and let cool enough to handle. Tear into bite sized pieces.",
				"3. Add 1 tbsp oil to the skillet along with the cauliflower. Sprinkle a little salt over top. Cook for 8 minutes, flipping halfway through, or until charred lightly on each side. ",
				"4. In a blender add the cashews, water, hot sauce, smoked paprika, onion powder, granulated garlic, salt, and ground pepper. Blend until creamy and smooth.",
				"5. Add the roasted cauliflower, chopping any larger sections, and blend until the cauliflower is ground into crumbles, or your desired level of smoothness.",
				"6. Pour the sauce into the pot with the pasta and vegan sausage and stir to combine. Cook over low heat for 1 minute, adding reserved pasta water as needed. Adjust seasonings to taste. Serve garnished with fresh oregano and extra hot sauce."
			],
			"nutrition": {
				"calories": "254kcal",
				"carbs": "28g",
				"protein": "14g",
				"total fat": "11g"
			},
			"comments": [],
			"image": "https://www.thecuriouschickpea.com/wp-content/uploads/2017/07/buffalo-cauliflower-penne-5.jpg"
		},
		{
			"title": "Homemade Vegan Wontons",
			"ingredients": [
				"1 cup TVP",
				"1 cup boiling water",
				"1 tbsp oil",
				"2 tbsp chopped scallions, white and light green parts",
				"3-4 cloves garlic, minced",
				"2 tsp minced ginger",
				"1/2 tsp crushed red pepper",
				"2 tbsp soy sauce",
				"salt, to taste if needed",
				"2 tsp toasted sesame oil",
				"1 package vegan wonton wrappers (should contain ~48 wrappers)"
			],
			"time": "50 minutes",
			"serving": "4 dozen",
			"recipe": [
				"1. Combine TVP and boiling water in a heat proof bowl. Set aside to hydrate, about 10 minutes.",
				"2. Heat a skillet over medium heat, add the oil, scallion, garlic, ginger, and red pepper. Sauté for about 30-60 seconds.",
				"3. Add the hydrated TVP and sauté about 3 minutes until its lightly browned. Mix in the soy sauce, then taste and add salt if desired. Turn off the heat and add the toasted sesame oil. Set aside and let the filling cool enough to handle.",
				"4. Shape the wontons: Place a wrapper in your palm and fill it with about 1 teaspoon of the filling. Rub water along the edge of the wrapper then fold the dumpling in half to make a rectangle. Add water to the bottom two corners, then bend them together to touch. Press to seal while pushing out air from the dumpling.Alternative shape: Wet the edges of the wrapper and bring two opposite corners to touch, then bring the remaining two corners to meet in the center. Pinch the edges together to seal, pushing air out while doing so.",
				"5. Dumplings can be cooked immediately or frozen to cook at a later time. To freeze, spread out on a baking tray in a single layer. Let freeze solid, then transfer to a sealable freezer bag. Cook from frozen, dumplings will take slightly longer to cook.",
				"6. Deep Fry Instructions: Heat oil to 350 ºF and add dumplings a few at a time so as not to crowd the oil. Fry for 1-2 minutes or until golden. Flip or press them down in the oil using a spider strainer to cook evenly. Remove and let drain on a paper towel. Repeat until dumplings are cooked.Steam & Pan Fry Instructions: Heat a large skillet over medium-low heat. Add oil then place the dumplings in a single layer. Let cook for 1-2 minutes or until the bottoms are golden, then pour about 1/4 cup of water into the pan and immediately cover to capture the steam. Let the dumplings steam about 1-2 minutes or until tender.",
				"7. Serve warm with dumpling dipping sauce."
			],
			"nutrition": {
				"calories": "129kcal",
				"carbs": "20g",
				"protein": "7g",
				"total fat": "2g"
			},
			"comments": [
				"Nice recipe but i wanted to mention that your &#8220;classic&#8221; wonton shape, while perfectly functional, is not the real wonton shape. For real chinese wontons you place teaspoon of filling just above one corner of wrapper, fold corner over filling, roll to tuck point under. Moisten two side corners and pull them together behind filled corner and overlap slightly, pinch together to seal. This leaves a nice floaty little tail. Takes a little practice but just as easy once you get the hang of it. Of course you can also just pinch corner to corner for a triangle shape before sticking ends together or stick with the rectangle shape like youve done. In the end the only things that really matter are that they taste delicious and are cruelty free!",
				"So amazing! We had some leftover wonton wrappers and needed to use them up, and since then they&#8217;ve been a staple. We added maybe 5x the amount of scallions because we&#8217;re fiends for the stuff. We pan fried then steamed for the crunch and chew and OMG.",
				"Delicious!!  I haven’t had wonton soup in years and now I’m so happy to have a vegan recipe for the wontons I remember from chinese restaurants before I went vegan!  I froze the rest of the batch and plan to test a few in the air fryer later this week- I will update with the results.  Thank you Eva!",
				"The vegan wontons were very delicious. I added more ginger, a lot more, because I love ginger. But other than that the recipe was delicious and easy to follow. Thank you!"
			],
			"image": "https://www.thecuriouschickpea.com/wp-content/uploads/2020/04/vegan-wontons-9.jpg"
		},
		{
			"title": "Dumpling Dipping Sauce",
			"ingredients": [
				"4-8 dried Thai chiles, or see note",
				"1-2 cloves garlic, minced",
				"1 tsp minced fresh ginger",
				"2 tbsp oil",
				"3 tbsp tamari or soy sauce",
				"2 tsp rice vinegar",
				"a few slices of scallion greens (optional)"
			],
			"time": "36 minutes",
			"serving": "1/3 cup",
			"recipe": [
				"1. Cover dried chiles with boiling hot water and let sit until soft, about 20-30 minutes. Drain water then mince the peppers.",
				"2. Add the peppers, garlic, and ginger to a heat proof bowl. Heat the oil on the stove until hot, then pour over the aromatics. Let sizzle and then cool slightly.",
				"3. Add the soy sauce (or tamari) and rice vinegar. Taste and adjust seasoning as desired.",
				"4. Garnish with scallions if doing so, and enjoy immediately or store in sealed container the fridge for up to 2 weeks."
			],
			"nutrition": {
				"calories": "38kcal",
				"carbs": "1g",
				"protein": "1g",
				"total fat": "4g"
			},
			"comments": [
				"Wow! This Dumpling Dipping Sauce is absolutely flavorful! Surely gonna be my new favorite dipping sauce! Also, I used a low-sodium soy sauce for a much lighter version and it turned out fantastic!",
				"Yes! Tried this with a slight variation. Instead of soaking the dried chillies in hot water, I soaked it in hot oil, the amount needed in the ingredients list. Turned out fantastic!"
			],
			"image": "https://www.thecuriouschickpea.com/wp-content/uploads/2020/04/dumpling-dipping-sauce-1.jpg"
		},
		{
			"title": "Vegan Chocolate Chip Marshmallow Cookies",
			"ingredients": [
				"1/2 cup (115g) vegan butter, softened",
				"1/3 cup (66g) brown sugar",
				"1/3 cup (66g) granulated sugar",
				"2 tbsp (30g) aquafaba",
				"1 tsp (5g) vanilla extract",
				"1 1/4 cup (165g) all purpose flour",
				"1/2 tsp salt",
				"1/2 tsp baking soda",
				"3/4 cups (125g) semisweet chocolate chips",
				"1/2 cup (55g) vegan mini marshmallows"
			],
			"time": "28 minutes",
			"serving": "16 cookies",
			"recipe": [
				"1. Preheat the oven to 375 ºF",
				"2. Beat vegan butter, brown sugar, and granulated sugar with a stand or hand mixer until creamy. Add the aquafaba and vanilla extract and beat another minute or so until smooth.",
				"3. Add the flour, baking soda, and salt and beat until just mixed. Fold in the chocolate chips and marshmallows.",
				"4. Drop by heaping 2 tbsp onto an un-greased or parchment lined baking sheet, placing cookies about 2\" apart. Optional: freeze dough for 10 minutes before baking for a thicker cookie.",
				"5. Bake at 375 ºF for 12-13 minutes. Rotate the cookie sheets halfway through for even baking.",
				"6. Remove from oven and allow to cool for 2 minutes, then transfer to a cooling rack to cool completely."
			],
			"nutrition": {
				"calories": "172kcal",
				"carbs": "23g",
				"protein": "1g",
				"total fat": "9g"
			},
			"comments": [],
			"image": "https://www.thecuriouschickpea.com/wp-content/uploads/2017/05/vegan-chocolate-chip-marshmallow-cookies-1.jpg"
		},
		{
			"title": "Cocktail Chana Samosas",
			"ingredients": [
				{
					"Chana Dal": [
						"1 cup (200g) dry chana dal, sorted for debris and rinsed",
						"2 cups water",
						"1/2 tsp salt",
						"2 tbsp oil",
						"1 tsp whole cumin seed",
						"1 large yellow onion, finely chopped",
						"2 green chiles, minced (seed for less heat)",
						"2 tbsp sesame seeds",
						"1 tsp garam masala",
						"1/2 tsp turmeric",
						"1/2 tsp salt, or to taste",
						"1/4 cup minced cilantro, leaves and tender part of the stem"
					]
				},
				{
					"Everything Else": [
						"1 package vegan egg roll wrappers (1 lb)",
						"3 tbsp water",
						"1/4 cup flour",
						"oil to fry or bake"
					]
				}
			],
			"time": "1 hour",
			"serving": "about 4 dozen",
			"recipe": [
				"1. Combine the rinsed chana dal, 2 cups of water, and 1/2 teaspoon of salt in a pressure cooker. Cook on high pressure for 7 minutes, then do a natural pressure release for at least 15 minutes before releasing any remaining pressure. Drain any excess water.",
				"2. Heat the oil in a large skillet over medium-low heat, and add the cumin seed. Let sizzle until a shade darker and fragrant, about 30 seconds.",
				"3. Add the onion, chili peppers, and sesame seeds, turn the heat up to medium and cook until the onion is soft, about 3-5 minutes.",
				"4. Stir in the garam masala, turmeric, and salt. Then add the drained chana dal and gently mix in. Let cook so that any remaining water cooks off. Taste and adjust the seasoning. Turn off the heat and mix in the cilantro. Set aside to cool to room temperature, or store in the fridge until ready to use.",
				"5. Mix together the 3 tablespoons of water and 1/4 cup of flour to make the glue and set aside.",
				"6. Using a few egg roll wrappers at a time, and keeping the rest covered to prevent them from drying out, cut the wrappers into thirds.",
				"7. Place a heaping teaspoon at the bottom of the cut wrapper, then fold the edge over to make a triangle. Flip the triangle over to line up with the opposite side, making an equilateral triangle shape. Flip it once or twice more, until you only have about 1\" remaining. Brush the end with the flour paste 'glue' and then fold that end over, sealing up your samosa. Repeat with remaining wrappers and filling.",
				"8. To bake the samosa: Brush each samosa with oil, then bake at 400ºF for 10 minutes, flip and bake another 5-8 minutes until golden and edges are crispy.To fry the samosa: Heat at least 2\" of oil to 325 ºF (or use a deep fryer). Fry the samosa in batches to not overcrowd. Fry each batch of samosa for about 4 minutes, or until golden and the pastry is covered in small bubbles. Let drain on a paper towel lined plate or on a cooling rack.Enjoy your samosa warm and with a side of chutney!"
			],
			"nutrition": {
				"calories": "68kcal",
				"carbs": "9g",
				"protein": "2g",
				"total fat": "3g"
			},
			"comments": [
				"Cooked these in my air fryer for about 12 minutes and flipped them half way, and they are absolutely perfect!",
				"These were fantastic!! I used wonton wrappers (because I happened to have a package) and made beautiful and delicious triangles in the oven. So glad I made a double batch. Thanks so much for the recipe. ?"
			],
			"image": "https://www.thecuriouschickpea.com/wp-content/uploads/2020/03/cocktail-chana-samosa-9.jpg"
		},
		{
			"title": "Homemade Raspberry Scones",
			"ingredients": [
				{
					"Glaze": [
						"1/2 cup powdered sugar, sifted",
						"1 tbsp water"
					]
				}
			],
			"time": "37 minutes",
			"serving": "6 scones",
			"recipe": [
				"1. Preheat the oven to 400 ºF.",
				"2. Measure out the non-dairy milk and add the vinegar. Set aside for 5-10 minutes to make the buttermilk.",
				"3. Add the flour, sugar, baking powder, and salt to a large mixing bowl. Whisk together to combine.",
				"4. Cut the cold vegan butter into the dry mixture using a pastry cutter or two opposing butter knives. When it resembles a sandy, crumbly mixture and the largest pieces of butter are about pea sized, add the vegan buttermilk and extract (if using).",
				"5. Gently mix the wet ingredients into the dry with a large spoon or silicon spatula. It should start to clump into larger pieces. If there are dry, powdery areas left add a bit extra milk in 1-2 teaspoon increments to those areas.",
				"6. Once the scone dough is just starting to mix together, add the raspberries and ginger (if using) and gently fold in.",
				"7. Turn the dough out onto a clean counter, lightly floured if your dough is sticky. Gently knead the dough until it comes together, then shape into a disc, about 6-7 inches in diameter. Cut into 6 pieces.",
				"8. Arrange the cut pieces onto a parchment lined baking tray. Optional: place scones in freezer for 5-10 minutes while oven finishes preheating. Immediately before baking brush the tops with a bit of additional milk to help them brown (if desired) and bake for 20-22 minutes or until the tops are golden.",
				"9. To make the glaze if using, mix together the sifted powdered sugar and water. It should be stiff but also drizzle slowly off a spoon. Add more water or powdered sugar to get the desired consistency. Drizzle over the scones once they have cooled to room temperature."
			],
			"nutrition": {
				"calories": "348kcal",
				"carbs": "54g",
				"protein": "5g",
				"total fat": "12g"
			},
			"comments": [
				"These scones are fabulous! Hubby said he didn&#8217;t know a raspberry scone could taste this good. I used almond extract as suggested and the combination is divine. Can&#8217;t wait to make another batch with ginger this time.",
				"Thank you for the great recipe. I was able to find the vegan butter by Miyoko&#8217;s Creamery. Absolutely amazing. I already made them twice with raspberries and bluberries. Thank  you again!",
				"I made two batches of these scones today, both were absolutely delicious.  For the second batch I added lemon zest to the scone mixture as well as the icing.  Thank you Eva for wonderful this recipe.",
				"Can you freeze half the batch to bake later?\nWe love the recipe but enjoy them fresh?",
				"Hello&#8230; I can’t wait to try this recipe! I have a question&#8230; have you ever tried frozen blueberries  as a filling?\nThank-you, Kathy"
			],
			"image": "https://www.thecuriouschickpea.com/wp-content/uploads/2020/03/raspberry-scones-4.jpg"
		},
		{
			"title": "Vegan Irish Stew",
			"ingredients": [
				{
					"Seitan": [
						"1 cup (136g) vital wheat gluten",
						"1/4 cup (27g) chickpea flour",
						"1 tbsp (5g) nutritional yeast",
						"1/2 cup (120g) vegetable broth",
						"1 tbsp (15g) soy sauce",
						"1 tbsp (14g) olive oil",
						"scant 1/8 tsp liquid smoke (optional)"
					]
				},
				{
					"Everything Else": [
						"1 tbsp + 1 tsp olive oil, divided",
						"1 large yellow onion, chopped",
						"4 cloves garlic, minced",
						"2 bay leaves",
						"2 tbsp flour",
						"2 cups vegetable broth (ideally beef-less broth)",
						"11oz bottle Guinness Stout",
						"4 sprigs fresh thyme (or 1 tsp dried)",
						"4 large carrots, 1-inch dice",
						"4-6 red or yellow waxy potatoes, 1-inch dice",
						"1/4 cup tomato paste",
						"1 tbsp vegan worcestershire sauce",
						"salt and pepper to taste"
					]
				}
			],
			"time": "1 hour 25 minutes",
			"serving": "6 servings",
			"recipe": [
				"1. Mix together the dry ingredients for the seitan, then mix in the wet. Knead until well combined, then cover and let rest for 15 minutes. Shape into a disc and cut into ~ 3/4-inch chunks. Toss the pieces in 1 tablespoon of oil and a sprinkling of salt and pepper.",
				"2. Heat a large cast iron or nonstick skillet over medium and add the seitan chunks when hot (no need to add any extra oil). Fry for about 5 minutes, or until the chunks are lightly browned. Remove from pan and set aside.",
				"3. Add another teaspoon of oil to the pan if needed, then add the onions and a pinch of salt. Cook the onions until lightly caramelized, about 10-15 minutes.",
				"4. Add the garlic and bay leaves, and let cook for about 60 seconds. Add the flour and stir to coat, then add the browned seitan, carrots, potatoes, broth, guiness, tomato paste, thyme, and worcestershire sauce. Bring to a low boil, then turn the heat down and let simmer, covered, for 45-60 minutes until the vegetables are tender and seitan is cooked. Stir occasionally. ",
				"5. Remove the bay leaves and thyme sprigs, add salt and pepper to taste and serve!"
			],
			"nutrition": {
				"calories": "383kcal",
				"carbs": "45g",
				"protein": "35g",
				"total fat": "7g"
			},
			"comments": [
				"Any recommendations what I can substitute the beer with? I know it’s hard to substitute without having it affect the flavor and whatnot, but I personally don’t like to cook with beer and would still like to try this recipe!",
				"Thank you for recipe"
			],
			"image": "https://www.thecuriouschickpea.com/wp-content/uploads/2020/03/vegan-irish-stew-10.jpg"
		},
		{
			"title": "Homemade Kale Soda Bread",
			"ingredients": [
				"1 1/2 cups (352g) soy milk",
				"1 1/2 tbsp (23g) fresh squeezed lemon juice",
				"2 cups (66g) packed torn kale, tough stems removed (~4-6 stalks)",
				"2 1/2 cups (335g) all purpose flour",
				"1 cup (140g) whole wheat flour",
				"1 tbsp (12g) sugar",
				"1 1/4 tsp (7g) baking soda",
				"1 tsp (6g) salt",
				"2 tbsp (28g) vegan butter"
			],
			"time": "55 minutes",
			"serving": "1 loaf",
			"recipe": [
				"1. Preheat the oven to 375 ºF. If baking in a dutch oven and/or on a baking stone, put that in the oven to preheat.",
				"2. Measure out the soy milk and pour in the lemon juice. Set aside for 5-10 minutes to clabber and make homemade buttermilk.",
				"3. Wash your kale thoroughly, then add it to a pot and just barely cover with water. Add 1/2 teaspoon of salt to the water. Bring to a boil and let boil for about 5 minutes, or until the kale is tender. Drain and cover with ice and cold water.",
				"4. When the kale is cool enough to handle, drain the ice water and squeeze the kale dry. Add to a blender along with about half of the buttermilk and blend until fairly smooth. Some pieces of kale are ok.",
				"5. In a large mixing bowl combine the all purpose and whole wheat flour, sugar, baking soda, and salt. Add the vegan butter and with your hands rub it into the dry mixture until crumbly.",
				"6. Add the kale buttermilk mixture and any remaining buttermilk and mix the dough together with a wooden spoon. Once shaggy and combined, turn onto a clean and floured surface and knead a couple of times to bring together. Add more flour if the dough is too sticky. Shape into a round dough ball, about 2\" tall.",
				"7. Place the shaped dough onto a piece of parchment paper for easy transfer (optional), and cut an X into the top of the dough with a serrated knife or bread lame. Then move the dough into the warmed dutch oven, a cast iron skillet, or directly onto a baking stone or baking sheet.",
				"8. Bake for 35-40 minutes, or until the outside is lightly browned and the internal temperature reaches 190 ºF (test temperature from bottom of loaf). If baking in a preheated dutch oven, cover for the first 25 minutes of baking time, then uncover for the next 10-15 minutes.",
				"9. Let cool on a cooling rack for at least 20 minutes before slicing into!"
			],
			"nutrition": {
				"calories": "164kcal",
				"carbs": "30g",
				"protein": "5g",
				"total fat": "3g"
			},
			"comments": [
				"Would the texture or flavor of the bread be majorly affected if I were to leave out the lemon juice? If so, is there something else I can substitute it with? Thanks!",
				"I didn&#8217;t get anything like your green. Don&#8217;t see how it&#8217;s possible without coloring. The kale just created speckles.",
				"Do you cook in a convection oven? Just wanting to know if I should adjust the temperature. Thanks!",
				"Found this when looking for recipes to use up kale. Thank you! I have a couple of questions. First, what happens if you leave out the butter? I ask because I am currently eliminating extra fat in my diet for a time. Also, any idea if this will still work if only whole wheat flour is used?"
			],
			"image": "https://www.thecuriouschickpea.com/wp-content/uploads/2020/03/kale-soda-bread-7.jpg"
		},
		null,
		null,
		{
			"title": "No-Boil Vegan Mac and Cheese",
			"ingredients": [
				"2 tbsp vegan butter",
				"1 lb uncooked pasta (macaroni or other small shape)",
				"1 1/2 cups cashews + 5 cups water (substitute 4 1/2 cups store bought plant milk + 1 1/2 cups water)*",
				"7oz vegan cheddar, shreds or slices",
				"7oz vegan smoked gouda or smoked provolone (or additional cheddar), shreds or slices",
				"1 tsp salt",
				"1 tsp garlic powder",
				"1/2 tsp mustard powder",
				"1/2 tsp smoked paprika, or to taste"
			],
			"time": "1 hour 5 minutes",
			"serving": "6-8 servings",
			"recipe": [
				"1. Preheat the oven to 375 ºF. Add the vegan butter to a 3 to 4 quart baking dish or 9x13-inch baking dish and place in the oven to melt. Remove once melted and spread the melted butter to coat the pan.",
				"2. Put the uncooked macaroni into the dish and mix in the cheese, salt, garlic powder, and mustard powder to evenly distribute. If using slices of cheese tear or chop before adding.",
				"3. If making homemade cashew milk, blend the cashews and 5 cups of water until smooth (see note). Pour in the homemade cashew milk (or store bought plant milk and water) and gently stir to combine.",
				"4. Cover the pan with a lid, aluminum foil, or an overturned baking sheet that's large enough to cover the dish and trap the steam. Bake for 40 minutes, stirring halfway through. Check a noodle for doneness, it should be tender at this point, if not continue to cook until it is tender.",
				"5. Uncover the baking dish, sprinkle smoked paprika over top, and bake an additional 5-20 minutes until the top gets crispy to your liking. Let cool for a few minutes before serving!"
			],
			"nutrition": {
				"calories": "388kcal",
				"carbs": "38g",
				"protein": "13g",
				"total fat": "21g"
			},
			"comments": [
				"The best part of this recipe is the no-boil one pot piece. I&#8217;d love to make this without the vegan cheese. I did check out the other recipes, but all involve lots more work and cleanup. Is there way to use this method without the vegan cheese?",
				"This has been my go-to since I heard about  the NON-vegan version on some TV talk show! It looked like such a great idea I figured there HAD to be a vegan version. And with a quick search, I discovered there was!!!\nI would post a photo, but so far it’s been late in the evening (bad light) and my family inhales this as soon as I get it out of the oven!!  Just know it’s a HUGE hit."
			],
			"image": "https://www.thecuriouschickpea.com/wp-content/uploads/2020/02/no-boil-mac-and-cheese-6.jpg"
		},
		{
			"title": "Restaurant Style Aloo Matar",
			"ingredients": [
				"1 tsp oil",
				"1 large yellow onion, diced",
				"4-6 garlic cloves, minced",
				"1 tbsp minced ginger",
				"1 tsp garam masala",
				"1/2 tsp turmeric powder",
				"1/4 - 1 tsp cayenne pepper, to taste",
				"1 tsp salt, or to taste",
				"1 15oz can tomatoes, whole or diced (or 3 tomatoes chopped)",
				"1 lb yukon gold potatoes (4-5 small potatoes), peeled and cut into 1/2\" pieces",
				"1 cup green peas, fresh or frozen",
				"1 cup Pacific Foods Low Sodium Vegetable Broth",
				"2 tbsp coconut cream (optional)",
				"cilantro for garnish"
			],
			"time": "35 minutes",
			"serving": "6 servings",
			"recipe": [
				"1. Heat the oil in a large pot over medium heat and add the onion and a pinch of salt. Sauté until soft, about 5 minutes. Add the garlic and ginger, and let fry for about 1 minute.",
				"2. Add the garam masala, turmeric, cayenne, and salt and stir to coat the onion mixture, then add the tomatoes. If using whole tomatoes break them into chunks with a spatula. Sauté until the tomatoes have softened and turned juicy, starting to break down, about 5 minutes. Blend the sauce until smooth with an immersion blender or upright blender and return to pot.",
				"3. Add the potatoes, peas, and vegetable broth. Turn the heat up to bring to a low boil, then turn the heat down, cover, and let simmer until the potatoes are tender, usually 10-15 minutes.",
				"4. Add the coconut cream and stir to combine. Taste and adjust salt as needed. Garnish with cilantro to serve."
			],
			"nutrition": {
				"calories": "151kcal",
				"carbs": "30g",
				"protein": "5g",
				"total fat": "2g"
			},
			"comments": [
				"I’ve just made this two days in a row because I loved it so much. I made mine oil free by using vegetable broth to sauté the veggies instead. So good, thanks for the recipe! I can’t wait to try more of your dishes.",
				"This was fantastic! Tasted exactly like I’ve had it in Indian restaurants. And so easy! No hard-to-find ingredients, all stuff I had in my pantry.",
				"This is a new staple in our home! We lessen the cayenne for the toddlers but it is a family favorite all around!",
				"So yummy!  I&#8217;d clipped this awhile ago to make and just found it.  My whole family loved it and can&#8217;t wait for me to make it again.  I think I need to cut the potatoes a little smaller or parboil them first; it took about an hour to get them soft but I&#8217;d started early so it wasn&#8217;t a problem.",
				"OMG this recipe turned out so good! I have never had aloo matar, but I wanted to try a more vegetable-based diet for some time and honestly eating Indian food is the only way to do that 😉 Thanks so much for sharing. I literally just got done eating it.",
				"I just found this recipe and can&#8217;t wait to try it!  All through my childhood our closest family friends were a family from India.  We shared many many meals at both homes.  My very favorite at their house was fresh of the stove poori bread torn and used to scoop up what we called &#8220;subji&#8221; (sub-gee).  Decades and many moves around the country later, I&#8217;ve never been able to find a &#8220;subji&#8221; dish or recipe.  I&#8217;ve no doubt this dish is it&#8230;. potatoes, peas, creamy and slightly spicy tomato sauce&#8230;.. Y.U.M.!!!!!!  My mouth is watering!!!!!  Thank you!",
				"Eva this was absolutely delicious! I was googling a recipe for aloo matar after getting a mad indian food craving while only having pantry staples and was so excited to find this recipe from YOU!  It was delicious, even better the next day. \nI hope you, Omar, Selkie, and Minx are well &lt;3 Sending love from California. \n&lt;3 Becky and Anthony",
				"Hello! I&#8217;ve just made the Aloo Matar 2hrs ago&#8230;. it was a blast!! My daughter adored it and I ate 3portions 🙂 This evening also my fiancee will  taste it, i am sure he&#8217;ll love it as well. Thank you, i will definitely cook a LOT of your recipes from now on! Ps i also did Chapati 🙂",
				"This is amazing. You are so talented",
				"Delicious! Thank you for sharing. I also added some paneer that I had dry fried in a pan. Soooo good!",
				"I love this recipe, but am trying to keep my complex carbohydrates to a minimum and am therefore staying away from potatoes. Do you think cauliflower would be a good substitute?"
			],
			"image": "https://www.thecuriouschickpea.com/wp-content/uploads/2020/02/aloo-matar-9.jpg"
		},
		{
			"title": "Homemade Scallion Pancakes",
			"ingredients": [
				{
					"Dough": [
						"2 1/4 - 2 1/2 cups (310-345g) all purpose flour",
						"1 cup (235g) boiling water",
						"1 tsp (5g) salt"
					]
				},
				{
					"Filling": [
						"2 tbsp all purpose flour",
						"1 tsp black pepper",
						"1/4 tsp salt",
						"1/2 tsp red pepper flakes (optional)",
						"3 tbsp hot vegetable oil",
						"1 bunch scallions, dark and light green parts thinly sliced",
						"Oil, to cook"
					]
				}
			],
			"time": "1 hour 35 minutes",
			"serving": "6 pancakes",
			"recipe": [
				"1. Mix the flour and salt together for the dough, pour in the boiling hot water and mix together with chopsticks or a wooden spoon to make a dough. Then, knead the dough using a stand mixer (if kneading by hand let cool enough to handle without burning yourself) for 5-8 minutes to make a supple and slightly tacky dough.",
				"2. Oil a mixing bowl and place the dough ball in the bowl, turning to coat the dough with oil. Cover with a damp towel or plastic wrap and let sit at room temperature for at least 30 minutes but ideally 1-2 hours. Alternatively, wrap dough in plastic and place in fridge to rest overnight.",
				"3. When ready to shape the pancakes, mix together the flour, salt, pepper, and red pepper flakes if using in a small dish. Carefully add the hot oil and stir together.",
				"4. Lightly oil a silicon mat or a clean countertop and turn out the dough. Divide into 6 pieces, and place them back in their covered bowl or under a damp towel.",
				"5. Take out one piece of dough at a time and roll until the dough is thin into large rectangle shape. Brush the dough with the flour-oil mixture and sprinkle with sliced scallions.",
				"6. Roll the long edge of the dough over the scallions to make a rope, then roll the rope starting at one end to make a spiral shape. Tuck the second end of the rope under the spiral to hold it in place.",
				"7. Flatten the spiral with your hand to make a disk, then roll out until the pancake is about 6-7\" in diameter. Place the rolled pancake on parchment paper and top with a second piece of parchment paper. Repeat the shaping with the remaining pieces of dough. You can stack the shaped pancakes, sandwiching them between parchment paper.",
				"8. To cook the pancakes: heat a skillet (two to make it go faster) or griddle over medium heat. Add a layer of oil and once hot fry the pancakes. Cook the pancakes 3-5 minutes on each side, flipping as needed to keep them from burning (turn down the heat if cooking too fast). Add more oil or use a silicon brush to push the oil back into the center as needed.",
				"9. Place the cooked pancakes on a paper towel lined plate or cooling rack and let rest for a few minutes before eating!"
			],
			"nutrition": {
				"calories": "319kcal",
				"carbs": "42g",
				"protein": "6g",
				"total fat": "14g"
			},
			"comments": [
				"How thoughtful of you! I will check out the link and give it a try.",
				"I am interested in making this recipe. It looks delicious! I&#8217;m wondering if using Bob&#8217;s Mill 1:1 gluten free flour will work? Have you tried making a gluten free version of this?",
				"Those look delicious, and I understand that the gluten plays a big part in their flakiness. However, I am gluten-free and wondered if any other flours, or combination of flours, would substitute? Besan, almond flour, etc.?"
			],
			"image": "https://www.thecuriouschickpea.com/wp-content/uploads/2020/02/scallion-pancakes-9.jpg"
		},
		{
			"title": "Easy Homemade Vegan Chili",
			"ingredients": [
				{
					"Optional toppings": [
						"Jalapeños",
						"Scallions",
						"Red onion",
						"Cherry tomatoes",
						"Cilantro",
						"Avocado",
						"Vegan sour cream",
						"Vegan shredded cheddar cheese"
					]
				}
			],
			"time": "30 minutes",
			"serving": "6 servings",
			"recipe": [
				"1. Heat oil in a large pot over medium heat. Add the onion and a pinch of salt and sauté until soft, about 5-7 minutes. Add the garlic and let cook for about 30 seconds. ",
				"2. Add the pinto, black, and kidney beans along with the dehydrated TVP, canned tomatoes, broth, nutritional yeast, cocoa powder, chili powder, cayenne pepper and a teaspoon of salt.",
				"3. Turn the heat up and bring to a simmer, lower the heat and let simmer covered for about 15 minutes, stirring occasionally. Taste and add salt to taste.",
				"4. Serve hot with cornbread (optional) and toppings of your choice."
			],
			"nutrition": {
				"calories": "451kcal",
				"carbs": "74g",
				"protein": "33g",
				"total fat": "5g"
			},
			"comments": [
				"I like this recipe but it comes out watery, not thick like chili usually is. What am I doing wrong?",
				"This recipe looks so great! How can I convert it to  cook in a slow cooker? Thank you!",
				"Thank you for this recipe, Eva!  This is the best chili I&#8217;ve made, vegan or not.  You&#8217;re right, the tvp adds A LOT. I try to keep my meals lower-sodium so I used lower-sodium crushed tomatoes, and home-made no-salt beans.\nI&#8217;ve eaten this chili so far once topped with sauerkraut, and once topped with tofutti. Hard to tell which I liked better. 🙂\nMy mom and my kids (6, 6, and 9 yrs old) love this recipe too!",
				"I didn&#8217;t have pinto beans so I used one can each of red kidney, white cannellini, black eyed peas and black beans. I also threw in an extra tbsp of cocoa just because I thought the flavour would be interesting as well as some frozen corn which was on the cusp of freezer burn (didn&#8217;t want to toss it)\nI hadn&#8217;t noticed that ran out of chili powder and the shops were closed, so I subbed with two tsp of Sambal Oelek (Indonesian chili paste). It surprised me how good it tastes!. Managed to get 9-500 ml jars from this recipe, so there&#8217;s a goodly number of frozen meals for me. I&#8217;m trying to eat no to very low oil, so only using 1 tbsp of oil to cook the onions and garlic was fine with me. \nOverall I&#8217;d give this two spoons up!! DELICIOUS!",
				"absolutely delicious! it even fooled my meat lover son!! but how do I cut the spice for my vegan daughter???",
				"This chili is delicious. I have tried so many plant-based recipes and this is the best. It actually has a wonderful flavor. Most other recipes are so bland. I used all the ingredients listed. Usually, I have a difficult time finding ingredients listed in other recipes.",
				"Thank you for this recipe its soo delicious. And you’re right, definitely gets better day after day :p",
				"Hey Eva, for the meaty part, can TVP be substituted for Tofu?",
				"Thank you ?",
				"Can normal diced tomatoes be substituted for fire roasted tomatoes?"
			],
			"image": "https://www.thecuriouschickpea.com/wp-content/uploads/2020/02/vegan-chili-8.jpg"
		},
		{
			"title": "Burmese Kaukswe",
			"ingredients": [
				{
					"Toppings": [
						"Crispy fried onions",
						"Crispy fried noodles",
						"Chopped dry roasted peanuts",
						"Minced cilantro",
						"Minced hot chiles (jalapeño, serrano, or thai chiles)",
						"lemon or lime wedges to serve"
					]
				}
			],
			"time": "30 minutes",
			"serving": "8 servings",
			"recipe": [
				"1. Heat the oil in a large pot over medium. Add the onion and sauté until soft, about 5 minutes. Add the garlic, ginger, and dried chiles and cook another 1 minute to mellow.",
				"2. Add the tofu, chickpea flour, spices, and salt and stir to combine. Add the coconut milk and broth or water, followed by the bamboo shoots.",
				"3. Turn the heat up and bring the curry to a boil, then turn the heat down and let simmer for 10-15 minutes for the chickpea flour to cook and flavors to meld. Taste and adjust spices.",
				"4. Turn off heat and add the lemon or lime juice.",
				"5. Serve with the cooked rice noodles and toppings arranged in bowls. Pile noodles, curry, and desired toppings into each bowl, and squeeze in the extra lemon or lime wedges before eating!"
			],
			"nutrition": {
				"calories": "421kcal",
				"carbs": "52g",
				"protein": "17g",
				"total fat": "18g"
			},
			"comments": [
				"I add a teaspoon of soya sauce and half teaspoon of fish sauce to the curry. Also a couple of Knorrs chicken cubes!",
				"I made this incredibly easy to make and so so delicious recipe for my parents for dinner. I made a completely vegetarian version but even my carnivorous husband devoured it all! I’ve always loved Khausuey (as we call it here in India), and am so glad I found this easy to make recipe. Certainly a crowd pleaser, especially since you can have an entire table full of topping options!\nThank you!!",
				"Fabulous recipe . The whole family loved the crumbled tofu and the color of the curry"
			],
			"image": "https://www.thecuriouschickpea.com/wp-content/uploads/2020/01/khao-suey-10.jpg"
		},
		{
			"title": "Refried Bean Dip [vegan & gluten free]",
			"ingredients": [
				"1 15oz can refried beans (~2 cups homemade)",
				"1 cup salsa",
				"4 oz vegan cream cheese",
				"1 cup vegan cheddar shreds",
				"1 tsp chili powder",
				"1/2 tsp ground cumin",
				"optional garnishes: cilantro, minced jalapeño"
			],
			"time": "40 minutes",
			"serving": "4 cups",
			"recipe": [
				"1. Mix together all of the ingredients except for the garnishes.",
				"2. Oven: put the dip in an oven-safe dish and bake at 375 ºF covered for 30-40 minutes or until the cheese is melted and the dip is hot and bubbly.  Stir occasionally.Stovetop: warm the dip in a pot over medium low heat (covered), stirring occasionally, until the cheese has melted and the dip is hot and bubbly.",
				"3. Garnish with cilantro and jalapeños (optional) and serve warm with tortilla chips to dip!"
			],
			"nutrition": {
				"calories": "129kcal",
				"carbs": "8g",
				"protein": "6g",
				"total fat": "8g"
			},
			"comments": [
				"Mmm&#8230; I&#8217;d love to taste this vegan refried bean dip! I believe it&#8217;s such a great appetizer! Plus, the recipe is super duper simple. Can&#8217;t wait to give it a try. Lucky me, I have all the ingredients at home. Thank you for this inspiration!\np.s. the photos you take are stunning!",
				"Can you please share the recipes of kimchi and Ethiopian food? I like kimchi but can not eat it from Asian stores since it has fish sauce. \nThank you."
			],
			"image": "https://www.thecuriouschickpea.com/wp-content/uploads/2020/01/refried-bean-dip-5.jpg"
		},
		{
			"title": "Vegan Garlic Parmesan Potato Stacks",
			"ingredients": [
				"6-8 yukon gold potatoes",
				"1 tbsp extra virgin olive oil or melted vegan butter, plus a bit extra",
				"1 cup vegan cream*",
				"½ cup vegan parmesan",
				"2 garlic cloves, minced",
				"½ tsp fresh thyme",
				"½ tsp salt",
				"pepper to taste"
			],
			"time": "35 minutes",
			"serving": "12",
			"recipe": [
				"1. Preheat oven to 375 ºF. Oil a muffin tin by brushing with olive oil or melted vegan butter or spraying with oil and set aside.",
				"2. Thinly slice the potatoes (no need to peel) using a mandolin on its thinnest setting or a sharp knife.",
				"3. Put the potato slices in a large bowl, add the olive oil or melted vegan butter, vegan cream, half of the vegan parmesan (1/4 cup), garlic, thyme, salt, and pepper and toss together.",
				"4. Stack the muffin tins with the potatoes until they’re as high as the rim. Spoon the cream over each stack of potatoes until they’re about ¾ submerged, or until the cream is used up.",
				"5. Sprinkle the rest of the vegan parmesan overtop each stack, and drizzle a bit more olive oil or melted vegan butter on top.",
				"6. Bake for 20-25 minutes, or until the potatoes are very tender when pierced with a knife."
			],
			"nutrition": {
				"calories": "130kcal",
				"carbs": "20g",
				"protein": "3g",
				"total fat": "4g"
			},
			"comments": [
				"These were DELICIOUS.  Trying vegan recipes since my daughter is vegan.  Are these good to freeze?"
			],
			"image": "https://www.thecuriouschickpea.com/wp-content/uploads/2019/11/vegan-garlic-parmesan-potato-stacks-6.jpg"
		},
		{
			"title": "Vegan Breakfast Hash",
			"ingredients": [
				"2 tbsp oil",
				"1 lb yukon gold potatoes, cut into 1/2\" dice",
				"1/2 tsp salt, more to taste",
				"1 yellow onion, finely diced",
				"2 cloves garlic, minced",
				"1 bunch kale, stems removed and chopped or 12oz bag of Nature's Greens Kale",
				"1 recipe chorizo chickpeas (below)",
				"2 vegan sausages, cut into 1/2\" pieces",
				"1 tsp smoked paprika",
				"1/2 tsp ground cumin",
				"black pepper to taste",
				"2 tbsp freshly squeezed lemon juice",
				"cilantro for garnish"
			],
			"time": "30 minutes",
			"serving": "6 servings",
			"recipe": [
				"1. Heat a large skillet over medium heat and add 1 tablespoon of oil, the potatoes, and 1/2 teaspoon of salt. Cover the pan and let the potatoes cook until they are just barely tender, stirring every couple of minutes. This should take about 10 minutes, depending on size of cut potato.",
				"2. Remove the lid and add 1 tablespoon of oil followed by the onion, garlic, and chopped kale. Cook uncovered, until the kale is wilted and the onion is softened, about 5 minutes.",
				"3. Add the chickpeas and sausages (if using), smoked paprika, cumin, and some pepper to taste. Sauté for 2-3 minutes or until the sausages are lightly browned and the potatoes are very tender.",
				"4. Turn off heat and add lemon juice, taste and adjust salt and seasonings. Garnish with cilantro."
			],
			"nutrition": {
				"calories": "255kcal",
				"carbs": "36g",
				"protein": "15g",
				"total fat": "7g"
			},
			"comments": [
				"Found your site today and made this today.\nWe keep yellow potatoes cooked in the instapot in the fridge so ours were pre-cooked. Added red and green peppers as I didn’t have any kale. We don’t use oil but the recipe still worked excellent. Topped it with vegan cheese sauce ( we make up a batch each week and use it all week) olives, avocado, spring onions and a little salsa. I used some jalapeño on mine. Very delicious and will definitely make again",
				"I just wanted to let you know how much we enjoy this recipe. We eat it for dinner often. I use sweet potatoes in place of the yellow potato and only use the chorizo chickpeas. It&#8217;s become a family favorite. Thank you!",
				"Hi Eva, I&#8217;ll try to prepare to make this the morning of my mom&#8217;s birthday breakfast. Do you think preboiling the potatoes will help ease up the process? Or would it get too mushy? Thanks, am a big fan."
			],
			"image": "https://www.thecuriouschickpea.com/wp-content/uploads/2020/01/Breakfast-hash-2.jpg"
		},
		{
			"title": "Vegan Hollandaise",
			"ingredients": [
				{
					"Cashew Hollandaise": [
						"3/4 cup cashews",
						"1 1/2 cup plant milk or water",
						"1/4 cup freshly squeezed lemon juice",
						"1/4 cup melted vegan butter or refined coconut oil",
						"1/4 cup nutritional yeast",
						"1 tsp ground mustard seed",
						"1/2 tsp white pepper",
						"1/4-1/2 tsp ground turmeric (use 1/2 tsp for more yellow color)",
						"Pinch of ground cayenne"
					]
				},
				{
					"Tofu Hollandaise": [
						"16oz (2 cups) silken tofu",
						"1/4 cup freshly squeezed lemon juice",
						"1/4 cup melted vegan butter or refined coconut oil",
						"1/4 cup nutritional yeast",
						"1 tsp ground mustard seed",
						"1/2 tsp white pepper",
						"1/4-1/2 tsp ground turmeric (use 1/2 tsp for more yellow color)",
						"Pinch of ground cayenne"
					]
				}
			],
			"time": "40 minutes",
			"serving": "3 cups",
			"recipe": [
				"1. For either the cashew hollandaise or tofu hollandaise: combine all ingredients in a blender and blend until smooth. Transfer to a small pot and warm over low-medium heat until warm and thickened. Add water to thin if necessary. Enjoy immediately or save for later, reheating to serve."
			],
			"nutrition": {
				"calories": "114kcal",
				"carbs": "5g",
				"protein": "4g",
				"total fat": "9g"
			},
			"comments": [
				"I made the tofu version for my vegan spouse. I am not vegan but it was excellent, I will make this again even just for myself. It is more foolproof than a traditional hollandaise, saves well, and the ingredients are easier to have on hand. Really loved this recipe",
				"Every Christmas morning, I&#8217;m in charge of making eggs benedict for my family. Since I&#8217;m vegan, this year I made &#8220;regular&#8221; hollandaise and this recipe for vegan hollandaise. Honestly, my husband preferred this recipe! It is absolutely delicious! And you don&#8217;t have to worry about it breaking apart like with butter/egg based hollandaise.\nI followed the recipe as is, but I did add more lemon juice at the end &#8211; personal preference, and a bit of black salt (the eggy tasting salt). This is truly a wonderful recipe, and I&#8217;m so grateful that I can still join in the family tradition while keeping it vegan. Thank you!",
				"Its worth saying that eventhough you may not enjoy an &#8216;eggy&#8217; taste alot of people do so that black salt would be a good addition kala namak",
				"I made the cashew version and we loved it.  Thank you!",
				"Just made the tofu version as written and it is delish!!! Many thanks! Will be topping grilled asparagus and baked potatoes for dinner ?",
				"Just made your cashew version -+ zest from the lemon. Fantastic! How does it store best?"
			],
			"image": "https://www.thecuriouschickpea.com/wp-content/uploads/2020/01/vegan-hollandaise-9.jpg"
		},
		{
			"title": "Chorizo Chickpeas (vegan & gluten free)",
			"ingredients": [
				"15 oz can chickpeas (2 cups cooked), drained and rinsed",
				"2 tsp oil",
				"2 tsp smoked paprika",
				"1/2 tsp ground cumin",
				"1/2 tsp garlic powder",
				"1/2 tsp onion powder",
				"1/2 tsp salt, or to taste",
				"black pepper to taste"
			],
			"time": "9 minutes",
			"serving": "1 1/4 cups",
			"recipe": [
				"1. Heat a skillet over medium heat. Add the oil and chickpeas.",
				"2. Fry the chickpeas for 2-3 minutes, or until they get a bit of color.",
				"3. Add the spices, salt, and pepper and stir to coat. Cook another 2-3 minutes to toast the spices and brown the chickpeas slightly."
			],
			"nutrition": {
				"calories": "162kcal",
				"carbs": "24g",
				"protein": "8g",
				"total fat": "5g"
			},
			"comments": [
				"Add one teaspoon of salt with the other spices, then add more depending on what you want."
			],
			"image": "https://www.thecuriouschickpea.com/wp-content/uploads/2020/01/chorizo-chickpeas-8.jpg"
		},
		{
			"title": "Garlic Urad Dal Fry",
			"ingredients": [
				"2 cups (414g) dried urad dal, sorted and debris removed then rinsed",
				"5 cups water",
				"1 tsp coriander powder",
				"1/2 tsp turmeric powder",
				"1/2 tsp salt",
				"2 tbsp vegetable oil or coconut oil",
				"2 tsp whole cumin seed",
				"5-6 cloves garlic, peeled and roughly chopped",
				"1 tbsp minced ginger",
				"1 tsp garam masala",
				"1/2 tsp amchoor powder (or substitute 2 tbsp lemon juice)",
				"1/2 tsp cayenne pepper (more or less to taste)",
				"salt to taste, start with 1 tsp",
				"1/4 cup minced fresh cilantro, more for garnish"
			],
			"time": "1 hour",
			"serving": "8 servings",
			"recipe": [
				"1. In a pressure cooker combine the sorted and rinsed urad dal with the 5 cups of water, coriander powder, turmeric, and salt. Cook on high pressure for 25 minutes and allow the pressure to release naturally for at least 15 minutes.",
				"2. When the urad dal is ready, heat the oil over medium low heat in a skillet or pot large enough to accommodate the cooked dal. Add the cumin seed and let fry until fragrant, about 30 seconds.",
				"3. Add the garlic and ginger and cook until the garlic is starting to turn golden in places, about 1 1/2-2 minutes, depending on size of garlic. Be careful not to burn.",
				"4. Stir in the garam masala, amchoor powder, and cayenne pepper and add the cooked urad dal and any remaining cooking water. Bring the dal to a simmer and add salt to taste, adjust any other spices to taste as well. Let the dal simmer for 5-10 minutes to meld the flavors, add water as needed to thin to your desired consistency.",
				"5. Turn off the heat and stir in the 1/4 cup cilantro. Serve garnished with additional cilantro. Other optional garnishes include fresh minced chiles and minced red onion."
			],
			"nutrition": {
				"calories": "206kcal",
				"carbs": "27g",
				"protein": "11g",
				"total fat": "7g"
			},
			"comments": [
				"Hello !  I found a bag of URAD GOTA at Costco today.  What is it ?  Is it a bean or a lentil ?   How should I cook it ?  Should I soak it first ?  Excited to try this new healthy food.",
				"Wondering if you can replace urad dal with black beans?",
				"Loved this recipe !  Husband and I nearly ate the whole portion.   Thank you for all the Indian inspired recipes.   We will try them all one by one!"
			],
			"image": "https://www.thecuriouschickpea.com/wp-content/uploads/2020/01/garlic-urad-dal-fry-4.jpg"
		},
		{
			"title": "Afghan Kidney Bean Curry (Lubya)",
			"ingredients": [
				"2 tbsp coconut oil, divided",
				"1 tbsp whole coriander seed",
				"1 tsp whole cumin seed",
				"1/2 tsp dried mint (optional)",
				"1 15 oz can (1 1/2 cups) whole tomatoes",
				"1 small red onion, small dice, some reserved for garnish",
				"4 cloves garlic, minced",
				"1 cup vegetable broth",
				"3 cups cooked kidney beans (2 15 oz cans) , rinsed and drained",
				"1 tsp freshly ground black pepper, or to taste",
				"1 tsp salt, or to taste*",
				"cilantro for garnish",
				"basmati rice, to serve"
			],
			"time": "40 minutes",
			"serving": "6 servings",
			"recipe": [
				"1. Melt 1 tablespoon of oil in a heavy bottomed pot over medium-low heat. Add the coriander and cumin and cook for about a minute or until the aromatic and a shade darker. Keep a close eye on them so they don't burn.",
				"2. Add the dried mint and the tomatoes and their juices to the pot (watch for splattering!), and mash them a little. Cook over medium-low heat, stirring occasionally, for around 7 minutes until they break down and are saucy. Transfer to a blender and blend until smooth, making sure to vent.",
				"3. Heat the remaining 1 tablespoon of oil to the pot and melt over medium-low heat. Add the onion and cook for 5 minutes, stirring occasionally, until softened and starting to turn golden. Then add the minced garlic, and continue cooking for an additional 5 minutes, stirring often so it doesn't burn.",
				"4. Once the onions are nice and caramelized add the broth, the spiced tomato sauce, kidney beans, salt and pepper. Simmer uncovered on low heat for about 15 minutes. Adjust seasonings to taste.",
				"5. Garnish with cilantro (if desired) and minced red onion and serve with basmati rice."
			],
			"nutrition": {
				"calories": "199kcal",
				"carbs": "29g",
				"protein": "10g",
				"total fat": "5g"
			},
			"comments": [],
			"image": "https://www.thecuriouschickpea.com/wp-content/uploads/2018/06/afghan-kidney-bean-curry-lubya-3.jpg"
		},
		{
			"title": "Tofu Buddha Bowl with Carrot Ginger Dressing",
			"ingredients": [
				{
					"Carrot Ginger Dressing": [
						"1/2 cup Pacific Foods Cashew Carrot Ginger Soup",
						"1/2 cup cashews*",
						"1/4 cup rice vinegar",
						"1 tsp toasted sesame oil",
						"2 tbsp fresh lime juice"
					]
				},
				{
					"Sesame Kale": [
						"1 bunch kale, ribs removed and chopped",
						"1 tsp oil",
						"2 cloves garlic",
						"1 tbsp sesame seeds",
						"1 tbsp rice vinegar",
						"1 tsp toasted sesame oil"
					]
				},
				{
					"Tamari Tofu": [
						"1 block extra firm tofu",
						"1 tbsp oil",
						"2 tbsp low sodium tamari",
						"1 tsp miso",
						"1 tbsp rice vinegar",
						"1 tbsp maple syrup",
						"1 tsp toasted sesame oil"
					]
				},
				{
					"Everything else": [
						"Cooked brown rice",
						"Shredded red cabbage",
						"Sliced carrots",
						"Roasted cashews, chopped",
						"Fresh mint, for garnish"
					]
				}
			],
			"time": "55 minutes",
			"serving": "4 servings",
			"recipe": [
				"1. Combine all of the ingredients for the dressing in a blender and blend until smooth. If using cashew butter (see note below), use a whisk or immersion blender to combine. Refrigerate until ready to use.",
				"2. Wash the kale, remove the stalks and roughly chop the leaves. Heat a large skillet over medium heat and add the teaspoon of oil and the kale along with a pinch of salt.",
				"3. Cook the kale until wilted, then add the garlic and sesame seeds. Let fry a minute or two until a shade darker, then add the rice vinegar and sauté until absorbed. Turn off the heat and add the toasted sesame oil.",
				"4. First press the tofu. Slice the block of tofu into 5 slabs and wrap them in a lint free towel on the counter. Place a heavy object on top and let press for 15-20 minutes, then cut the pressed tofu into cubes.",
				"5. Whisk together the tamari, rice vinegar, maple syrup, miso, and toasted sesame oil to make the marinade and set aside.",
				"6. Heat a large skillet over medium heat and add the tablespoon of oil. When hot, add the cubed tofu. Let fry until the bottom is light golden, then gently ease the spatula under the tofu and flip. Let the tofu cook on at least three sides, then add the tamari marinade and toss to coat.",
				"7. Let the marinade simmer and reduce, glazing the tofu. Once the tofu is lightly caramelized, remove from the heat.",
				"8. In a bowl pile cooked brown rice, sesame kale, tamari tofu, shredded cabbage, sliced carrots, roasted cashews and fresh mint. Drizzle with the carrot ginger dressing and toss before eating. Enjoy!"
			],
			"nutrition": {
				"calories": "473kcal",
				"carbs": "48g",
				"protein": "19g",
				"total fat": "24g"
			},
			"comments": [],
			"image": "https://www.thecuriouschickpea.com/wp-content/uploads/2020/01/tofu-buddha-bowls-with-carrot-ginger-dressing-9.jpg"
		},
		{
			"title": "Walnut Parsley Linguine",
			"ingredients": [
				"1 lb linguine, gluten free if desired",
				"1/4 cup olive oil",
				"1 cup chopped walnuts",
				"3-4 cloves garlic, peeled and thinly sliced",
				"1/2 cup chopped Italian parsley, more for garnish",
				"1/4 cup nutritional yeast, or vegan parmesan",
				"1/2 cup pasta cooking water, more as needed",
				"salt and pepper to taste",
				"vegan parmesan to serve (optional)"
			],
			"time": "20 minutes",
			"serving": "6 servings",
			"recipe": [
				"1. Bring a large pot of salted water to a boil. Cook the pasta according to package directions until it is 1-2 minutes short of perfectly cooked. Reserve about 1 cup of pasta water then drain the pasta.",
				"2. Meanwhile, heat a large 12\" skillet (or large pot) over medium low heat. Add the olive oil, walnuts, and thinly sliced garlic. Sauté until toasty and the garlic is a pale golden in places, 3-4 minutes.",
				"3. Add the parsley  and nutritional yeast and stir to coat. Cook about 1 minute to toast the nutritional yeast.",
				"4. Turn the heat to low and add the cooked pasta along with 1/2 cup of the pasta cooking water. Stir together and let cook 1 minute or until the pasta is perfectly done. Add more pasta water if needed. Season with salt and pepper to taste.",
				"5. Serve hot, garnished with additional parsley and pass vegan parmesan at the table."
			],
			"nutrition": {
				"calories": "353kcal",
				"carbs": "29g",
				"protein": "10g",
				"total fat": "23g"
			},
			"comments": [
				"This reminds me of something my mother used to make and I love that this is vegan, so now I can make it too! I love food with nuts added, for the added texture and flavor. Thank you for sharing!",
				"Thank you!  We have been using nutritional yeast based Parms and this looks even better.  We are newly vegan and I am missing the CHEESE.  ❤️",
				"Hello!  So glad I have found your site!  What brand of vegan parm did you use in this photo? Miyoko?  Thank You!  I will\nPost when I make this:)"
			],
			"image": "https://www.thecuriouschickpea.com/wp-content/uploads/2020/01/walnut-parsley-linguine-8.jpg"
		},
		{
			"title": "Vegan Lentil Enchiladas",
			"ingredients": [
				{
					"Lentils": [
						"1 1/2 cups dry Brown, French, or Green lentils",
						"4 1/2 cups water",
						"1 tsp dried oregano",
						"1/2 tsp salt",
						"1 bay leaf"
					]
				},
				{
					"For the filling": [
						"2 tsp oil",
						"1 yellow onion, diced",
						"2 cloves garlic, minced",
						"1-2 minced jalapeños, seeded for less heat",
						"1 tsp ground cumin",
						"1 tsp chili powder",
						"1/2 tsp dried oregano",
						"1/2 tsp salt, more to taste"
					]
				},
				{
					"Everything Else": [
						"18 corn tortillas",
						"1 recipe Enchilada sauce, below",
						"vegan butternut squash queso, below"
					]
				}
			],
			"time": "1 hour",
			"serving": "18 enchiladas",
			"recipe": [
				"1. Sort any debris or small stones from the lentils and rinse thoroughly. Transfer to a pot and cover with 4 1/2 cups water. Add the 1/2 teaspoon of salt, 1 teaspoon of oregano, and bay leaf. Bring to a boil, then reduce heat and let simmer for about 20 minutes, or until the lentils are tender. Drain the lentils, reserving at least 1 cup of cooking water. Discard the bay leaf.",
				"2. Heat a large skillet or pot over medium and add the oil. Sauté the onion until soft and translucent, about 5 minutes. Add the garlic and jalapeño and cook for 1-2 minutes.",
				"3. Stir in the spices, then add the cooked lentils and 1/2 cup of cooking liquid. Cook the lentils for 7-8 minutes or until the lentils are starting to break down. Add more of their cooking liquid as necessary to keep it from getting too dry. Taste and adjust seasoning.",
				"4. Preheat the oven to 375 ºF and warm the enchilada sauce.",
				"5. Pour some enchilada sauce to lightly coat the bottom of a baking dish, use a 9 x 13\" pan or lasagna pan to make all enchiladas at once.",
				"6. Pour some enchilada sauce into a plate. Dip the tortillas into the enchilada sauce, flipping to coat both sides. Fill with the lentil filling and roll the tortillas. Place the filled tortilla seam side down in the baking dish. Repeat with remaining tortillas. ",
				"7. Pour enchilada sauce to cover tortillas and then top with butternut queso. Bake uncovered for about 20 minutes."
			],
			"nutrition": {
				"calories": "142kcal",
				"carbs": "22g",
				"protein": "5g",
				"total fat": "3g"
			},
			"comments": [],
			"image": "https://www.thecuriouschickpea.com/wp-content/uploads/2019/12/lentil-enchiladas-9.jpg"
		},
		null,
		null,
		null,
		null,
		null,
		null,
		null,
		null,
		null,
		null,
		null,
		null,
		null,
		null,
		null,
		null,
		null,
		null,
		null,
		null,
		null,
		null,
		null,
		null,
		null,
		{
			"title": "Easy Overnight Pizza Dough",
			"ingredients": [
				"1 1/2 cups (350g) water, 95 ºF",
				"2 1/2 tsp (14g) salt",
				"1/4 tsp dried instant yeast",
				"4 cups (500g) all purpose flour"
			],
			"time": "9 hours 30 minutes",
			"serving": "2 15 oz dough balls or 3 10oz dough balls",
			"recipe": [
				"1. Measure out the warm water in a large mixing bowl. Add in the salt and stir to dissolve. Sprinkle the yeast over the water and let sit for a couple of minutes to hydrate and dissolve, then stir to distribute.",
				"2. Add the flour into the mixing bowl and stir with a wooden spoon until you form a shaggy dough. Switch to using your hands. Wet your hands to prevent the dough from sticking to them and pinch the dough into several segments between your first finger and thumb. Then reach under the edges of the dough and gently pull it up to stretch the dough until you hit resistance, then fold the section of dough over to rest of the dough. Turn the bowl 1/4 turn and repeat the pulling and folding until you've gone all around. This action brings the dough back into one piece. Repeat the pinching and folding process for about 1-2 minutes until your dough starts to turn into a cohesive, but sticky ball of dough. Re-wet your hands as necessary to prevent the dough from sticking to them. Cover the bowl and let rest for 20 minutes.",
				"3. After the 20 minutes of rest, turn the dough onto a clean and floured surface. Knead the dough for about 1 minute until you get a smooth ball of dough. Flour your hands and add flour to the counter as necessary to prevent sticking. Lightly coat the mixing bowl with oil and place the ball of dough mixing bowl, turning to coat in oil before leaving seam side down. Cover the mixing bowl and let the dough rise for about 1 hour, until it's doubled in size. You can let it rise for up to 2 hours before shaping.",
				"4. Turn the dough onto a clean, floured counter and stretch to make a large rectangle. You're going to divide the dough into 2 or 3 pieces (depending on the size you want your final pizza to be) by sprinkling flour over where you're going to cut (this prevents it from sticking) and cut into the sections with a bench scraper, or with a butter knife by pressing straight down into the dough.",
				"5. Shape the dough one piece at a time. To shape the dough, you will use the same folding technique as before (this time with dry or lightly floured hands). Take a section of the dough and gently stretch it up until you feel resistance, then fold over the middle. Take the next section and repeat, and move around the dough until you have created a tight ball. Then, turn the ball of dough and place seam side down on a clean, un-floured section of the counter. Cup the dough ball between your hands with your pinky fingers resting on the counter behind it. Pull the dough towards you, allowing the friction between the dough and counter to pull the dough underneath itself, and using your pinky fingers to prevent the dough from simply rolling. Turn the dough about a quarter turn and repeat. Do this until you've gone in a full circle and the skin around the dough ball is taught. Sprinkle flour over the dough and spread it around with your hands until the dough is not sticky to touch. Repeat with the remaining sections of dough, then place on a floured plate. Sprinkle more flour on top of the dough, then cover with plastic wrap and place the plate in the fridge for at least 6 hours, or up to 72 hours, before making pizza.",
				"6. Before shaping the dough and baking, let come to room temperature and relax for about 1 hour. If you try to shape the dough and it's not stretching out easily or quickly, let it rest for 10 minutes then try again."
			],
			"nutrition": {
				"calories": "152kcal",
				"carbs": "32g",
				"protein": "4g",
				"total fat": "0g"
			},
			"comments": [
				"@Taylor Dent, \nCooking pizza with cast iron is epic. When using cast iron you usually want to use a dutch oven, that is have a lid that can absorb heat as well.\nmy suggestion is to heat the cast iron first and with a peel drop the pizza into the pan so you can use the heat of the pan to do the cooking, and, make it well covered with a lid of some sort, any pan / lid is better than foil and it should work well.",
				"@thecuriouschickpea, \nFreezing dough happens after the final proofing. When you thaw it out it will be ready to shape and use.",
				"@Tony, \nUnless you are using a brick yeast, rapid rise is perfectly fine. The difference is you just do not need to proof it first.",
				"Hi Eva,\nThank you for the recipe! This was my first time making pizza dough. It turned out great! Can&#8217;t wait to do it again&#8230;\nCouple questions though. At any time do I need to punch the dough down? Not sure why even. Lol. And can I add seasonings to the dough?\nThank you,\nJohn",
				"Hello and thank you for the recipe.  Can I make a whole wheat version of this?",
				"@Gary Hewett &#8212; Gary is the epitome of a male Karen.",
				"@Eva Agha, I believe the only difference between instant and active yeast is that instant yeast has smaller granules with some yeast activator. This allows you to add it directly to the dough. If you follow the directions on your active yeast (add to water and wait) then you should get the same result as if you had used instant yeast.",
				"I followed this recipe carefully yesterday and it turned out perfectly!\nI made a half recipe and let it sit in my fridge for the minimum 6 hours. My dough sat perfectly in my 12 inch pizza pan.\nIt was simple, easy, and satisfying! I will definitely be making this again. Maybe for some calzones..  🙂\nThank you!",
				"@Meghan White, I did not mean to write this in caps!! also I am not comfortable having my email posted here publicly, can you please remove this?",
				"WHAT BIZZAR DIRECTION, I WISH I READ STEP TWO BEFORE STARTING THIS RECIPE. YOUR &#8216;PINCHING&#8217; TECHNIQUE IS CONFUSING AND AN EXERCISE IN FRUSTRATION. IF YOU ARE GOING TO GIVE SUCH BIZAR DOUGH MAKING DIRECTIONS I RECOMMEND POSTING MORE PICTURES OF THE PROCESS&#8230;",
				"I just attempted this recipe. When I go to reach my hands into the bowl after first mixing with a wooden spoon, my hands get covered in dough &#8211; despite wetting them thoroughly first. I weighed out the flour according to your recipe and double checked the water amount but it seems insanely wet. I don&#8217;t know how I&#8217;m going to be able to knead this without adding a bunch more flour in. What am I doing wrong?",
				"This recipe was perfect! Thank you for explaining the importance of extra hydration for pizza going into a home oven as opposed to a high heat pizza or commercial oven. Also thanks for the tips on the pizza peel. I do. It have a peel but I applied the same principles to a flat baking sheet and it worked wonderfully. We divided the pizza dough in 2, made one large pizza for the 2 of us and froze the second for another time, and I can’t wait! Literally so excited over this recipe",
				"Hello, \nI just wanted to know if I could do the kneading using a stand mixer? \nThank you!!",
				"@Eva Agha, yay! Thanks so much for responding so quickly!",
				"Hi I hope you see this tonight and are able to comment back. I was planning on using this recipe and just skimmed through for the ingredients at the store. Then I started reading everything when I got home and saw where it said this is a wetter dough because it’s made for an oven and longer cooking time. I am making this for my dad’s house tomorrow and he has an outdoor brick oven. So this will only be cooked about 1-3 minutes at around 800 degrees. Will this still work!? Thank you!",
				"I understand this is an old post and you may not see this but I’m gonna ask anyway… Do you have a video or pictures steps to describe the pinching and pulling that seem to be a required step? I can’t seem to figure out what you mean! Or perhaps you know of another similar recipe that already has a video?",
				"I know sugar is not needed but I tend to like a touch of sweetness. Can I add a pinch of sugar or will it throw off the rising process? And if it&#8217;s ok to add, when and how much for the touch of sweetness",
				"Just to confirm, do you freeze it after letting it sit in the fridge overnight, or before that?",
				"Hi, I was making a half batch, but I can&#8217;t achieve the smooth dough with 2 cup all purpose and 3/4 water. Should I add more water?",
				"Wow!  What an arrogant jerk you are sir!!!!\nBloody hell!",
				"Question about fridge storing. I left the dough in the fridge for 3 days because&#8230; Reasons. I pinched it down once during the 3 days. On day 3 I took it out and I noticed a sour odor and a small amount of hootch like a sourdough starter. Has this happened to you and did you still use the dough?",
				"Oh man, this recipe was a total dud for me! I&#8217;m posting in hopes anyone has some advice.\nI have been making a lot of homemade pizza since March and they have all turned out amazing but this is the first overnight dough i have made and it was awful, so if anyone who hasnt tried making this yet is reading it, please beware. \nThis recipe seemed doomed from the start, are the water and flour ratios correct? When I put in 1.5cups water and FOUR cups of flour it was just a hard lumpy mass. Literally unkneadable, and looked nothing like the nice wet slack dough in the video. I triple read the instructions after to make sure I didn&#8217;t misread anything but alas, that is in fact the ratio. Just to get the dough to a kneadable state, i had to basically double the water amount. I had a feeling from this time that it was in trouble but i still followed all the instructions and wait times just in case a miracle happened (it did not).\nAfter the overnight rise, when i took the dough ball out it wasnt a cohesive dough, you could clearly separate the dough from where i folded it onto itself from the day before (again, i think the dough was too dry despite my extra water). After priming my oven, i stretch the dough, topped it, and baked.\nThe pizza was edible, but the dough was just so dense and hard and didnt rise very much at all. I may try and make it again just to see but I also dont want to waste ingredients. \nI did double check my measurements and this has never been a problem for me with any of the other multiple recipes i have used.",
				"Hi!\nI’ve been no the hunt to make the perfect pizza dough, so I’m very excited to try this recipe! I don’t have instant yeast, only Red Star Active Dry Yeast. How would you recommend I modify this recipe until I can get instant yeast?\nThank you.",
				"Could you add olive oil to this dough recipe please?",
				"Hi I’m looking to prepare pizza bases ahead of a party for around 30 people, say 50 individual 9 inch pizzas?\nWhat would you recommend to limit work on the day? Can I ‘roll’ or stretch the bases the day before and keep refrigerated- would I put these on greaseproof paper/keep them oiled?\nWe will be using our outdoor kitchen to cook &#8211; a kamado BBQ and a dedicated wood burning pizza oven with stone &#8211; any tips to ensure a thin crust that doesn’t stick?\nWe plan to practise loads in the time running up to it &#8211; do you have a video that goes long with this recipe? Thanks 🙂",
				"Gary Hewett&#8217;s recipe can&#8217;t be all that great if he&#8217;s looking for a new and improved dough recipe. I have just popped my dough in the fridge for tomorrow night. Thank you for the recipe,and advice.",
				"Hello, will this dough work with wholewheat flour?",
				"Hi! What would be the measure for a homemade natural yeast?\nAnd also you don’t add olive oil or sugar to the beginning of the dough right?\nTkss",
				"Can I have the substitute if using fresh yeast",
				"do you pre bake the dough before adding the toppings and sauce? and how long should i bake the pizza for ?",
				"I am planning to try this recipe later this week. Should I use the convection function or regular? Thanks for sharing the recipe!",
				"I found my house was a bit cold for the yeast to rise I think &#8211; after 2 hours it hadn&#8217;t done much. I heated my oven to 105f, turned it off, and stuck my covered bowl in and voila &#8211; an hour later I had lots of rise!",
				"Oops! Wrote this in the review!\nAbsolutely loved the dough! I made the exact recipe and made two dough balls. We had one tonight and the other one we want to save to make two calzones. If so, would you recommend cooking at the same time as the pizza, 550? Anyways, delicious recipe. Thank you!!!",
				"All I have on hand is rapid rise yeast. Could I lower the amount of yeast, let’s say 1/8  Tsp. Of rapids rise since that’s all I have on hand for this recipe. I can’t get my hands a regular yeast. they are sold out everywhere because of covid-19 lockdown. Thank you, stay safe and god bless!!",
				"I like to use fresh ground flour, do you have any suggestions for variations using fresh ground hard winter wheat?  I also live in Colorado so higher hydration in dough is essential, otherwise the water evaporates during the rise and doughs are too dry.  Thank you for any tips! I will be making this dough for family pizza dinner for Easter!!  The kids all get to top their own pizza.",
				"My sourdough starter is having an off day so I tried out this recipe instead! However I used fresh yeast..  hope this doesn&#8217;t upset the recipe too much. \nThe dough seems incredibly wet though and I can&#8217;t stop it sticking all over my hands resulting in dough covered flour bags!\nI&#8217;m now waiting for  an hour for it to rise before shaping it into 3 then leaving in the fridge for dinner tomorrow.  I hope it will be a bit more manageable! \nWish me luck! 😀",
				"Is there any way to substitute an ingredient for yeast?  Don&#8217;t have any on hand in my pantry.",
				"Trying my hand at this now, I wish there were more pictures for each step. I make bread a lot, but this is my first time making pizza dough. How much of a rise should I be expecting? For bread it&#8217;s very visible, but so far I don&#8217;t see much of anything with my dough. Right now I&#8217;m at the 1-2 hour bulk fermentation. \nAlso, when putting the balls into the fridge, will they stay in balls or kind of flatten out? Will the continue to rise while in the fridge? I&#8217;m trying to figure out the best way to do it because I made 3 batches so I will have a total of 6 balls. It seems easier to put them all onto a floured baking sheet rather than 6 plates, but I don&#8217;t want to do that and then have them all flatten out and lump together.. What are your thoughts? Thanks!",
				"My dough has not risen at all.",
				"I had great success with this, especially with a steel. I&#8217;m making it again, but I still don&#8217;t quite understand the &#8220;shaping the dough&#8221; step. I don&#8217;t know what shape I&#8217;m supposed to end up with when storing it for a few days. Am I stretching it then reforming to a ball? \nAlso do you think you could freeze this?",
				"Wow, I&#8217;m astonished that someone would be so rude!",
				"Gary,\n    Your critique is as bad as your parent&#8217;s failure to raise a kind and intelligent human being. Please kindly return to what ever troll cave you were born in and stay away from us humans, thanks.",
				"As someone that is an accomplished pizza-bread maker, I tried the overnight pizza dough recipe to see how it stacked up against my regular dough and was fully underwhelmed. I can only assume the worst, such as that, these amazed at the results of overnight pizza dough makers are the same people that make up the contestants on the Americas Worst Cooks show! I was up for a new and improved dough recipe but this wasn&#8217;t it. I can do much better with my regular method in a few hours.It had very little to recommend as an improvement, 1 item actually. The dough was pliable and easy to work, but had no flavor to add to the finished pizza! Certainly not worth the added effort. Get a Pizza stone an a oven that will hold 500 degrees, for your best shot at it. An additional issue might be that low expectations!!!",
				"Your pizza dough looks absolutely perfect. Will have to give this a try.",
				"Can you use all purpose gluten free flour?  I have not perfected a gf pizza . Yet",
				"What vegan cheese did you use for this pizza?",
				"I’m planning to make a large batch for a party and had few questions. When making a large batch of dough , did you do any additional kneading before bulk fermentation, or just put the dough in fridge? Did you shape the balls the day you make pizzas and use it immediately or did you let it warm  up and ferment some more before shaping?",
				"I agree. I search and search and wish I could find this exact kind of recipe (slow rise/ferment in the fridge) but just want a yield of one pizza. It obviously saves time to make a big batch but I can&#8217;t get through three pizzas in as many days and I&#8217;ve had rotten luck with freezing and defrosting pizza dough.",
				"I wish this recipe instructed on the amount of ingredients for just one pizza. I don&#8217;t want or need multiple doughs.",
				"I was planning to make pizza for a party of around 50 freinds and needed to make the dough a day before. Found this recipe and it was perfect. I made *10 the quantity in one batch, which was tough, but made around 15-18 14&#8243; pizzas (I lost count) In a steel pizza oven. I didn&#8217;t separate the dough into individual pizzas before hand because of the quantity, instead I kept it in 2 halfs in large bags with plenty oil, which was fine. The dough was the best I have made and everyone at the party went crazy for it, so much air in the crust. The main plus of this is how good it tastes and that thin or thick crust are both delicious, which is not always th case (with some recipes favouring thin or thick). From now on this will be my go to recipe. Thanks a lot for making the part a success. Wish I could share photos.",
				"This was wonderful! We made a deep dish and two thins with the recipe. No one knew it was a vegan recipe until I told them. The instructions were easy to follow and the taste was fantastic. Thank you for helping this journey of a new lifestyle (no dairy and no eggs) be one that is easier to do than I thought.",
				"Thanks for the recipe!\nI am planning to prepare dough for 10 people, each having their own 10&#8243; pizza. Would you recommend tripling the recipe to fit this quantity?\nI will also be cooking these over campfire coals in cast iron pans, oiled, and covered with aluminum foil. I was planning to use the high heat of direct contact with the coals and to cook for about 5 minutes. Do you have any insight into how I may best achieve thoroughly cooked dough?\nThanks again!",
				"Hi! Can you freeze the dough if you dont use it all?",
				"We do pizza every Friday so I can&#8217;t wait to try this out! It looks so easy!",
				"Great recipe? Have you tried using bread flour?",
				"I rarely review recipes, but I made this on Tuesday night, so that Wednesday evening I&#8217;d have a simple meal ready to go. I loved this crust, and mind you I did not follow the recipe perfectly, nor did I have the peel nor the stone. I just used a square small baking sheet, oiled it up, topped it and baked it. The crust was nicely crisped, with lovely coloring and such a nice flavor. I&#8217;ve made a lot of pizza dough recipes, but this one worked great with the limitations I had. AND THANK YOU for posting grams. I much prefer to make dough by weight instead of volume. \nAlso can I just mention how much I love pizza for using up the scraps? I had a cup of homemade spaghetti sauce left, which turned into pizza sauce. Some leftover shredded chicken, from the stock I had made for chicken noodle soup. And some languishing spinach in my fridge. One pizza was turned into bbq chicken + pineapple pizza. The other was spinach and anchovy.",
				"1/4 tsp of instant yeast? Seems very low. No sugar?",
				"..FLOUR&#8230;LOL?",
				"&#8230; have you ever used active sourdough starter in this pizza dough and can I use bread flower I also have double zero from Italy that&#8217;s actually made for pizza have a great night..!!?????"
			],
			"image": "https://www.thecuriouschickpea.com/wp-content/uploads/2019/07/pizza-dough-short-pin.jpg"
		},
		null,
		null,
		null,
		null,
		{
			"title": "Vegan Almond Rhubarb Bundt Cake",
			"ingredients": [
				{
					"Vegan Almond Rhubarb Bundt Cake": [
						"1 1/2 cups (175g) rhubarb, thinly sliced",
						"1/4 cup (50g) sugar",
						"1 1/4 cups (300g) non dairy milk",
						"1/3 cup (64g) canola oil",
						"1/3 cup (70g) plain or unsweetened nondairy yogurt",
						"1/4 cup (45g) freshly squeezed lemon juice (~1 lemon)",
						"2 tsp vanilla extract",
						"1 tsp almond extract",
						"2 cups (280g) all purpose flour",
						"2/3 cup (74g) almond flour*",
						"3/4 cup (150g) sugar",
						"1 tbsp (9g) cornstarch",
						"1 tsp baking powder",
						"1/2 tsp baking soda",
						"1/2 tsp salt"
					]
				},
				{
					"Strawberry Rhubarb Compote and Glaze": [
						"1 1/2 (175g) cups rhubarb, sliced",
						"1/2 cup (75g) strawberries, cut in half",
						"1/4 cup (50g) sugar",
						"1/4 cup (60g) water",
						"1 tbsp freshly squeezed lemon juice",
						"1 cup powdered sugar"
					]
				}
			],
			"time": "1 hour 5 minutes",
			"serving": "1 bundt cake",
			"recipe": [
				"1. Preheat your oven to 375 ºF with a rack placed in the center and grease a 12-cup bundt pan.",
				"2. Toss together the rhubarb and 1/4 cup sugar in a small bowl. Set aside.",
				"3. In a large mixing bowl combine and mix the nondairy milk, oil, yogurt, lemon juice, vanilla extract, and almond extract.",
				"4. In a medium mixing bowl sift together the all purpose flour, almond flour, sugar, cornstarch, baking powder, baking soda, salt. Whisk to combine the dry ingredients.",
				"5. Add the dry ingredients to the wet, and whisk to combine until fairly smooth. A couple small lumps are okay. Fold in the rhubarb.",
				"6. Pour the batter into the prepared bundt pan and shake a little to level out the top.",
				"7. Bake for 48-52 minutes, until a tester comes out clean. Let cool for 10 minutes, then remove cake from pan and set on a wire rack to cool completely.",
				"8. Glaze or dust with powdered sugar when completely cool and before serving.",
				"9. First make a strawberry rhubarb compote: Combine the rhubarb, strawberries, sugar, water, and lemon juice in a small pot. Heat to a boil, then lower heat and simmer for around 15 minutes, stirring occasionally, until the fruit has broken down and it's the consistency of applesauce. Puree until smooth with an immersion blender, or use a regular blender.",
				"10. To make the glaze:",
				"11. Combine 3 tablespoons of the puree with 1 cup of powdered sugar. Mix together, and check the consistency. You want it to be thick but flowing and pourable. Add an additional tablespoon of puree if needed. Pour over cake as desired!"
			],
			"nutrition": {
				"calories": "299kcal",
				"carbs": "47g",
				"protein": "6g",
				"total fat": "10g"
			},
			"comments": [],
			"image": "https://www.thecuriouschickpea.com/wp-content/uploads/2019/06/almond-rhubarb-bundt-cake-pinterest.jpg"
		},
		null,
		null,
		null,
		null,
		null,
		null,
		null,
		null,
		null,
		null,
		null,
		null,
		null,
		null,
		null,
		null,
		null,
		null,
		null,
		null,
		null,
		null,
		null,
		null,
		null,
		null,
		null,
		null,
		null,
		null,
		null,
		null,
		null,
		null,
		null,
		null,
		null,
		{
			"title": "Gochujang Tofu Dumplings",
			"ingredients": [
				{
					"Dumpling Dough": [
						"2 cups (260g) all purpose flour",
						"1/4 tsp (1.5g) salt",
						"1 tbsp (12g) oil",
						"3/4 cups + 1 tbsp (185g) boiling hot water"
					]
				},
				{
					"Dumpling Filling": [
						"1 tbsp oil",
						"14oz extra firm tofu, pressed* and crumbled",
						"2 cups (180g) green cabbage",
						"1/2 cup (50g) chopped green onions",
						"3-4 cloves garlic, minced",
						"1/4 cup chopped cilantro (leaves and stems)",
						"1/4 cup (75g) gochujang paste",
						"2 tbsp hot water",
						"1 tbsp toasted sesame oil",
						"1 1/2 tsp soy sauce",
						"sesame seeds for the bottom of the wrappers (optional)"
					]
				}
			],
			"time": "1 hour 25 minutes",
			"serving": "32 dumplings",
			"recipe": [
				"1. Prepare the dumpling dough: in a stand mixer bowl combine the flour, salt, oil, and boiling hot water. Stir with a wooden spoon to combine bring into a rough dough. Using the dough hook on a stand mixer knead on low speed for 3 minutes, turn off and let the dough rest for 5 minutes, then knead an additional 3 minutes on low speed. ",
				"2. Turn out onto the counter and knead by hand for about 1 minute and make any last adjustments with flour or water to make a smooth and supple dough that's slightly tacky (but not sticky) to the touch. Cover with a damp towel and let the dough rest for about 20 minutes while you prepare the filling. Alternatively you can knead by hand, just let the dough cool enough to not burn your hands and follow the same knead 3m, rest 5m, knead 3m pattern, making adjustments with flour as you knead.",
				"3. Prepare the filling: Heat a skillet over medium heat, add 1 tablespoon of oil and add the tofu. Fry for 4-5 minutes, stirring occasionally. Add the cabbage, green onion, garlic, plus a pinch of salt and let cook 5-6 minutes until the cabbage has released its water and the mixture has cooked down.",
				"4. In a small mixing bowl, mix together the gochujang paste, hot water, toasted sesame oil, and soy sauce to form a smooth sauce. Add the sauce to the tofu mixture along with the cilantro, stir to combine then turn off the heat and let cool to room temperature. You can transfer to a plate and put in fridge to speed up the process.",
				"5. Fill and shape the dumplings: Divide the rested dumpling dough into 32 pieces: cut in half, then each half into quarters, and each quarter into quarters to get 32. Keep them covered under the damp towel in the bowl, working with just a few at a time.",
				"6. Lightly dust the counter and roll out each piece of dough individually to make a thin circle, about the size of your palm. Using your finger or a pastry brush, brush a little water just around the edge of the circle, about 1cm thick. Put the wrapper in one hand, and place a heaping teaspoon of filling in the center of the wrapper. With your other hand fold the wrapper in half and pinch in the center so it seals, then working towards the edge, pleat one side and press to seal against the opposite side, then work down the other side. You can also create folds starting from one edge and working to the others so that all the pleats fold in the same direction, but this method is a bit more challenging for a beginner. Set aside onto a piece of parchment paper and repeat with remaining pieces of dough.",
				"7. When the dumplings are all shaped, put a thin layer of water in a bowl and pour sesame seeds to cover a small plate. Dip the dumplings in the water then dip into the sesame seeds (this step is optional) and return to the parchment paper.",
				"8. Cook the dumplings: heat a skillet over medium heat. Add a tablespoon or so of oil to coat the bottom of the pan in a thin layer. Add dumplings in batches, being careful not to overcrowd the pan. Let cook for about 2 minutes, then add 1/4 cup of water (be careful of splattering, hold a lid up to protect you as you pour) and immediately cover the skillet. Let steam for 5 minutes. Remove the lid and if the bottoms are still too light in color, let them continue to cook until golden.",
				"9. Repeat with second and if needed, third batch of dumplings and eat while hot!"
			],
			"nutrition": {
				"calories": "66kcal",
				"carbs": "9g",
				"protein": "2g",
				"total fat": "3g"
			},
			"comments": [
				"Do you have a recipe for a gluten-free dumpling dough?",
				"I saw gochujang at my grocery store, Sempio brand which is based in Korea, it was packaged in a red tub like the product you linked to on Amazon above, but the package said sweet and spicy sauce. I forgot to check the ingredient list but do you think what is inside the red tub is more paste-like rather than sauce-like??????",
				"I made these and they were amazing!  I made a little dipping sauce as well and a carrot daikon salad.  Very big hit.  I did purchase vegan wontons to save some time.  Can&#8217;t wait to make them again.  I&#8217;m actually craving them as I write this.  We got 30 dumplings from the recipe.  Thanks so much for this fabulous recipe!"
			],
			"image": "https://www.thecuriouschickpea.com/wp-content/uploads/2019/02/vegan-gochujang-tofu-dumplings-12.jpg"
		},
		null,
		null,
		null,
		null,
		null,
		null,
		null,
		null,
		null,
		null,
		null,
		null,
		null,
		null,
		null,
		null,
		null,
		null,
		null,
		null,
		null,
		null,
		null,
		null,
		null,
		null,
		null,
		null,
		null,
		null,
		null,
		null,
		null,
		null,
		null,
		null,
		null,
		null,
		null,
		null,
		null,
		null,
		null,
		null,
		null,
		null,
		null,
		null,
		null,
		null,
		null,
		null,
		null,
		null,
		null,
		null,
		null,
		null,
		null,
		null,
		null,
		null,
		null,
		null,
		null,
		null,
		null,
		null,
		null,
		null,
		null,
		null,
		null,
		null,
		null,
		null,
		null,
		null,
		null,
		null,
		null,
		null,
		null,
		null,
		null,
		null,
		null,
		null,
		null,
		null,
		null,
		null,
		null,
		null,
		null,
		null,
		null,
		null,
		null,
		null,
		null,
		null,
		null,
		null,
		null,
		null,
		null,
		null,
		null,
		null,
		null,
		null,
		null,
		null,
		null,
		null,
		null,
		null,
		null,
		null,
		null,
		null,
		null,
		null,
		null,
		null,
		null,
		null,
		null,
		null,
		null,
		null,
		null,
		null,
		null,
		null,
		null,
		null,
		null,
		null,
		null,
		null,
		null,
		null,
		null,
		null,
		null,
		null,
		null,
		null,
		null,
		null,
		null,
		null,
		null
	]
}